<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <link rel="stylesheet" href="book.css" type="text/css" />
</head>
<body>
<h2 id="python&#25945;&#31243;">Python&#25945;&#31243;</h2>
<p>&#36825;&#26159;&#23567;&#30333;&#30340;Python&#26032;&#25163;&#25945;&#31243;&#65292;&#20855;&#26377;&#22914;&#19979;&#29305;&#28857;&#65306; <strong>&#20013;&#25991;&#65292;&#20813;&#36153;&#65292;&#38646;&#36215;&#28857;&#65292;&#23436;&#25972;&#31034;&#20363;&#65292;&#22522;&#20110;&#26368;&#26032;&#30340;Python 3&#29256;&#26412;</strong>&#12290;</p>
<p>Python&#26159;&#19968;&#31181;&#35745;&#31639;&#26426;&#31243;&#24207;&#35774;&#35745;&#35821;&#35328;&#12290;&#20320;&#21487;&#33021;&#24050;&#32463;&#21548;&#35828;&#36807;&#24456;&#22810;&#31181;&#27969;&#34892;&#30340;&#32534;&#31243;&#35821;&#35328;&#65292;&#27604;&#22914;&#38750;&#24120;&#38590;&#23398;&#30340;C&#35821;&#35328;&#65292;&#38750;&#24120;&#27969;&#34892;&#30340;Java&#35821;&#35328;&#65292;&#36866;&#21512;&#21021;&#23398;&#32773;&#30340;Basic&#35821;&#35328;&#65292;&#36866;&#21512;&#32593;&#39029;&#32534;&#31243;&#30340;JavaScript&#35821;&#35328;&#31561;&#31561;&#12290;</p>
<p>&#37027;Python&#26159;&#19968;&#31181;&#20160;&#20040;&#35821;&#35328;&#65311;</p>
<p>&#39318;&#20808;&#65292;&#25105;&#20204;&#26222;&#21450;&#19968;&#19979;&#32534;&#31243;&#35821;&#35328;&#30340;&#22522;&#30784;&#30693;&#35782;&#12290;&#29992;&#20219;&#20309;&#32534;&#31243;&#35821;&#35328;&#26469;&#24320;&#21457;&#31243;&#24207;&#65292;&#37117;&#26159;&#20026;&#20102;&#35753;&#35745;&#31639;&#26426;&#24178;&#27963;&#65292;&#27604;&#22914;&#19979;&#36733;&#19968;&#20010;MP3&#65292;&#32534;&#20889;&#19968;&#20010;&#25991;&#26723;&#31561;&#31561;&#65292;&#32780;&#35745;&#31639;&#26426;&#24178;&#27963;&#30340;CPU&#21482;&#35748;&#35782;&#26426;&#22120;&#25351;&#20196;&#65292;&#25152;&#20197;&#65292;&#23613;&#31649;&#19981;&#21516;&#30340;&#32534;&#31243;&#35821;&#35328;&#24046;&#24322;&#26497;&#22823;&#65292;&#26368;&#21518;&#37117;&#24471;&#8220;&#32763;&#35793;&#8221;&#25104;CPU&#21487;&#20197;&#25191;&#34892;&#30340;&#26426;&#22120;&#25351;&#20196;&#12290;&#32780;&#19981;&#21516;&#30340;&#32534;&#31243;&#35821;&#35328;&#65292;&#24178;&#21516;&#19968;&#20010;&#27963;&#65292;&#32534;&#20889;&#30340;&#20195;&#30721;&#37327;&#65292;&#24046;&#36317;&#20063;&#24456;&#22823;&#12290;</p>
<p>&#27604;&#22914;&#65292;&#23436;&#25104;&#21516;&#19968;&#20010;&#20219;&#21153;&#65292;C&#35821;&#35328;&#35201;&#20889;1000&#34892;&#20195;&#30721;&#65292;Java&#21482;&#38656;&#35201;&#20889;100&#34892;&#65292;&#32780;Python&#21487;&#33021;&#21482;&#35201;20&#34892;&#12290;</p>
<p>&#25152;&#20197;Python&#26159;&#19968;&#31181;&#30456;&#24403;&#39640;&#32423;&#30340;&#35821;&#35328;&#12290;</p>
<p>&#20320;&#20063;&#35768;&#20250;&#38382;&#65292;&#20195;&#30721;&#23569;&#36824;&#19981;&#22909;&#65311;&#20195;&#30721;&#23569;&#30340;&#20195;&#20215;&#26159;&#36816;&#34892;&#36895;&#24230;&#24930;&#65292;C&#31243;&#24207;&#36816;&#34892;1&#31186;&#38047;&#65292;Java&#31243;&#24207;&#21487;&#33021;&#38656;&#35201;2&#31186;&#65292;&#32780;Python&#31243;&#24207;&#21487;&#33021;&#23601;&#38656;&#35201;10&#31186;&#12290;</p>
<p>&#37027;&#26159;&#19981;&#26159;&#36234;&#20302;&#32423;&#30340;&#31243;&#24207;&#36234;&#38590;&#23398;&#65292;&#36234;&#39640;&#32423;&#30340;&#31243;&#24207;&#36234;&#31616;&#21333;&#65311;&#34920;&#38754;&#19978;&#26469;&#35828;&#65292;&#26159;&#30340;&#65292;&#20294;&#26159;&#65292;&#22312;&#38750;&#24120;&#39640;&#30340;&#25277;&#35937;&#35745;&#31639;&#20013;&#65292;&#39640;&#32423;&#30340;Python&#31243;&#24207;&#35774;&#35745;&#20063;&#26159;&#38750;&#24120;&#38590;&#23398;&#30340;&#65292;&#25152;&#20197;&#65292;&#39640;&#32423;&#31243;&#24207;&#35821;&#35328;&#19981;&#31561;&#20110;&#31616;&#21333;&#12290;</p>
<p>&#20294;&#26159;&#65292;&#23545;&#20110;&#21021;&#23398;&#32773;&#21644;&#23436;&#25104;&#26222;&#36890;&#20219;&#21153;&#65292;Python&#35821;&#35328;&#26159;&#38750;&#24120;&#31616;&#21333;&#26131;&#29992;&#30340;&#12290;&#36830;Google&#37117;&#22312;&#22823;&#35268;&#27169;&#20351;&#29992;Python&#65292;&#20320;&#23601;&#19981;&#29992;&#25285;&#24515;&#23398;&#20102;&#20250;&#27809;&#29992;&#12290;</p>
<p>&#29992;Python&#21487;&#20197;&#20570;&#20160;&#20040;&#65311;&#21487;&#20197;&#20570;&#26085;&#24120;&#20219;&#21153;&#65292;&#27604;&#22914;&#33258;&#21160;&#22791;&#20221;&#20320;&#30340;MP3&#65307;&#21487;&#20197;&#20570;&#32593;&#31449;&#65292;&#24456;&#22810;&#33879;&#21517;&#30340;&#32593;&#31449;&#21253;&#25324;YouTube&#23601;&#26159;Python&#20889;&#30340;&#65307;&#21487;&#20197;&#20570;&#32593;&#32476;&#28216;&#25103;&#30340;&#21518;&#21488;&#65292;&#24456;&#22810;&#22312;&#32447;&#28216;&#25103;&#30340;&#21518;&#21488;&#37117;&#26159;Python&#24320;&#21457;&#30340;&#12290;&#24635;&#20043;&#23601;&#26159;&#33021;&#24178;&#24456;&#22810;&#24456;&#22810;&#20107;&#21862;&#12290;</p>
<p>Python&#24403;&#28982;&#20063;&#26377;&#19981;&#33021;&#24178;&#30340;&#20107;&#24773;&#65292;&#27604;&#22914;&#20889;&#25805;&#20316;&#31995;&#32479;&#65292;&#36825;&#20010;&#21482;&#33021;&#29992;C&#35821;&#35328;&#20889;&#65307;&#20889;&#25163;&#26426;&#24212;&#29992;&#65292;&#21482;&#33021;&#29992;Swift/Objective-C&#65288;&#38024;&#23545;iPhone&#65289;&#21644;Java&#65288;&#38024;&#23545;Android&#65289;&#65307;&#20889;3D&#28216;&#25103;&#65292;&#26368;&#22909;&#29992;C&#25110;C++&#12290;</p>
<p>&#22914;&#26524;&#20320;&#26159;&#23567;&#30333;&#29992;&#25143;&#65292;&#28385;&#36275;&#20197;&#19979;&#26465;&#20214;&#65306;</p>
<ul>
<li>&#20250;&#20351;&#29992;&#30005;&#33041;&#65292;&#20294;&#20174;&#26469;&#27809;&#20889;&#36807;&#31243;&#24207;&#65307;</li>
<li>&#36824;&#35760;&#24471;&#21021;&#20013;&#25968;&#23398;&#23398;&#30340;&#26041;&#31243;&#24335;&#21644;&#19968;&#28857;&#28857;&#20195;&#25968;&#30693;&#35782;&#65307;</li>
<li>&#24819;&#20174;&#32534;&#31243;&#23567;&#30333;&#21464;&#25104;&#19987;&#19994;&#30340;&#36719;&#20214;&#26550;&#26500;&#24072;&#65307;</li>
<li>&#27599;&#22825;&#33021;&#25277;&#20986;&#21322;&#20010;&#23567;&#26102;&#23398;&#20064;&#12290;</li>
</ul>
<p>&#19981;&#35201;&#20877;&#29369;&#35947;&#20102;&#65292;&#36825;&#20010;&#25945;&#31243;&#23601;&#26159;&#20026;&#20320;&#20934;&#22791;&#30340;&#65281;</p>
<p>&#20934;&#22791;&#22909;&#20102;&#21527;&#65311;</p>
<div class="figure">
<img src="http://www.liaoxuefeng.com/files/attachments/00138676512923004999ceca5614eb2afc5c0efdd2e4640000/0" alt="challenge-accepted" />
<p class="caption">challenge-accepted</p>
</div>
<h3 id="&#20851;&#20110;&#20316;&#32773;">&#20851;&#20110;&#20316;&#32773;</h3>
<p>&#24278;&#38634;&#23792;&#65292;&#21313;&#24180;&#36719;&#20214;&#24320;&#21457;&#32463;&#39564;&#65292;&#19994;&#20313;&#20135;&#21697;&#32463;&#29702;&#65292;&#31934;&#36890;Java/Python/Ruby/Scheme/Objective C&#31561;&#65292;&#23545;&#24320;&#28304;&#26694;&#26550;&#26377;&#28145;&#20837;&#30740;&#31350;&#65292;&#33879;&#26377;&#12298;Spring 2.0&#26680;&#24515;&#25216;&#26415;&#19982;&#26368;&#20339;&#23454;&#36341;&#12299;&#19968;&#20070;&#65292;&#22810;&#20010;&#19994;&#20313;&#24320;&#28304;&#39033;&#30446;&#25176;&#31649;&#22312;GitHub&#65292;&#27426;&#36814;&#24494;&#21338;&#20132;&#27969;&#65306;</p>
<h3 id="python&#31616;&#20171;">Python&#31616;&#20171;</h3>
<p>Python&#26159;&#33879;&#21517;&#30340;&#8220;&#40863;&#21460;&#8221;Guido van Rossum&#22312;1989&#24180;&#22307;&#35806;&#33410;&#26399;&#38388;&#65292;&#20026;&#20102;&#25171;&#21457;&#26080;&#32842;&#30340;&#22307;&#35806;&#33410;&#32780;&#32534;&#20889;&#30340;&#19968;&#20010;&#32534;&#31243;&#35821;&#35328;&#12290;</p>
<p>&#29616;&#22312;&#65292;&#20840;&#19990;&#30028;&#24046;&#19981;&#22810;&#26377;600&#22810;&#31181;&#32534;&#31243;&#35821;&#35328;&#65292;&#20294;&#27969;&#34892;&#30340;&#32534;&#31243;&#35821;&#35328;&#20063;&#23601;&#37027;&#20040;20&#26469;&#31181;&#12290;&#22914;&#26524;&#20320;&#21548;&#35828;&#36807;TIOBE&#25490;&#34892;&#27036;&#65292;&#20320;&#23601;&#33021;&#30693;&#36947;&#32534;&#31243;&#35821;&#35328;&#30340;&#22823;&#33268;&#27969;&#34892;&#31243;&#24230;&#12290;&#36825;&#26159;&#26368;&#36817;10&#24180;&#26368;&#24120;&#29992;&#30340;10&#31181;&#32534;&#31243;&#35821;&#35328;&#30340;&#21464;&#21270;&#22270;&#65306;</p>
<div class="figure">
<img src="http://www.liaoxuefeng.com/files/attachments/00138595453161126cc9f11f1d441b0934661239528fa55000/0" alt="tpci_trends" />
<p class="caption">tpci_trends</p>
</div>
<p>&#24635;&#30340;&#26469;&#35828;&#65292;&#36825;&#20960;&#31181;&#32534;&#31243;&#35821;&#35328;&#21508;&#26377;&#21315;&#31179;&#12290;C&#35821;&#35328;&#26159;&#21487;&#20197;&#29992;&#26469;&#32534;&#20889;&#25805;&#20316;&#31995;&#32479;&#30340;&#36148;&#36817;&#30828;&#20214;&#30340;&#35821;&#35328;&#65292;&#25152;&#20197;&#65292;C&#35821;&#35328;&#36866;&#21512;&#24320;&#21457;&#37027;&#20123;&#36861;&#27714;&#36816;&#34892;&#36895;&#24230;&#12289;&#20805;&#20998;&#21457;&#25381;&#30828;&#20214;&#24615;&#33021;&#30340;&#31243;&#24207;&#12290;&#32780;Python&#26159;&#29992;&#26469;&#32534;&#20889;&#24212;&#29992;&#31243;&#24207;&#30340;&#39640;&#32423;&#32534;&#31243;&#35821;&#35328;&#12290;</p>
<p>&#24403;&#20320;&#29992;&#19968;&#31181;&#35821;&#35328;&#24320;&#22987;&#20316;&#30495;&#27491;&#30340;&#36719;&#20214;&#24320;&#21457;&#26102;&#65292;&#20320;&#38500;&#20102;&#32534;&#20889;&#20195;&#30721;&#22806;&#65292;&#36824;&#38656;&#35201;&#24456;&#22810;&#22522;&#26412;&#30340;&#24050;&#32463;&#20889;&#22909;&#30340;&#29616;&#25104;&#30340;&#19996;&#35199;&#65292;&#26469;&#24110;&#21161;&#20320;&#21152;&#24555;&#24320;&#21457;&#36827;&#24230;&#12290;&#27604;&#22914;&#35828;&#65292;&#35201;&#32534;&#20889;&#19968;&#20010;&#30005;&#23376;&#37038;&#20214;&#23458;&#25143;&#31471;&#65292;&#22914;&#26524;&#20808;&#20174;&#26368;&#24213;&#23618;&#24320;&#22987;&#32534;&#20889;&#32593;&#32476;&#21327;&#35758;&#30456;&#20851;&#30340;&#20195;&#30721;&#65292;&#37027;&#20272;&#35745;&#19968;&#24180;&#21322;&#36733;&#20063;&#24320;&#21457;&#19981;&#20986;&#26469;&#12290;&#39640;&#32423;&#32534;&#31243;&#35821;&#35328;&#36890;&#24120;&#37117;&#20250;&#25552;&#20379;&#19968;&#20010;&#27604;&#36739;&#23436;&#21892;&#30340;&#22522;&#30784;&#20195;&#30721;&#24211;&#65292;&#35753;&#20320;&#33021;&#30452;&#25509;&#35843;&#29992;&#65292;&#27604;&#22914;&#65292;&#38024;&#23545;&#30005;&#23376;&#37038;&#20214;&#21327;&#35758;&#30340;SMTP&#24211;&#65292;&#38024;&#23545;&#26700;&#38754;&#29615;&#22659;&#30340;GUI&#24211;&#65292;&#22312;&#36825;&#20123;&#24050;&#26377;&#30340;&#20195;&#30721;&#24211;&#30340;&#22522;&#30784;&#19978;&#24320;&#21457;&#65292;&#19968;&#20010;&#30005;&#23376;&#37038;&#20214;&#23458;&#25143;&#31471;&#20960;&#22825;&#23601;&#33021;&#24320;&#21457;&#20986;&#26469;&#12290;</p>
<p>Python&#23601;&#20026;&#25105;&#20204;&#25552;&#20379;&#20102;&#38750;&#24120;&#23436;&#21892;&#30340;&#22522;&#30784;&#20195;&#30721;&#24211;&#65292;&#35206;&#30422;&#20102;&#32593;&#32476;&#12289;&#25991;&#20214;&#12289;GUI&#12289;&#25968;&#25454;&#24211;&#12289;&#25991;&#26412;&#31561;&#22823;&#37327;&#20869;&#23481;&#65292;&#34987;&#24418;&#35937;&#22320;&#31216;&#20316;&#8220;&#20869;&#32622;&#30005;&#27744;&#65288;batteries included&#65289;&#8221;&#12290;&#29992;Python&#24320;&#21457;&#65292;&#35768;&#22810;&#21151;&#33021;&#19981;&#24517;&#20174;&#38646;&#32534;&#20889;&#65292;&#30452;&#25509;&#20351;&#29992;&#29616;&#25104;&#30340;&#21363;&#21487;&#12290;</p>
<p>&#38500;&#20102;&#20869;&#32622;&#30340;&#24211;&#22806;&#65292;Python&#36824;&#26377;&#22823;&#37327;&#30340;&#31532;&#19977;&#26041;&#24211;&#65292;&#20063;&#23601;&#26159;&#21035;&#20154;&#24320;&#21457;&#30340;&#65292;&#20379;&#20320;&#30452;&#25509;&#20351;&#29992;&#30340;&#19996;&#35199;&#12290;&#24403;&#28982;&#65292;&#22914;&#26524;&#20320;&#24320;&#21457;&#30340;&#20195;&#30721;&#36890;&#36807;&#24456;&#22909;&#30340;&#23553;&#35013;&#65292;&#20063;&#21487;&#20197;&#20316;&#20026;&#31532;&#19977;&#26041;&#24211;&#32473;&#21035;&#20154;&#20351;&#29992;&#12290;</p>
<p>&#35768;&#22810;&#22823;&#22411;&#32593;&#31449;&#23601;&#26159;&#29992;Python&#24320;&#21457;&#30340;&#65292;&#20363;&#22914;<code>YouTube</code>&#12289;<code>Instagram</code>&#65292;&#36824;&#26377;&#22269;&#20869;&#30340;<code>&#35910;&#29923;</code>&#12290;&#24456;&#22810;&#22823;&#20844;&#21496;&#65292;&#21253;&#25324;Google&#12289;Yahoo&#31561;&#65292;&#29978;&#33267;NASA&#65288;&#32654;&#22269;&#33322;&#31354;&#33322;&#22825;&#23616;&#65289;&#37117;&#22823;&#37327;&#22320;&#20351;&#29992;Python&#12290;</p>
<p>&#40863;&#21460;&#32473;Python&#30340;&#23450;&#20301;&#26159;&#8220;&#20248;&#38597;&#8221;&#12289;&#8220;&#26126;&#30830;&#8221;&#12289;&#8220;&#31616;&#21333;&#8221;&#65292;&#25152;&#20197;Python&#31243;&#24207;&#30475;&#19978;&#21435;&#24635;&#26159;&#31616;&#21333;&#26131;&#25026;&#65292;&#21021;&#23398;&#32773;&#23398;Python&#65292;&#19981;&#20294;&#20837;&#38376;&#23481;&#26131;&#65292;&#32780;&#19988;&#23558;&#26469;&#28145;&#20837;&#19979;&#21435;&#65292;&#21487;&#20197;&#32534;&#20889;&#37027;&#20123;&#38750;&#24120;&#38750;&#24120;&#22797;&#26434;&#30340;&#31243;&#24207;&#12290;</p>
<p>&#24635;&#30340;&#26469;&#35828;&#65292;Python&#30340;&#21746;&#23398;&#23601;&#26159;&#31616;&#21333;&#20248;&#38597;&#65292;&#23613;&#37327;&#20889;&#23481;&#26131;&#30475;&#26126;&#30333;&#30340;&#20195;&#30721;&#65292;&#23613;&#37327;&#20889;&#23569;&#30340;&#20195;&#30721;&#12290;&#22914;&#26524;&#19968;&#20010;&#36164;&#28145;&#31243;&#24207;&#21592;&#21521;&#20320;&#28843;&#32768;&#20182;&#20889;&#30340;&#26214;&#28073;&#38590;&#25026;&#12289;&#21160;&#19981;&#21160;&#23601;&#20960;&#19975;&#34892;&#30340;&#20195;&#30721;&#65292;&#20320;&#21487;&#20197;&#23613;&#24773;&#22320;&#22066;&#31505;&#20182;&#12290;</p>
<p>&#37027;Python&#36866;&#21512;&#24320;&#21457;&#21738;&#20123;&#31867;&#22411;&#30340;&#24212;&#29992;&#21602;&#65311;</p>
<ul>
<li><p>&#39318;&#36873;&#26159;&#32593;&#32476;&#24212;&#29992;&#65292;&#21253;&#25324;&#32593;&#31449;&#12289;&#21518;&#21488;&#26381;&#21153;&#31561;&#31561;&#65307;</p></li>
<li><p>&#20854;&#27425;&#26159;&#35768;&#22810;&#26085;&#24120;&#38656;&#35201;&#30340;&#23567;&#24037;&#20855;&#65292;&#21253;&#25324;&#31995;&#32479;&#31649;&#29702;&#21592;&#38656;&#35201;&#30340;&#33050;&#26412;&#20219;&#21153;&#31561;&#31561;&#65307;</p></li>
<li><p>&#21478;&#22806;&#23601;&#26159;&#25226;&#20854;&#20182;&#35821;&#35328;&#24320;&#21457;&#30340;&#31243;&#24207;&#20877;&#21253;&#35013;&#36215;&#26469;&#65292;&#26041;&#20415;&#20351;&#29992;&#12290;</p></li>
</ul>
<p>&#26368;&#21518;&#35828;&#35828;Python&#30340;&#32570;&#28857;&#12290;</p>
<p>&#20219;&#20309;&#32534;&#31243;&#35821;&#35328;&#37117;&#26377;&#32570;&#28857;&#65292;Python&#20063;&#19981;&#20363;&#22806;&#12290;&#20248;&#28857;&#35828;&#36807;&#20102;&#65292;&#37027;Python&#26377;&#21738;&#20123;&#32570;&#28857;&#21602;&#65311;</p>
<p>&#31532;&#19968;&#20010;&#32570;&#28857;&#23601;&#26159;&#36816;&#34892;&#36895;&#24230;&#24930;&#65292;&#21644;C&#31243;&#24207;&#30456;&#27604;&#38750;&#24120;&#24930;&#65292;&#22240;&#20026;Python&#26159;&#35299;&#37322;&#22411;&#35821;&#35328;&#65292;&#20320;&#30340;&#20195;&#30721;&#22312;&#25191;&#34892;&#26102;&#20250;&#19968;&#34892;&#19968;&#34892;&#22320;&#32763;&#35793;&#25104;CPU&#33021;&#29702;&#35299;&#30340;&#26426;&#22120;&#30721;&#65292;&#36825;&#20010;&#32763;&#35793;&#36807;&#31243;&#38750;&#24120;&#32791;&#26102;&#65292;&#25152;&#20197;&#24456;&#24930;&#12290;&#32780;C&#31243;&#24207;&#26159;&#36816;&#34892;&#21069;&#30452;&#25509;&#32534;&#35793;&#25104;CPU&#33021;&#25191;&#34892;&#30340;&#26426;&#22120;&#30721;&#65292;&#25152;&#20197;&#38750;&#24120;&#24555;&#12290;</p>
<p>&#20294;&#26159;&#22823;&#37327;&#30340;&#24212;&#29992;&#31243;&#24207;&#19981;&#38656;&#35201;&#36825;&#20040;&#24555;&#30340;&#36816;&#34892;&#36895;&#24230;&#65292;&#22240;&#20026;&#29992;&#25143;&#26681;&#26412;&#24863;&#35273;&#19981;&#20986;&#26469;&#12290;&#20363;&#22914;&#24320;&#21457;&#19968;&#20010;&#19979;&#36733;MP3&#30340;&#32593;&#32476;&#24212;&#29992;&#31243;&#24207;&#65292;C&#31243;&#24207;&#30340;&#36816;&#34892;&#26102;&#38388;&#38656;&#35201;0.001&#31186;&#65292;&#32780;Python&#31243;&#24207;&#30340;&#36816;&#34892;&#26102;&#38388;&#38656;&#35201;0.1&#31186;&#65292;&#24930;&#20102;100&#20493;&#65292;&#20294;&#30001;&#20110;&#32593;&#32476;&#26356;&#24930;&#65292;&#38656;&#35201;&#31561;&#24453;1&#31186;&#65292;&#20320;&#24819;&#65292;&#29992;&#25143;&#33021;&#24863;&#35273;&#21040;1.001&#31186;&#21644;1.1&#31186;&#30340;&#21306;&#21035;&#21527;&#65311;&#36825;&#23601;&#22909;&#27604;F1&#36187;&#36710;&#21644;&#26222;&#36890;&#30340;&#20986;&#31199;&#36710;&#22312;&#21271;&#20140;&#19977;&#29615;&#36335;&#19978;&#34892;&#39542;&#30340;&#36947;&#29702;&#19968;&#26679;&#65292;&#34429;&#28982;F1&#36187;&#36710;&#29702;&#35770;&#26102;&#36895;&#39640;&#36798;400&#20844;&#37324;&#65292;&#20294;&#30001;&#20110;&#19977;&#29615;&#36335;&#22581;&#36710;&#30340;&#26102;&#36895;&#21482;&#26377;20&#20844;&#37324;&#65292;&#22240;&#27492;&#65292;&#20316;&#20026;&#20056;&#23458;&#65292;&#20320;&#24863;&#35273;&#30340;&#26102;&#36895;&#27704;&#36828;&#26159;20&#20844;&#37324;&#12290;</p>
<div class="figure">
<img src="http://www.liaoxuefeng.com/files/attachments/001386817301840d023640b45b844b99ab37e34106f2eaa000/0" alt="" />

</div>
<p>&#31532;&#20108;&#20010;&#32570;&#28857;&#23601;&#26159;&#20195;&#30721;&#19981;&#33021;&#21152;&#23494;&#12290;&#22914;&#26524;&#35201;&#21457;&#24067;&#20320;&#30340;Python&#31243;&#24207;&#65292;&#23454;&#38469;&#19978;&#23601;&#26159;&#21457;&#24067;&#28304;&#20195;&#30721;&#65292;&#36825;&#19968;&#28857;&#36319;C&#35821;&#35328;&#19981;&#21516;&#65292;C&#35821;&#35328;&#19981;&#29992;&#21457;&#24067;&#28304;&#20195;&#30721;&#65292;&#21482;&#38656;&#35201;&#25226;&#32534;&#35793;&#21518;&#30340;&#26426;&#22120;&#30721;&#65288;&#20063;&#23601;&#26159;&#20320;&#22312;Windows&#19978;&#24120;&#35265;&#30340;xxx.exe&#25991;&#20214;&#65289;&#21457;&#24067;&#20986;&#21435;&#12290;&#35201;&#20174;&#26426;&#22120;&#30721;&#21453;&#25512;&#20986;C&#20195;&#30721;&#26159;&#19981;&#21487;&#33021;&#30340;&#65292;&#25152;&#20197;&#65292;&#20961;&#26159;&#32534;&#35793;&#22411;&#30340;&#35821;&#35328;&#65292;&#37117;&#27809;&#26377;&#36825;&#20010;&#38382;&#39064;&#65292;&#32780;&#35299;&#37322;&#22411;&#30340;&#35821;&#35328;&#65292;&#21017;&#24517;&#39035;&#25226;&#28304;&#30721;&#21457;&#24067;&#20986;&#21435;&#12290;</p>
<p>&#36825;&#20010;&#32570;&#28857;&#20165;&#38480;&#20110;&#20320;&#35201;&#32534;&#20889;&#30340;&#36719;&#20214;&#38656;&#35201;&#21334;&#32473;&#21035;&#20154;&#25379;&#38065;&#30340;&#26102;&#20505;&#12290;&#22909;&#28040;&#24687;&#26159;&#30446;&#21069;&#30340;&#20114;&#32852;&#32593;&#26102;&#20195;&#65292;&#38752;&#21334;&#36719;&#20214;&#25480;&#26435;&#30340;&#21830;&#19994;&#27169;&#24335;&#36234;&#26469;&#36234;&#23569;&#20102;&#65292;&#38752;&#32593;&#31449;&#21644;&#31227;&#21160;&#24212;&#29992;&#21334;&#26381;&#21153;&#30340;&#27169;&#24335;&#36234;&#26469;&#36234;&#22810;&#20102;&#65292;&#21518;&#19968;&#31181;&#27169;&#24335;&#19981;&#38656;&#35201;&#25226;&#28304;&#30721;&#32473;&#21035;&#20154;&#12290;</p>
<p>&#20877;&#35828;&#20102;&#65292;&#29616;&#22312;&#22914;&#28779;&#22914;&#33660;&#30340;&#24320;&#28304;&#36816;&#21160;&#21644;&#20114;&#32852;&#32593;&#33258;&#30001;&#24320;&#25918;&#30340;&#31934;&#31070;&#26159;&#19968;&#33268;&#30340;&#65292;&#20114;&#32852;&#32593;&#19978;&#26377;&#26080;&#25968;&#38750;&#24120;&#20248;&#31168;&#30340;&#20687;Linux&#19968;&#26679;&#30340;&#24320;&#28304;&#20195;&#30721;&#65292;&#25105;&#20204;&#21315;&#19975;&#19981;&#35201;&#39640;&#20272;&#33258;&#24049;&#20889;&#30340;&#20195;&#30721;&#30495;&#30340;&#26377;&#38750;&#24120;&#22823;&#30340;&#8220;&#21830;&#19994;&#20215;&#20540;&#8221;&#12290;&#37027;&#20123;&#22823;&#20844;&#21496;&#30340;&#20195;&#30721;&#19981;&#24895;&#24847;&#24320;&#25918;&#30340;&#26356;&#37325;&#35201;&#30340;&#21407;&#22240;&#26159;&#20195;&#30721;&#20889;&#24471;&#22826;&#28866;&#20102;&#65292;&#19968;&#26086;&#24320;&#28304;&#65292;&#23601;&#27809;&#20154;&#25954;&#29992;&#20182;&#20204;&#30340;&#20135;&#21697;&#20102;&#12290;</p>
<div class="figure">
<img src="http://www.liaoxuefeng.com/files/attachments/0013868176293326466225daa824587bef6bb39c8683c2c000/0" alt="" />

</div>
<p>&#24403;&#28982;&#65292;Python&#36824;&#26377;&#20854;&#20182;&#33509;&#24178;&#23567;&#32570;&#28857;&#65292;&#35831;&#33258;&#34892;&#24573;&#30053;&#65292;&#23601;&#19981;&#19968;&#19968;&#21015;&#20030;&#20102;&#12290;</p>
</body>
</html>
