<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <style type="text/css">
div.sourceCode { overflow-x: auto; }
table.sourceCode, tr.sourceCode, td.lineNumbers, td.sourceCode {
  margin: 0; padding: 0; vertical-align: baseline; border: none; }
table.sourceCode { width: 100%; line-height: 100%; }
td.lineNumbers { text-align: right; padding-right: 4px; padding-left: 4px; color: #aaaaaa; border-right: 1px solid #aaaaaa; }
td.sourceCode { padding-left: 5px; }
code > span.kw { color: #007020; font-weight: bold; } /* Keyword */
code > span.dt { color: #902000; } /* DataType */
code > span.dv { color: #40a070; } /* DecVal */
code > span.bn { color: #40a070; } /* BaseN */
code > span.fl { color: #40a070; } /* Float */
code > span.ch { color: #4070a0; } /* Char */
code > span.st { color: #4070a0; } /* String */
code > span.co { color: #60a0b0; font-style: italic; } /* Comment */
code > span.ot { color: #007020; } /* Other */
code > span.al { color: #ff0000; font-weight: bold; } /* Alert */
code > span.fu { color: #06287e; } /* Function */
code > span.er { color: #ff0000; font-weight: bold; } /* Error */
code > span.wa { color: #60a0b0; font-weight: bold; font-style: italic; } /* Warning */
code > span.cn { color: #880000; } /* Constant */
code > span.sc { color: #4070a0; } /* SpecialChar */
code > span.vs { color: #4070a0; } /* VerbatimString */
code > span.ss { color: #bb6688; } /* SpecialString */
code > span.im { } /* Import */
code > span.va { color: #19177c; } /* Variable */
code > span.cf { color: #007020; font-weight: bold; } /* ControlFlow */
code > span.op { color: #666666; } /* Operator */
code > span.bu { } /* BuiltIn */
code > span.ex { } /* Extension */
code > span.pp { color: #bc7a00; } /* Preprocessor */
code > span.at { color: #7d9029; } /* Attribute */
code > span.do { color: #ba2121; font-style: italic; } /* Documentation */
code > span.an { color: #60a0b0; font-weight: bold; font-style: italic; } /* Annotation */
code > span.cv { color: #60a0b0; font-weight: bold; font-style: italic; } /* CommentVar */
code > span.in { color: #60a0b0; font-weight: bold; font-style: italic; } /* Information */
  </style>
  <link rel="stylesheet" href="book.css" type="text/css" />
</head>
<body>
<h2 id="&#36827;&#31243;&#21644;&#32447;&#31243;">13.&#36827;&#31243;&#21644;&#32447;&#31243;</h2>
<p>&#24456;&#22810;&#21516;&#23398;&#37117;&#21548;&#35828;&#36807;&#65292;&#29616;&#20195;&#25805;&#20316;&#31995;&#32479;&#27604;&#22914;<code>Mac OS X&#65292;UNIX&#65292;Linux&#65292;Windows</code>&#31561;&#65292;&#37117;&#26159;&#25903;&#25345;&#8220;&#22810;&#20219;&#21153;&#8221;&#30340;&#25805;&#20316;&#31995;&#32479;&#12290;</p>
<p>&#20160;&#20040;&#21483;&#8220;&#22810;&#20219;&#21153;&#8221;&#21602;&#65311;&#31616;&#21333;&#22320;&#35828;&#65292;&#23601;&#26159;&#25805;&#20316;&#31995;&#32479;&#21487;&#20197;&#21516;&#26102;&#36816;&#34892;&#22810;&#20010;&#20219;&#21153;&#12290;&#25171;&#20010;&#27604;&#26041;&#65292;&#20320;&#19968;&#36793;&#22312;&#29992;&#27983;&#35272;&#22120;&#19978;&#32593;&#65292;&#19968;&#36793;&#22312;&#21548;MP3&#65292;&#19968;&#36793;&#22312;&#29992;Word&#36214;&#20316;&#19994;&#65292;&#36825;&#23601;&#26159;&#22810;&#20219;&#21153;&#65292;&#33267;&#23569;&#21516;&#26102;&#26377;3&#20010;&#20219;&#21153;&#27491;&#22312;&#36816;&#34892;&#12290;&#36824;&#26377;&#24456;&#22810;&#20219;&#21153;&#24708;&#24708;&#22320;&#22312;&#21518;&#21488;&#21516;&#26102;&#36816;&#34892;&#30528;&#65292;&#21482;&#26159;&#26700;&#38754;&#19978;&#27809;&#26377;&#26174;&#31034;&#32780;&#24050;&#12290;</p>
<p>&#29616;&#22312;&#65292;&#22810;&#26680;CPU&#24050;&#32463;&#38750;&#24120;&#26222;&#21450;&#20102;&#65292;&#20294;&#26159;&#65292;&#21363;&#20351;&#36807;&#21435;&#30340;&#21333;&#26680;CPU&#65292;&#20063;&#21487;&#20197;&#25191;&#34892;&#22810;&#20219;&#21153;&#12290;&#30001;&#20110;CPU&#25191;&#34892;&#20195;&#30721;&#37117;&#26159;&#39034;&#24207;&#25191;&#34892;&#30340;&#65292;&#37027;&#20040;&#65292;&#21333;&#26680;CPU&#26159;&#24590;&#20040;&#25191;&#34892;&#22810;&#20219;&#21153;&#30340;&#21602;&#65311;</p>
<p>&#31572;&#26696;&#23601;&#26159;&#25805;&#20316;&#31995;&#32479;&#36718;&#27969;&#35753;&#21508;&#20010;&#20219;&#21153;&#20132;&#26367;&#25191;&#34892;&#65292;&#20219;&#21153;1&#25191;&#34892;0.01&#31186;&#65292;&#20999;&#25442;&#21040;&#20219;&#21153;2&#65292;&#20219;&#21153;2&#25191;&#34892;0.01&#31186;&#65292;&#20877;&#20999;&#25442;&#21040;&#20219;&#21153;3&#65292;&#25191;&#34892;0.01&#31186;&#8230;&#8230;&#36825;&#26679;&#21453;&#22797;&#25191;&#34892;&#19979;&#21435;&#12290;&#34920;&#38754;&#19978;&#30475;&#65292;&#27599;&#20010;&#20219;&#21153;&#37117;&#26159;&#20132;&#26367;&#25191;&#34892;&#30340;&#65292;&#20294;&#26159;&#65292;&#30001;&#20110;CPU&#30340;&#25191;&#34892;&#36895;&#24230;&#23454;&#22312;&#26159;&#22826;&#24555;&#20102;&#65292;&#25105;&#20204;&#24863;&#35273;&#23601;&#20687;&#25152;&#26377;&#20219;&#21153;&#37117;&#22312;&#21516;&#26102;&#25191;&#34892;&#19968;&#26679;&#12290;</p>
<p>&#30495;&#27491;&#30340;&#24182;&#34892;&#25191;&#34892;&#22810;&#20219;&#21153;&#21482;&#33021;&#22312;&#22810;&#26680;CPU&#19978;&#23454;&#29616;&#65292;&#20294;&#26159;&#65292;&#30001;&#20110;&#20219;&#21153;&#25968;&#37327;&#36828;&#36828;&#22810;&#20110;CPU&#30340;&#26680;&#24515;&#25968;&#37327;&#65292;&#25152;&#20197;&#65292;&#25805;&#20316;&#31995;&#32479;&#20063;&#20250;&#33258;&#21160;&#25226;&#24456;&#22810;&#20219;&#21153;&#36718;&#27969;&#35843;&#24230;&#21040;&#27599;&#20010;&#26680;&#24515;&#19978;&#25191;&#34892;&#12290;</p>
<p>&#23545;&#20110;&#25805;&#20316;&#31995;&#32479;&#26469;&#35828;&#65292;&#19968;&#20010;&#20219;&#21153;&#23601;&#26159;&#19968;&#20010;<strong>&#36827;&#31243;</strong>&#65288;<code>Process</code>&#65289;&#65292;&#27604;&#22914;&#25171;&#24320;&#19968;&#20010;&#27983;&#35272;&#22120;&#23601;&#26159;&#21551;&#21160;&#19968;&#20010;&#27983;&#35272;&#22120;&#36827;&#31243;&#65292;&#25171;&#24320;&#19968;&#20010;&#35760;&#20107;&#26412;&#23601;&#21551;&#21160;&#20102;&#19968;&#20010;&#35760;&#20107;&#26412;&#36827;&#31243;&#65292;&#25171;&#24320;&#20004;&#20010;&#35760;&#20107;&#26412;&#23601;&#21551;&#21160;&#20102;&#20004;&#20010;&#35760;&#20107;&#26412;&#36827;&#31243;&#65292;&#25171;&#24320;&#19968;&#20010;Word&#23601;&#21551;&#21160;&#20102;&#19968;&#20010;Word&#36827;&#31243;&#12290;</p>
<p>&#26377;&#20123;&#36827;&#31243;&#36824;&#19981;&#27490;&#21516;&#26102;&#24178;&#19968;&#20214;&#20107;&#65292;&#27604;&#22914;Word&#65292;&#23427;&#21487;&#20197;&#21516;&#26102;&#36827;&#34892;&#25171;&#23383;&#12289;&#25340;&#20889;&#26816;&#26597;&#12289;&#25171;&#21360;&#31561;&#20107;&#24773;&#12290;&#22312;&#19968;&#20010;&#36827;&#31243;&#20869;&#37096;&#65292;&#35201;&#21516;&#26102;&#24178;&#22810;&#20214;&#20107;&#65292;&#23601;&#38656;&#35201;&#21516;&#26102;&#36816;&#34892;&#22810;&#20010;&#8220;&#23376;&#20219;&#21153;&#8221;&#65292;&#25105;&#20204;&#25226;&#36827;&#31243;&#20869;&#30340;&#36825;&#20123;&#8220;&#23376;&#20219;&#21153;&#8221;&#31216;&#20026;<strong>&#32447;&#31243;</strong>&#65288;<code>Thread</code>&#65289;&#12290;</p>
<p>&#30001;&#20110;&#27599;&#20010;&#36827;&#31243;&#33267;&#23569;&#35201;&#24178;&#19968;&#20214;&#20107;&#65292;&#25152;&#20197;&#65292;&#19968;&#20010;&#36827;&#31243;&#33267;&#23569;&#26377;&#19968;&#20010;&#32447;&#31243;&#12290;&#24403;&#28982;&#65292;&#20687;Word&#36825;&#31181;&#22797;&#26434;&#30340;&#36827;&#31243;&#21487;&#20197;&#26377;&#22810;&#20010;&#32447;&#31243;&#65292;&#22810;&#20010;&#32447;&#31243;&#21487;&#20197;&#21516;&#26102;&#25191;&#34892;&#65292;&#22810;&#32447;&#31243;&#30340;&#25191;&#34892;&#26041;&#24335;&#21644;&#22810;&#36827;&#31243;&#26159;&#19968;&#26679;&#30340;&#65292;&#20063;&#26159;&#30001;&#25805;&#20316;&#31995;&#32479;&#22312;&#22810;&#20010;&#32447;&#31243;&#20043;&#38388;&#24555;&#36895;&#20999;&#25442;&#65292;&#35753;&#27599;&#20010;&#32447;&#31243;&#37117;&#30701;&#26242;&#22320;&#20132;&#26367;&#36816;&#34892;&#65292;&#30475;&#36215;&#26469;&#23601;&#20687;&#21516;&#26102;&#25191;&#34892;&#19968;&#26679;&#12290;&#24403;&#28982;&#65292;&#30495;&#27491;&#22320;&#21516;&#26102;&#25191;&#34892;&#22810;&#32447;&#31243;&#38656;&#35201;&#22810;&#26680;CPU&#25165;&#21487;&#33021;&#23454;&#29616;&#12290;</p>
<p>&#25105;&#20204;&#21069;&#38754;&#32534;&#20889;&#30340;&#25152;&#26377;&#30340;Python&#31243;&#24207;&#65292;&#37117;&#26159;&#25191;&#34892;&#21333;&#20219;&#21153;&#30340;&#36827;&#31243;&#65292;&#20063;&#23601;&#26159;&#21482;&#26377;&#19968;&#20010;&#32447;&#31243;&#12290;&#22914;&#26524;&#25105;&#20204;&#35201;&#21516;&#26102;&#25191;&#34892;&#22810;&#20010;&#20219;&#21153;&#24590;&#20040;&#21150;&#65311;</p>
<p>&#26377;&#20004;&#31181;&#35299;&#20915;&#26041;&#26696;&#65306;</p>
<p>&#19968;&#31181;&#26159;&#21551;&#21160;&#22810;&#20010;&#36827;&#31243;&#65292;&#27599;&#20010;&#36827;&#31243;&#34429;&#28982;&#21482;&#26377;&#19968;&#20010;&#32447;&#31243;&#65292;&#20294;&#22810;&#20010;&#36827;&#31243;&#21487;&#20197;&#19968;&#22359;&#25191;&#34892;&#22810;&#20010;&#20219;&#21153;&#12290;</p>
<p>&#36824;&#26377;&#19968;&#31181;&#26041;&#27861;&#26159;&#21551;&#21160;&#19968;&#20010;&#36827;&#31243;&#65292;&#22312;&#19968;&#20010;&#36827;&#31243;&#20869;&#21551;&#21160;&#22810;&#20010;&#32447;&#31243;&#65292;&#36825;&#26679;&#65292;&#22810;&#20010;&#32447;&#31243;&#20063;&#21487;&#20197;&#19968;&#22359;&#25191;&#34892;&#22810;&#20010;&#20219;&#21153;&#12290;</p>
<p>&#24403;&#28982;&#36824;&#26377;&#31532;&#19977;&#31181;&#26041;&#27861;&#65292;&#23601;&#26159;&#21551;&#21160;&#22810;&#20010;&#36827;&#31243;&#65292;&#27599;&#20010;&#36827;&#31243;&#20877;&#21551;&#21160;&#22810;&#20010;&#32447;&#31243;&#65292;&#36825;&#26679;&#21516;&#26102;&#25191;&#34892;&#30340;&#20219;&#21153;&#23601;&#26356;&#22810;&#20102;&#65292;&#24403;&#28982;&#36825;&#31181;&#27169;&#22411;&#26356;&#22797;&#26434;&#65292;&#23454;&#38469;&#24456;&#23569;&#37319;&#29992;&#12290;</p>
<p>&#24635;&#32467;&#19968;&#19979;&#23601;&#26159;&#65292;&#22810;&#20219;&#21153;&#30340;&#23454;&#29616;&#26377;3&#31181;&#26041;&#24335;&#65306;</p>
<ul>
<li>&#22810;&#36827;&#31243;&#27169;&#24335;&#65307;</li>
<li>&#22810;&#32447;&#31243;&#27169;&#24335;&#65307;</li>
<li>&#22810;&#36827;&#31243;+&#22810;&#32447;&#31243;&#27169;&#24335;&#12290;</li>
</ul>
<p>&#21516;&#26102;&#25191;&#34892;&#22810;&#20010;&#20219;&#21153;&#36890;&#24120;&#21508;&#20010;&#20219;&#21153;&#20043;&#38388;&#24182;&#19981;&#26159;&#27809;&#26377;&#20851;&#32852;&#30340;&#65292;&#32780;&#26159;&#38656;&#35201;&#30456;&#20114;&#36890;&#20449;&#21644;&#21327;&#35843;&#65292;&#26377;&#26102;&#65292;&#20219;&#21153;1&#24517;&#39035;&#26242;&#20572;&#31561;&#24453;&#20219;&#21153;2&#23436;&#25104;&#21518;&#25165;&#33021;&#32487;&#32493;&#25191;&#34892;&#65292;&#26377;&#26102;&#65292;&#20219;&#21153;3&#21644;&#20219;&#21153;4&#21448;&#19981;&#33021;&#21516;&#26102;&#25191;&#34892;&#65292;&#25152;&#20197;&#65292;&#22810;&#36827;&#31243;&#21644;&#22810;&#32447;&#31243;&#30340;&#31243;&#24207;&#30340;&#22797;&#26434;&#24230;&#35201;&#36828;&#36828;&#39640;&#20110;&#25105;&#20204;&#21069;&#38754;&#20889;&#30340;&#21333;&#36827;&#31243;&#21333;&#32447;&#31243;&#30340;&#31243;&#24207;&#12290;</p>
<p>&#22240;&#20026;&#22797;&#26434;&#24230;&#39640;&#65292;&#35843;&#35797;&#22256;&#38590;&#65292;&#25152;&#20197;&#65292;&#19981;&#26159;&#36843;&#19981;&#24471;&#24050;&#65292;&#25105;&#20204;&#20063;&#19981;&#24819;&#32534;&#20889;&#22810;&#20219;&#21153;&#12290;&#20294;&#26159;&#65292;&#26377;&#24456;&#22810;&#26102;&#20505;&#65292;&#27809;&#26377;&#22810;&#20219;&#21153;&#36824;&#30495;&#19981;&#34892;&#12290;&#24819;&#24819;&#22312;&#30005;&#33041;&#19978;&#30475;&#30005;&#24433;&#65292;&#23601;&#24517;&#39035;&#30001;&#19968;&#20010;&#32447;&#31243;&#25773;&#25918;&#35270;&#39057;&#65292;&#21478;&#19968;&#20010;&#32447;&#31243;&#25773;&#25918;&#38899;&#39057;&#65292;&#21542;&#21017;&#65292;&#21333;&#32447;&#31243;&#23454;&#29616;&#30340;&#35805;&#23601;&#21482;&#33021;&#20808;&#25226;&#35270;&#39057;&#25773;&#25918;&#23436;&#20877;&#25773;&#25918;&#38899;&#39057;&#65292;&#25110;&#32773;&#20808;&#25226;&#38899;&#39057;&#25773;&#25918;&#23436;&#20877;&#25773;&#25918;&#35270;&#39057;&#65292;&#36825;&#26174;&#28982;&#26159;&#19981;&#34892;&#30340;&#12290;</p>
<p>Python&#26082;&#25903;&#25345;&#22810;&#36827;&#31243;&#65292;&#21448;&#25903;&#25345;&#22810;&#32447;&#31243;&#65292;&#25105;&#20204;&#20250;&#35752;&#35770;&#22914;&#20309;&#32534;&#20889;&#36825;&#20004;&#31181;&#22810;&#20219;&#21153;&#31243;&#24207;&#12290;</p>
<h4 id="&#23567;&#32467;">&#23567;&#32467;</h4>
<p>&#32447;&#31243;&#26159;&#26368;&#23567;&#30340;&#25191;&#34892;&#21333;&#20803;&#65292;&#32780;&#36827;&#31243;&#30001;&#33267;&#23569;&#19968;&#20010;&#32447;&#31243;&#32452;&#25104;&#12290;&#22914;&#20309;&#35843;&#24230;&#36827;&#31243;&#21644;&#32447;&#31243;&#65292;&#23436;&#20840;&#30001;&#25805;&#20316;&#31995;&#32479;&#20915;&#23450;&#65292;&#31243;&#24207;&#33258;&#24049;&#19981;&#33021;&#20915;&#23450;&#20160;&#20040;&#26102;&#20505;&#25191;&#34892;&#65292;&#25191;&#34892;&#22810;&#38271;&#26102;&#38388;&#12290;</p>
<p>&#22810;&#36827;&#31243;&#21644;&#22810;&#32447;&#31243;&#30340;&#31243;&#24207;&#28041;&#21450;&#21040;&#21516;&#27493;&#12289;&#25968;&#25454;&#20849;&#20139;&#30340;&#38382;&#39064;&#65292;&#32534;&#20889;&#36215;&#26469;&#26356;&#22797;&#26434;&#12290;</p>
<h3 id="&#22810;&#36827;&#31243;">13.1 &#22810;&#36827;&#31243;</h3>
<p>&#35201;&#35753;Python&#31243;&#24207;&#23454;&#29616;<strong>&#22810;&#36827;&#31243;</strong>&#65288;<code>multiprocessing</code>&#65289;&#65292;&#25105;&#20204;&#20808;&#20102;&#35299;&#25805;&#20316;&#31995;&#32479;&#30340;&#30456;&#20851;&#30693;&#35782;&#12290;</p>
<p><code>Unix/Linux</code>&#25805;&#20316;&#31995;&#32479;&#25552;&#20379;&#20102;&#19968;&#20010;<code>fork()</code>&#31995;&#32479;&#35843;&#29992;&#65292;&#23427;&#38750;&#24120;&#29305;&#27530;&#12290;&#26222;&#36890;&#30340;&#20989;&#25968;&#35843;&#29992;&#65292;&#35843;&#29992;&#19968;&#27425;&#65292;&#36820;&#22238;&#19968;&#27425;&#65292;&#20294;&#26159;<code>fork()</code>&#35843;&#29992;&#19968;&#27425;&#65292;&#36820;&#22238;&#20004;&#27425;&#65292;&#22240;&#20026;&#25805;&#20316;&#31995;&#32479;&#33258;&#21160;&#25226;&#24403;&#21069;&#36827;&#31243;&#65288;&#31216;&#20026;&#29238;&#36827;&#31243;&#65289;&#22797;&#21046;&#20102;&#19968;&#20221;&#65288;&#31216;&#20026;&#23376;&#36827;&#31243;&#65289;&#65292;&#28982;&#21518;&#65292;&#20998;&#21035;&#22312;&#29238;&#36827;&#31243;&#21644;&#23376;&#36827;&#31243;&#20869;&#36820;&#22238;&#12290;</p>
<p>&#23376;&#36827;&#31243;&#27704;&#36828;&#36820;&#22238;<code>0</code>&#65292;&#32780;&#29238;&#36827;&#31243;&#36820;&#22238;&#23376;&#36827;&#31243;&#30340;<code>ID</code>&#12290;&#36825;&#26679;&#20570;&#30340;&#29702;&#30001;&#26159;&#65292;&#19968;&#20010;&#29238;&#36827;&#31243;&#21487;&#20197;<code>fork</code>&#20986;&#24456;&#22810;&#23376;&#36827;&#31243;&#65292;&#25152;&#20197;&#65292;&#29238;&#36827;&#31243;&#35201;&#35760;&#19979;&#27599;&#20010;&#23376;&#36827;&#31243;&#30340;<code>ID</code>&#65292;&#32780;&#23376;&#36827;&#31243;&#21482;&#38656;&#35201;&#35843;&#29992;<code>getppid()</code>&#23601;&#21487;&#20197;&#25343;&#21040;&#29238;&#36827;&#31243;&#30340;<code>ID</code>&#12290;</p>
<p>Python&#30340;<code>os&#27169;&#22359;</code>&#23553;&#35013;&#20102;&#24120;&#35265;&#30340;&#31995;&#32479;&#35843;&#29992;&#65292;&#20854;&#20013;&#23601;&#21253;&#25324;<code>fork</code>&#65292;&#21487;&#20197;&#22312;<code>Python</code>&#31243;&#24207;&#20013;&#36731;&#26494;&#21019;&#24314;&#23376;&#36827;&#31243;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> os

<span class="bu">print</span>(<span class="st">&#39;Process (</span><span class="sc">%s</span><span class="st">) start...&#39;</span> <span class="op">%</span> os.getpid())
<span class="co"># Only works on Unix/Linux/Mac:</span>
pid <span class="op">=</span> os.fork()
<span class="cf">if</span> pid <span class="op">==</span> <span class="dv">0</span>:
    <span class="bu">print</span>(<span class="st">&#39;I am child process (</span><span class="sc">%s</span><span class="st">) and my parent is </span><span class="sc">%s</span><span class="st">.&#39;</span> <span class="op">%</span> (os.getpid(), os.getppid()))
<span class="cf">else</span>:
    <span class="bu">print</span>(<span class="st">&#39;I (</span><span class="sc">%s</span><span class="st">) just created a child process (</span><span class="sc">%s</span><span class="st">).&#39;</span> <span class="op">%</span> (os.getpid(), pid))</code></pre></div>
<p>&#36816;&#34892;&#32467;&#26524;&#22914;&#19979;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">Process (<span class="dv">876</span>) start...
I (<span class="dv">876</span>) just created a child process (<span class="dv">877</span>).
I am child process (<span class="dv">877</span>) <span class="op">and</span> my parent <span class="op">is</span> <span class="dv">876</span>.</code></pre></div>
<p>&#30001;&#20110;Windows&#27809;&#26377;<code>fork</code>&#35843;&#29992;&#65292;&#19978;&#38754;&#30340;&#20195;&#30721;&#22312;Windows&#19978;&#26080;&#27861;&#36816;&#34892;&#12290;&#30001;&#20110;Mac&#31995;&#32479;&#26159;&#22522;&#20110;<code>BSD</code>&#65288;Unix&#30340;&#19968;&#31181;&#65289;&#20869;&#26680;&#65292;&#25152;&#20197;&#65292;&#22312;Mac&#19979;&#36816;&#34892;&#26159;&#27809;&#26377;&#38382;&#39064;&#30340;&#65292;&#25512;&#33616;&#22823;&#23478;&#29992;Mac&#23398;Python&#65281;</p>
<p>&#26377;&#20102;<code>fork</code>&#35843;&#29992;&#65292;&#19968;&#20010;&#36827;&#31243;&#22312;&#25509;&#21040;&#26032;&#20219;&#21153;&#26102;&#23601;&#21487;&#20197;&#22797;&#21046;&#20986;&#19968;&#20010;&#23376;&#36827;&#31243;&#26469;&#22788;&#29702;&#26032;&#20219;&#21153;&#65292;&#24120;&#35265;&#30340;<code>Apache&#26381;&#21153;&#22120;</code>&#23601;&#26159;&#30001;&#29238;&#36827;&#31243;&#30417;&#21548;&#31471;&#21475;&#65292;&#27599;&#24403;&#26377;&#26032;&#30340;http&#35831;&#27714;&#26102;&#65292;&#23601;<code>fork</code>&#20986;&#23376;&#36827;&#31243;&#26469;&#22788;&#29702;&#26032;&#30340;http&#35831;&#27714;&#12290;</p>
<h4 id="multiprocessing">multiprocessing</h4>
<p>&#22914;&#26524;&#20320;&#25171;&#31639;&#32534;&#20889;&#22810;&#36827;&#31243;&#30340;&#26381;&#21153;&#31243;&#24207;&#65292;<code>Unix/Linux</code>&#26080;&#30097;&#26159;&#27491;&#30830;&#30340;&#36873;&#25321;&#12290;&#30001;&#20110;Windows&#27809;&#26377;<code>fork</code>&#35843;&#29992;&#65292;&#38590;&#36947;&#22312;Windows&#19978;&#26080;&#27861;&#29992;Python&#32534;&#20889;&#22810;&#36827;&#31243;&#30340;&#31243;&#24207;&#65311;</p>
<p>&#30001;&#20110;Python&#26159;&#36328;&#24179;&#21488;&#30340;&#65292;&#33258;&#28982;&#20063;&#24212;&#35813;&#25552;&#20379;&#19968;&#20010;&#36328;&#24179;&#21488;&#30340;&#22810;&#36827;&#31243;&#25903;&#25345;&#12290;<code>multiprocessing&#27169;&#22359;</code>&#23601;&#26159;&#36328;&#24179;&#21488;&#29256;&#26412;&#30340;&#22810;&#36827;&#31243;&#27169;&#22359;&#12290;</p>
<p><code>multiprocessing&#27169;&#22359;</code>&#25552;&#20379;&#20102;&#19968;&#20010;<code>Process&#31867;</code>&#26469;&#20195;&#34920;&#19968;&#20010;&#36827;&#31243;&#23545;&#35937;&#65292;&#19979;&#38754;&#30340;&#20363;&#23376;&#28436;&#31034;&#20102;&#21551;&#21160;&#19968;&#20010;&#23376;&#36827;&#31243;&#24182;&#31561;&#24453;&#20854;&#32467;&#26463;&#65306;</p>
<pre class="python3"><code>from multiprocessing import Process
import os

# &#23376;&#36827;&#31243;&#35201;&#25191;&#34892;&#30340;&#20195;&#30721;
def run_proc(name):
    print(&#39;Run child process %s (%s)...&#39; % (name, os.getpid()))

if __name__==&#39;__main__&#39;:
    print(&#39;Parent process %s.&#39; % os.getpid())
    p = Process(target=run_proc, args=(&#39;test&#39;,))
    print(&#39;Child process will start.&#39;)
    p.start()
    p.join()
    print(&#39;Child process end.&#39;)</code></pre>
<p>&#25191;&#34892;&#32467;&#26524;&#22914;&#19979;&#65306;</p>
<pre><code>Parent process 928.
Process will start.
Run child process test (929)...
Process end.</code></pre>
<p>&#21019;&#24314;&#23376;&#36827;&#31243;&#26102;&#65292;&#21482;&#38656;&#35201;&#20256;&#20837;&#19968;&#20010;&#25191;&#34892;&#20989;&#25968;&#21644;&#20989;&#25968;&#30340;&#21442;&#25968;&#65292;&#21019;&#24314;&#19968;&#20010;<code>Process</code>&#23454;&#20363;&#65292;&#29992;<code>start()</code>&#26041;&#27861;&#21551;&#21160;&#65292;&#36825;&#26679;&#21019;&#24314;&#36827;&#31243;&#27604;<code>fork()</code>&#36824;&#35201;&#31616;&#21333;&#12290;</p>
<p><code>join()</code>&#26041;&#27861;&#21487;&#20197;&#31561;&#24453;&#23376;&#36827;&#31243;&#32467;&#26463;&#21518;&#20877;&#32487;&#32493;&#24448;&#19979;&#36816;&#34892;&#65292;&#36890;&#24120;&#29992;&#20110;&#36827;&#31243;&#38388;&#30340;&#21516;&#27493;&#12290;</p>
<h4 id="pool">Pool</h4>
<p>&#22914;&#26524;&#35201;&#21551;&#21160;&#22823;&#37327;&#30340;&#23376;&#36827;&#31243;&#65292;&#21487;&#20197;&#29992;&#36827;&#31243;&#27744;&#30340;&#26041;&#24335;&#25209;&#37327;&#21019;&#24314;&#23376;&#36827;&#31243;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">from</span> multiprocessing <span class="im">import</span> Pool
<span class="im">import</span> os, time, random

<span class="kw">def</span> long_time_task(name):
    <span class="bu">print</span>(<span class="st">&#39;Run task </span><span class="sc">%s</span><span class="st"> (</span><span class="sc">%s</span><span class="st">)...&#39;</span> <span class="op">%</span> (name, os.getpid()))
    start <span class="op">=</span> time.time()
    time.sleep(random.random() <span class="op">*</span> <span class="dv">3</span>)
    end <span class="op">=</span> time.time()
    <span class="bu">print</span>(<span class="st">&#39;Task </span><span class="sc">%s</span><span class="st"> runs </span><span class="sc">%0.2f</span><span class="st"> seconds.&#39;</span> <span class="op">%</span> (name, (end <span class="op">-</span> start)))

<span class="cf">if</span> <span class="va">__name__</span><span class="op">==</span><span class="st">&#39;__main__&#39;</span>:
    <span class="bu">print</span>(<span class="st">&#39;Parent process </span><span class="sc">%s</span><span class="st">.&#39;</span> <span class="op">%</span> os.getpid())
    p <span class="op">=</span> Pool(<span class="dv">4</span>)
    <span class="cf">for</span> i <span class="op">in</span> <span class="bu">range</span>(<span class="dv">5</span>):
        p.apply_async(long_time_task, args<span class="op">=</span>(i,))
    <span class="bu">print</span>(<span class="st">&#39;Waiting for all subprocesses done...&#39;</span>)
    p.close()
    p.join()
    <span class="bu">print</span>(<span class="st">&#39;All subprocesses done.&#39;</span>)</code></pre></div>
<p>&#25191;&#34892;&#32467;&#26524;&#22914;&#19979;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">Parent process <span class="dv">669</span>.
Waiting <span class="cf">for</span> <span class="bu">all</span> subprocesses done...
Run task <span class="dv">0</span> (<span class="dv">671</span>)...
Run task <span class="dv">1</span> (<span class="dv">672</span>)...
Run task <span class="dv">2</span> (<span class="dv">673</span>)...
Run task <span class="dv">3</span> (<span class="dv">674</span>)...
Task <span class="dv">2</span> runs <span class="fl">0.14</span> seconds.
Run task <span class="dv">4</span> (<span class="dv">673</span>)...
Task <span class="dv">1</span> runs <span class="fl">0.27</span> seconds.
Task <span class="dv">3</span> runs <span class="fl">0.86</span> seconds.
Task <span class="dv">0</span> runs <span class="fl">1.41</span> seconds.
Task <span class="dv">4</span> runs <span class="fl">1.91</span> seconds.
All subprocesses done.</code></pre></div>
<p>&#20195;&#30721;&#35299;&#35835;&#65306;</p>
<p>&#23545;<code>Pool</code>&#23545;&#35937;&#35843;&#29992;<code>join()</code>&#26041;&#27861;&#20250;&#31561;&#24453;&#25152;&#26377;&#23376;&#36827;&#31243;&#25191;&#34892;&#23436;&#27605;&#65292;&#35843;&#29992;<code>join()</code>&#20043;&#21069;&#24517;&#39035;&#20808;&#35843;&#29992;<code>close()</code>&#65292;&#35843;&#29992;<code>close()</code>&#20043;&#21518;&#23601;&#19981;&#33021;&#32487;&#32493;&#28155;&#21152;&#26032;&#30340;<code>Process</code>&#20102;&#12290;</p>
<p>&#35831;&#27880;&#24847;&#36755;&#20986;&#30340;&#32467;&#26524;&#65292;<code>task 0&#65292;1&#65292;2&#65292;3</code>&#26159;&#31435;&#21051;&#25191;&#34892;&#30340;&#65292;&#32780;<code>task 4</code>&#35201;&#31561;&#24453;&#21069;&#38754;&#26576;&#20010;<code>task</code>&#23436;&#25104;&#21518;&#25165;&#25191;&#34892;&#65292;&#36825;&#26159;&#22240;&#20026;<code>Pool</code>&#30340;&#40664;&#35748;&#22823;&#23567;&#22312;&#25105;&#30340;&#30005;&#33041;&#19978;&#26159;4&#65292;&#22240;&#27492;&#65292;&#26368;&#22810;&#21516;&#26102;&#25191;&#34892;4&#20010;&#36827;&#31243;&#12290;&#36825;&#26159;Pool&#26377;&#24847;&#35774;&#35745;&#30340;&#38480;&#21046;&#65292;&#24182;&#19981;&#26159;&#25805;&#20316;&#31995;&#32479;&#30340;&#38480;&#21046;&#12290;&#22914;&#26524;&#25913;&#25104;&#65306;</p>
<p><code>p = Pool(5)</code></p>
<p>&#23601;&#21487;&#20197;&#21516;&#26102;&#36305;5&#20010;&#36827;&#31243;&#12290;</p>
<p>&#30001;&#20110;<code>Pool</code>&#30340;&#40664;&#35748;&#22823;&#23567;&#26159;CPU&#30340;&#26680;&#25968;&#65292;&#22914;&#26524;&#20320;&#19981;&#24184;&#25317;&#26377;8&#26680;CPU&#65292;&#20320;&#35201;&#25552;&#20132;&#33267;&#23569;9&#20010;&#23376;&#36827;&#31243;&#25165;&#33021;&#30475;&#21040;&#19978;&#38754;&#30340;&#31561;&#24453;&#25928;&#26524;&#12290;</p>
<h4 id="&#23376;&#36827;&#31243;">&#23376;&#36827;&#31243;</h4>
<p>&#24456;&#22810;&#26102;&#20505;&#65292;&#23376;&#36827;&#31243;&#24182;&#19981;&#26159;&#33258;&#36523;&#65292;&#32780;&#26159;&#19968;&#20010;&#22806;&#37096;&#36827;&#31243;&#12290;&#25105;&#20204;&#21019;&#24314;&#20102;&#23376;&#36827;&#31243;&#21518;&#65292;&#36824;&#38656;&#35201;&#25511;&#21046;&#23376;&#36827;&#31243;&#30340;&#36755;&#20837;&#21644;&#36755;&#20986;&#12290;</p>
<p><code>subprocess&#27169;&#22359;</code>&#21487;&#20197;&#35753;&#25105;&#20204;&#38750;&#24120;&#26041;&#20415;&#22320;&#21551;&#21160;&#19968;&#20010;&#23376;&#36827;&#31243;&#65292;&#28982;&#21518;&#25511;&#21046;&#20854;&#36755;&#20837;&#21644;&#36755;&#20986;&#12290;</p>
<p>&#19979;&#38754;&#30340;&#20363;&#23376;&#28436;&#31034;&#20102;&#22914;&#20309;&#22312;Python&#20195;&#30721;&#20013;&#36816;&#34892;&#21629;&#20196;<code>nslookup www.python.org</code>&#65292;&#36825;&#21644;&#21629;&#20196;&#34892;&#30452;&#25509;&#36816;&#34892;&#30340;&#25928;&#26524;&#26159;&#19968;&#26679;&#30340;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> subprocess

<span class="bu">print</span>(<span class="st">&#39;$ nslookup www.python.org&#39;</span>)
r <span class="op">=</span> subprocess.call([<span class="st">&#39;nslookup&#39;</span>, <span class="st">&#39;www.python.org&#39;</span>])
<span class="bu">print</span>(<span class="st">&#39;Exit code:&#39;</span>, r)</code></pre></div>
<p>&#36816;&#34892;&#32467;&#26524;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode bash"><code class="sourceCode bash">$ <span class="kw">nslookup</span> www.python.org
<span class="kw">Server</span>:        192.168.19.4
<span class="kw">Address</span>:    192.168.19.4#53

<span class="kw">Non-authoritative</span> answer:
<span class="kw">www.python.org</span>    canonical name = python.map.fastly.net.
<span class="kw">Name</span>:    python.map.fastly.net
<span class="kw">Address</span>: 199.27.79.223

<span class="kw">Exit</span> code: 0</code></pre></div>
<p>&#22914;&#26524;&#23376;&#36827;&#31243;&#36824;&#38656;&#35201;&#36755;&#20837;&#65292;&#21017;&#21487;&#20197;&#36890;&#36807;<code>communicate()</code>&#26041;&#27861;&#36755;&#20837;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> subprocess

<span class="bu">print</span>(<span class="st">&#39;$ nslookup&#39;</span>)
p <span class="op">=</span> subprocess.Popen([<span class="st">&#39;nslookup&#39;</span>], stdin<span class="op">=</span>subprocess.PIPE, stdout<span class="op">=</span>subprocess.PIPE, stderr<span class="op">=</span>subprocess.PIPE)
output, err <span class="op">=</span> p.communicate(b<span class="st">&#39;set q=mx</span><span class="ch">\n</span><span class="st">python.org</span><span class="ch">\n</span><span class="st">exit</span><span class="ch">\n</span><span class="st">&#39;</span>)
<span class="bu">print</span>(output.decode(<span class="st">&#39;utf-8&#39;</span>))
<span class="bu">print</span>(<span class="st">&#39;Exit code:&#39;</span>, p.returncode)</code></pre></div>
<p>&#19978;&#38754;&#30340;&#20195;&#30721;&#30456;&#24403;&#20110;&#22312;&#21629;&#20196;&#34892;&#25191;&#34892;&#21629;&#20196;<code>nslookup</code>&#65292;&#28982;&#21518;&#25163;&#21160;&#36755;&#20837;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="bu">set</span> q<span class="op">=</span>mx
python.org
exit</code></pre></div>
<p>&#36816;&#34892;&#32467;&#26524;&#22914;&#19979;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode bash"><code class="sourceCode bash">$ <span class="kw">nslookup</span>
<span class="kw">Server</span>:        192.168.19.4
<span class="kw">Address</span>:    192.168.19.4#53

<span class="kw">Non-authoritative</span> answer:
<span class="kw">python.org</span>    mail exchanger = 50 mail.python.org.

<span class="kw">Authoritative</span> answers can be found from:
<span class="kw">mail.python.org</span>    internet address = 82.94.164.166
<span class="kw">mail.python.org</span>    has AAAA address 2001:888:2000:d::a6


<span class="kw">Exit</span> code: 0</code></pre></div>
<h4 id="&#36827;&#31243;&#38388;&#36890;&#20449;">&#36827;&#31243;&#38388;&#36890;&#20449;</h4>
<p><code>Process</code>&#20043;&#38388;&#32943;&#23450;&#26159;&#38656;&#35201;&#36890;&#20449;&#30340;&#65292;&#25805;&#20316;&#31995;&#32479;&#25552;&#20379;&#20102;&#24456;&#22810;&#26426;&#21046;&#26469;&#23454;&#29616;&#36827;&#31243;&#38388;&#30340;&#36890;&#20449;&#12290;Python&#30340;<code>multiprocessing&#27169;&#22359;</code>&#21253;&#35013;&#20102;&#24213;&#23618;&#30340;&#26426;&#21046;&#65292;&#25552;&#20379;&#20102;<code>Queue&#12289;Pipes</code>&#31561;&#22810;&#31181;&#26041;&#24335;&#26469;&#20132;&#25442;&#25968;&#25454;&#12290;</p>
<p>&#25105;&#20204;&#20197;<code>Queue</code>&#20026;&#20363;&#65292;&#22312;&#29238;&#36827;&#31243;&#20013;&#21019;&#24314;&#20004;&#20010;&#23376;&#36827;&#31243;&#65292;&#19968;&#20010;&#24448;<code>Queue</code>&#37324;&#20889;&#25968;&#25454;&#65292;&#19968;&#20010;&#20174;<code>Queue</code>&#37324;&#35835;&#25968;&#25454;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">from</span> multiprocessing <span class="im">import</span> Process, Queue
<span class="im">import</span> os, time, random

<span class="co"># &#20889;&#25968;&#25454;&#36827;&#31243;&#25191;&#34892;&#30340;&#20195;&#30721;:</span>
<span class="kw">def</span> write(q):
    <span class="bu">print</span>(<span class="st">&#39;Process to write: </span><span class="sc">%s</span><span class="st">&#39;</span> <span class="op">%</span> os.getpid())
    <span class="cf">for</span> value <span class="op">in</span> [<span class="st">&#39;A&#39;</span>, <span class="st">&#39;B&#39;</span>, <span class="st">&#39;C&#39;</span>]:
        <span class="bu">print</span>(<span class="st">&#39;Put </span><span class="sc">%s</span><span class="st"> to queue...&#39;</span> <span class="op">%</span> value)
        q.put(value)
        time.sleep(random.random())

<span class="co"># &#35835;&#25968;&#25454;&#36827;&#31243;&#25191;&#34892;&#30340;&#20195;&#30721;:</span>
<span class="kw">def</span> read(q):
    <span class="bu">print</span>(<span class="st">&#39;Process to read: </span><span class="sc">%s</span><span class="st">&#39;</span> <span class="op">%</span> os.getpid())
    <span class="cf">while</span> <span class="va">True</span>:
        value <span class="op">=</span> q.get(<span class="va">True</span>)
        <span class="bu">print</span>(<span class="st">&#39;Get </span><span class="sc">%s</span><span class="st"> from queue.&#39;</span> <span class="op">%</span> value)

<span class="cf">if</span> <span class="va">__name__</span><span class="op">==</span><span class="st">&#39;__main__&#39;</span>:
    <span class="co"># &#29238;&#36827;&#31243;&#21019;&#24314;Queue&#65292;&#24182;&#20256;&#32473;&#21508;&#20010;&#23376;&#36827;&#31243;&#65306;</span>
    q <span class="op">=</span> Queue()
    pw <span class="op">=</span> Process(target<span class="op">=</span>write, args<span class="op">=</span>(q,))
    pr <span class="op">=</span> Process(target<span class="op">=</span>read, args<span class="op">=</span>(q,))
    <span class="co"># &#21551;&#21160;&#23376;&#36827;&#31243;pw&#65292;&#20889;&#20837;:</span>
    pw.start()
    <span class="co"># &#21551;&#21160;&#23376;&#36827;&#31243;pr&#65292;&#35835;&#21462;:</span>
    pr.start()
    <span class="co"># &#31561;&#24453;pw&#32467;&#26463;:</span>
    pw.join()
    <span class="co"># pr&#36827;&#31243;&#37324;&#26159;&#27515;&#24490;&#29615;&#65292;&#26080;&#27861;&#31561;&#24453;&#20854;&#32467;&#26463;&#65292;&#21482;&#33021;&#24378;&#34892;&#32456;&#27490;:</span>
    pr.terminate()</code></pre></div>
<p>&#36816;&#34892;&#32467;&#26524;&#22914;&#19979;&#65306;</p>
<pre><code>Process to write: 50563
Put A to queue...
Process to read: 50564
Get A from queue.
Put B to queue...
Get B from queue.
Put C to queue...
Get C from queue.</code></pre>
<p>&#22312;<code>Unix/Linux</code>&#19979;&#65292;<code>multiprocessing&#27169;&#22359;</code>&#23553;&#35013;&#20102;<code>fork()</code>&#35843;&#29992;&#65292;&#20351;&#25105;&#20204;&#19981;&#38656;&#35201;&#20851;&#27880;<code>fork()</code>&#30340;&#32454;&#33410;&#12290;&#30001;&#20110;Windows&#27809;&#26377;<code>fork</code>&#35843;&#29992;&#65292;&#22240;&#27492;&#65292;<code>multiprocessing</code>&#38656;&#35201;&#8220;&#27169;&#25311;&#8221;&#20986;<code>fork</code>&#30340;&#25928;&#26524;&#65292;&#29238;&#36827;&#31243;&#25152;&#26377;Python&#23545;&#35937;&#37117;&#24517;&#39035;&#36890;&#36807;<code>pickle</code>&#24207;&#21015;&#21270;&#20877;&#20256;&#21040;&#23376;&#36827;&#31243;&#21435;&#65292;&#25152;&#26377;&#65292;&#22914;&#26524;<code>multiprocessing</code>&#22312;Windows&#19979;&#35843;&#29992;&#22833;&#36133;&#20102;&#65292;&#35201;&#20808;&#32771;&#34385;&#26159;&#19981;&#26159;<code>pickle</code>&#22833;&#36133;&#20102;&#12290;</p>
<h4 id="&#23567;&#32467;-1">&#23567;&#32467;</h4>
<p>&#22312;<code>Unix/Linux</code>&#19979;&#65292;&#21487;&#20197;&#20351;&#29992;<code>fork()</code>&#35843;&#29992;&#23454;&#29616;&#22810;&#36827;&#31243;&#12290;</p>
<p>&#35201;&#23454;&#29616;&#36328;&#24179;&#21488;&#30340;&#22810;&#36827;&#31243;&#65292;&#21487;&#20197;&#20351;&#29992;<code>multiprocessing</code>&#27169;&#22359;&#12290;</p>
<p>&#36827;&#31243;&#38388;&#36890;&#20449;&#26159;&#36890;&#36807;<code>Queue&#12289;Pipes</code>&#31561;&#23454;&#29616;&#30340;&#12290;</p>
<h3 id="&#22810;&#32447;&#31243;">13.2 &#22810;&#32447;&#31243;</h3>
<p>&#22810;&#20219;&#21153;&#21487;&#20197;&#30001;&#22810;&#36827;&#31243;&#23436;&#25104;&#65292;&#20063;&#21487;&#20197;&#30001;&#19968;&#20010;&#36827;&#31243;&#20869;&#30340;&#22810;&#32447;&#31243;&#23436;&#25104;&#12290;</p>
<p>&#25105;&#20204;&#21069;&#38754;&#25552;&#21040;&#20102;&#36827;&#31243;&#26159;&#30001;&#33509;&#24178;&#32447;&#31243;&#32452;&#25104;&#30340;&#65292;&#19968;&#20010;&#36827;&#31243;&#33267;&#23569;&#26377;&#19968;&#20010;&#32447;&#31243;&#12290;</p>
<p>&#30001;&#20110;&#32447;&#31243;&#26159;&#25805;&#20316;&#31995;&#32479;&#30452;&#25509;&#25903;&#25345;&#30340;&#25191;&#34892;&#21333;&#20803;&#65292;&#22240;&#27492;&#65292;&#39640;&#32423;&#35821;&#35328;&#36890;&#24120;&#37117;&#20869;&#32622;&#22810;&#32447;&#31243;&#30340;&#25903;&#25345;&#65292;Python&#20063;&#19981;&#20363;&#22806;&#65292;&#24182;&#19988;&#65292;Python&#30340;&#32447;&#31243;&#26159;&#30495;&#27491;&#30340;<code>Posix Thread</code>&#65292;&#32780;&#19981;&#26159;&#27169;&#25311;&#20986;&#26469;&#30340;&#32447;&#31243;&#12290;</p>
<p>Python&#30340;&#26631;&#20934;&#24211;&#25552;&#20379;&#20102;&#20004;&#20010;&#27169;&#22359;&#65306;<code>_thread</code>&#21644;<code>threading</code>&#65292;<code>_thread</code>&#26159;&#20302;&#32423;&#27169;&#22359;&#65292;<code>threading</code>&#26159;&#39640;&#32423;&#27169;&#22359;&#65292;&#23545;<code>_thread</code>&#36827;&#34892;&#20102;&#23553;&#35013;&#12290;&#32477;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#65292;&#25105;&#20204;&#21482;&#38656;&#35201;&#20351;&#29992;<code>threading</code>&#36825;&#20010;&#39640;&#32423;&#27169;&#22359;&#12290;</p>
<p>&#21551;&#21160;&#19968;&#20010;&#32447;&#31243;&#23601;&#26159;&#25226;&#19968;&#20010;&#20989;&#25968;&#20256;&#20837;&#24182;&#21019;&#24314;<code>Thread</code>&#23454;&#20363;&#65292;&#28982;&#21518;&#35843;&#29992;<code>start()</code>&#24320;&#22987;&#25191;&#34892;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> time, threading

<span class="co"># &#26032;&#32447;&#31243;&#25191;&#34892;&#30340;&#20195;&#30721;:</span>
<span class="kw">def</span> loop():
    <span class="bu">print</span>(<span class="st">&#39;thread </span><span class="sc">%s</span><span class="st"> is running...&#39;</span> <span class="op">%</span> threading.current_thread().name)
    n <span class="op">=</span> <span class="dv">0</span>
    <span class="cf">while</span> n <span class="op">&lt;</span> <span class="dv">5</span>:
        n <span class="op">=</span> n <span class="op">+</span> <span class="dv">1</span>
        <span class="bu">print</span>(<span class="st">&#39;thread </span><span class="sc">%s</span><span class="st"> &gt;&gt;&gt; </span><span class="sc">%s</span><span class="st">&#39;</span> <span class="op">%</span> (threading.current_thread().name, n))
        time.sleep(<span class="dv">1</span>)
    <span class="bu">print</span>(<span class="st">&#39;thread </span><span class="sc">%s</span><span class="st"> ended.&#39;</span> <span class="op">%</span> threading.current_thread().name)

<span class="bu">print</span>(<span class="st">&#39;thread </span><span class="sc">%s</span><span class="st"> is running...&#39;</span> <span class="op">%</span> threading.current_thread().name)
t <span class="op">=</span> threading.Thread(target<span class="op">=</span>loop, name<span class="op">=</span><span class="st">&#39;LoopThread&#39;</span>)
t.start()
t.join()
<span class="bu">print</span>(<span class="st">&#39;thread </span><span class="sc">%s</span><span class="st"> ended.&#39;</span> <span class="op">%</span> threading.current_thread().name)</code></pre></div>
<p>&#25191;&#34892;&#32467;&#26524;&#22914;&#19979;&#65306;</p>
<pre><code>thread MainThread is running...
thread LoopThread is running...
thread LoopThread &gt;&gt;&gt; 1
thread LoopThread &gt;&gt;&gt; 2
thread LoopThread &gt;&gt;&gt; 3
thread LoopThread &gt;&gt;&gt; 4
thread LoopThread &gt;&gt;&gt; 5
thread LoopThread ended.
thread MainThread ended.</code></pre>
<p>&#30001;&#20110;&#20219;&#20309;&#36827;&#31243;&#40664;&#35748;&#23601;&#20250;&#21551;&#21160;&#19968;&#20010;&#32447;&#31243;&#65292;&#25105;&#20204;&#25226;&#35813;&#32447;&#31243;&#31216;&#20026;<strong>&#20027;&#32447;&#31243;</strong>&#65292;&#20027;&#32447;&#31243;&#21448;&#21487;&#20197;&#21551;&#21160;&#26032;&#30340;&#32447;&#31243;&#65292;Python&#30340;<code>threading</code>&#27169;&#22359;&#26377;&#20010;<code>current_thread()</code>&#20989;&#25968;&#65292;&#23427;&#27704;&#36828;&#36820;&#22238;&#24403;&#21069;&#32447;&#31243;&#30340;&#23454;&#20363;&#12290;&#20027;&#32447;&#31243;&#23454;&#20363;&#30340;&#21517;&#23383;&#21483;<code>MainThread</code>&#65292;&#23376;&#32447;&#31243;&#30340;&#21517;&#23383;&#22312;&#21019;&#24314;&#26102;&#25351;&#23450;&#65292;&#25105;&#20204;&#29992;<code>LoopThread</code>&#21629;&#21517;&#23376;&#32447;&#31243;&#12290;&#21517;&#23383;&#20165;&#20165;&#22312;&#25171;&#21360;&#26102;&#29992;&#26469;&#26174;&#31034;&#65292;&#23436;&#20840;&#27809;&#26377;&#20854;&#20182;&#24847;&#20041;&#65292;&#22914;&#26524;&#19981;&#36215;&#21517;&#23383;Python&#23601;&#33258;&#21160;&#32473;&#32447;&#31243;&#21629;&#21517;&#20026;<code>Thread-1&#65292;Thread-2&#8230;&#8230;</code></p>
<h4 id="lock">Lock</h4>
<p>&#22810;&#32447;&#31243;&#21644;&#22810;&#36827;&#31243;&#26368;&#22823;&#30340;&#19981;&#21516;&#22312;&#20110;&#65292;&#22810;&#36827;&#31243;&#20013;&#65292;&#21516;&#19968;&#20010;&#21464;&#37327;&#65292;&#21508;&#33258;&#26377;&#19968;&#20221;&#25335;&#36125;&#23384;&#22312;&#20110;&#27599;&#20010;&#36827;&#31243;&#20013;&#65292;&#20114;&#19981;&#24433;&#21709;&#65292;&#32780;&#22810;&#32447;&#31243;&#20013;&#65292;&#25152;&#26377;&#21464;&#37327;&#37117;&#30001;&#25152;&#26377;&#32447;&#31243;&#20849;&#20139;&#65292;&#25152;&#20197;&#65292;&#20219;&#20309;&#19968;&#20010;&#21464;&#37327;&#37117;&#21487;&#20197;&#34987;&#20219;&#20309;&#19968;&#20010;&#32447;&#31243;&#20462;&#25913;&#65292;&#22240;&#27492;&#65292;&#32447;&#31243;&#20043;&#38388;&#20849;&#20139;&#25968;&#25454;&#26368;&#22823;&#30340;&#21361;&#38505;&#22312;&#20110;&#22810;&#20010;&#32447;&#31243;&#21516;&#26102;&#25913;&#19968;&#20010;&#21464;&#37327;&#65292;&#25226;&#20869;&#23481;&#32473;&#25913;&#20081;&#20102;&#12290;</p>
<p>&#26469;&#30475;&#30475;&#22810;&#20010;&#32447;&#31243;&#21516;&#26102;&#25805;&#20316;&#19968;&#20010;&#21464;&#37327;&#24590;&#20040;&#25226;&#20869;&#23481;&#32473;&#25913;&#20081;&#20102;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> time, threading

<span class="co"># &#20551;&#23450;&#36825;&#26159;&#20320;&#30340;&#38134;&#34892;&#23384;&#27454;:</span>
balance <span class="op">=</span> <span class="dv">0</span>

<span class="kw">def</span> change_it(n):
    <span class="co"># &#20808;&#23384;&#21518;&#21462;&#65292;&#32467;&#26524;&#24212;&#35813;&#20026;0:</span>
    <span class="kw">global</span> balance
    balance <span class="op">=</span> balance <span class="op">+</span> n
    balance <span class="op">=</span> balance <span class="op">-</span> n

<span class="kw">def</span> run_thread(n):
    <span class="cf">for</span> i <span class="op">in</span> <span class="bu">range</span>(<span class="dv">100000</span>):
        change_it(n)

t1 <span class="op">=</span> threading.Thread(target<span class="op">=</span>run_thread, args<span class="op">=</span>(<span class="dv">5</span>,))
t2 <span class="op">=</span> threading.Thread(target<span class="op">=</span>run_thread, args<span class="op">=</span>(<span class="dv">8</span>,))
t1.start()
t2.start()
t1.join()
t2.join()
<span class="bu">print</span>(balance)</code></pre></div>
<p>&#25105;&#20204;&#23450;&#20041;&#20102;&#19968;&#20010;&#20849;&#20139;&#21464;&#37327;<code>balance</code>&#65292;&#21021;&#22987;&#20540;&#20026;0&#65292;&#24182;&#19988;&#21551;&#21160;&#20004;&#20010;&#32447;&#31243;&#65292;&#20808;&#23384;&#21518;&#21462;&#65292;&#29702;&#35770;&#19978;&#32467;&#26524;&#24212;&#35813;&#20026;0&#65292;&#20294;&#26159;&#65292;&#30001;&#20110;&#32447;&#31243;&#30340;&#35843;&#24230;&#26159;&#30001;&#25805;&#20316;&#31995;&#32479;&#20915;&#23450;&#30340;&#65292;&#24403;<code>t1&#12289;t2</code>&#20132;&#26367;&#25191;&#34892;&#26102;&#65292;&#21482;&#35201;&#24490;&#29615;&#27425;&#25968;&#36275;&#22815;&#22810;&#65292;<code>balance</code>&#30340;&#32467;&#26524;&#23601;&#19981;&#19968;&#23450;&#26159;0&#20102;&#12290;</p>
<p>&#21407;&#22240;&#26159;&#22240;&#20026;&#39640;&#32423;&#35821;&#35328;&#30340;&#19968;&#26465;&#35821;&#21477;&#22312;CPU&#25191;&#34892;&#26102;&#26159;&#33509;&#24178;&#26465;&#35821;&#21477;&#65292;&#21363;&#20351;&#19968;&#20010;&#31616;&#21333;&#30340;&#35745;&#31639;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">balance <span class="op">=</span> balance <span class="op">+</span> n</code></pre></div>
<p>&#20063;&#20998;&#20004;&#27493;&#65306;</p>
<ul>
<li>&#35745;&#31639;<code>balance + n</code>&#65292;&#23384;&#20837;&#20020;&#26102;&#21464;&#37327;&#20013;&#65307;</li>
<li>&#23558;&#20020;&#26102;&#21464;&#37327;&#30340;&#20540;&#36171;&#32473;<code>balance</code>&#12290;</li>
</ul>
<p>&#20063;&#23601;&#26159;&#21487;&#20197;&#30475;&#25104;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">x <span class="op">=</span> balance <span class="op">+</span> n
balance <span class="op">=</span> x</code></pre></div>
<p>&#30001;&#20110;<code>x</code>&#26159;&#23616;&#37096;&#21464;&#37327;&#65292;&#20004;&#20010;&#32447;&#31243;&#21508;&#33258;&#37117;&#26377;&#33258;&#24049;&#30340;<code>x</code>&#65292;&#24403;&#20195;&#30721;&#27491;&#24120;&#25191;&#34892;&#26102;&#65306;</p>
<pre><code>&#21021;&#22987;&#20540; balance = 0

t1: x1 = balance + 5 # x1 = 0 + 5 = 5
t1: balance = x1     # balance = 5
t1: x1 = balance - 5 # x1 = 5 - 5 = 0
t1: balance = x1     # balance = 0

t2: x2 = balance + 8 # x2 = 0 + 8 = 8
t2: balance = x2     # balance = 8
t2: x2 = balance - 8 # x2 = 8 - 8 = 0
t2: balance = x2     # balance = 0</code></pre>
<p>&#32467;&#26524; <code>balance = 0</code></p>
<p>&#20294;&#26159;<code>t1</code>&#21644;<code>t2</code>&#26159;&#20132;&#26367;&#36816;&#34892;&#30340;&#65292;&#22914;&#26524;&#25805;&#20316;&#31995;&#32479;&#20197;&#19979;&#38754;&#30340;&#39034;&#24207;&#25191;&#34892;<code>t1&#12289;t2</code>&#65306;</p>
<pre><code>&#21021;&#22987;&#20540; balance = 0

t1: x1 = balance + 5  # x1 = 0 + 5 = 5

t2: x2 = balance + 8  # x2 = 0 + 8 = 8
t2: balance = x2      # balance = 8

t1: balance = x1      # balance = 5
t1: x1 = balance - 5  # x1 = 5 - 5 = 0
t1: balance = x1      # balance = 0

t2: x2 = balance - 5  # x2 = 0 - 5 = -5
t2: balance = x2      # balance = -5</code></pre>
<p>&#32467;&#26524; <code>balance = -5</code></p>
<p>&#31350;&#20854;&#21407;&#22240;&#65292;&#26159;&#22240;&#20026;&#20462;&#25913;<code>balance</code>&#38656;&#35201;&#22810;&#26465;&#35821;&#21477;&#65292;&#32780;&#25191;&#34892;&#36825;&#20960;&#26465;&#35821;&#21477;&#26102;&#65292;&#32447;&#31243;&#21487;&#33021;&#20013;&#26029;&#65292;&#20174;&#32780;&#23548;&#33268;&#22810;&#20010;&#32447;&#31243;&#25226;&#21516;&#19968;&#20010;&#23545;&#35937;&#30340;&#20869;&#23481;&#25913;&#20081;&#20102;&#12290;</p>
<p>&#20004;&#20010;&#32447;&#31243;&#21516;&#26102;&#19968;&#23384;&#19968;&#21462;&#65292;&#23601;&#21487;&#33021;&#23548;&#33268;&#20313;&#39069;&#19981;&#23545;&#65292;&#20320;&#32943;&#23450;&#19981;&#24076;&#26395;&#20320;&#30340;&#38134;&#34892;&#23384;&#27454;&#33707;&#21517;&#20854;&#22937;&#22320;&#21464;&#25104;&#20102;&#36127;&#25968;&#65292;&#25152;&#20197;&#65292;&#25105;&#20204;&#24517;&#39035;&#30830;&#20445;&#19968;&#20010;&#32447;&#31243;&#22312;&#20462;&#25913;<code>balance</code>&#30340;&#26102;&#20505;&#65292;&#21035;&#30340;&#32447;&#31243;&#19968;&#23450;&#19981;&#33021;&#25913;&#12290;</p>
<p>&#22914;&#26524;&#25105;&#20204;&#35201;&#30830;&#20445;<code>balance</code>&#35745;&#31639;&#27491;&#30830;&#65292;&#23601;&#35201;&#32473;<code>change_it()</code>&#19978;&#19968;&#25226;&#38145;&#65292;&#24403;&#26576;&#20010;&#32447;&#31243;&#24320;&#22987;&#25191;&#34892;<code>change_it()</code>&#26102;&#65292;&#25105;&#20204;&#35828;&#65292;&#35813;&#32447;&#31243;&#22240;&#20026;&#33719;&#24471;&#20102;&#38145;&#65292;&#22240;&#27492;&#20854;&#20182;&#32447;&#31243;&#19981;&#33021;&#21516;&#26102;&#25191;&#34892;<code>change_it()</code>&#65292;&#21482;&#33021;&#31561;&#24453;&#65292;&#30452;&#21040;&#38145;&#34987;&#37322;&#25918;&#21518;&#65292;&#33719;&#24471;&#35813;&#38145;&#20197;&#21518;&#25165;&#33021;&#25913;&#12290;&#30001;&#20110;&#38145;&#21482;&#26377;&#19968;&#20010;&#65292;&#26080;&#35770;&#22810;&#23569;&#32447;&#31243;&#65292;&#21516;&#19968;&#26102;&#21051;&#26368;&#22810;&#21482;&#26377;&#19968;&#20010;&#32447;&#31243;&#25345;&#26377;&#35813;&#38145;&#65292;&#25152;&#20197;&#65292;&#19981;&#20250;&#36896;&#25104;&#20462;&#25913;&#30340;&#20914;&#31361;&#12290;&#21019;&#24314;&#19968;&#20010;&#38145;&#23601;&#26159;&#36890;&#36807;threading.Lock()&#26469;&#23454;&#29616;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">balance <span class="op">=</span> <span class="dv">0</span>
lock <span class="op">=</span> threading.Lock()

<span class="kw">def</span> run_thread(n):
    <span class="cf">for</span> i <span class="op">in</span> <span class="bu">range</span>(<span class="dv">100000</span>):
        <span class="co"># &#20808;&#35201;&#33719;&#21462;&#38145;:</span>
        lock.acquire()
        <span class="cf">try</span>:
            <span class="co"># &#25918;&#24515;&#22320;&#25913;&#21543;:</span>
            change_it(n)
        <span class="cf">finally</span>:
            <span class="co"># &#25913;&#23436;&#20102;&#19968;&#23450;&#35201;&#37322;&#25918;&#38145;:</span>
            lock.release()</code></pre></div>
<p>&#24403;&#22810;&#20010;&#32447;&#31243;&#21516;&#26102;&#25191;&#34892;<code>lock.acquire()</code>&#26102;&#65292;&#21482;&#26377;&#19968;&#20010;&#32447;&#31243;&#33021;&#25104;&#21151;&#22320;&#33719;&#21462;&#38145;&#65292;&#28982;&#21518;&#32487;&#32493;&#25191;&#34892;&#20195;&#30721;&#65292;&#20854;&#20182;&#32447;&#31243;&#23601;&#32487;&#32493;&#31561;&#24453;&#30452;&#21040;&#33719;&#24471;&#38145;&#20026;&#27490;&#12290;</p>
<p>&#33719;&#24471;&#38145;&#30340;&#32447;&#31243;&#29992;&#23436;&#21518;&#19968;&#23450;&#35201;&#37322;&#25918;&#38145;&#65292;&#21542;&#21017;&#37027;&#20123;&#33510;&#33510;&#31561;&#24453;&#38145;&#30340;&#32447;&#31243;&#23558;&#27704;&#36828;&#31561;&#24453;&#19979;&#21435;&#65292;&#25104;&#20026;&#27515;&#32447;&#31243;&#12290;&#25152;&#20197;&#25105;&#20204;&#29992;<code>try...finally</code>&#26469;&#30830;&#20445;&#38145;&#19968;&#23450;&#20250;&#34987;&#37322;&#25918;&#12290;</p>
<p>&#38145;&#30340;&#22909;&#22788;&#23601;&#26159;&#30830;&#20445;&#20102;&#26576;&#27573;&#20851;&#38190;&#20195;&#30721;&#21482;&#33021;&#30001;&#19968;&#20010;&#32447;&#31243;&#20174;&#22836;&#21040;&#23614;&#23436;&#25972;&#22320;&#25191;&#34892;&#65292;&#22351;&#22788;&#24403;&#28982;&#20063;&#24456;&#22810;&#65292;&#39318;&#20808;&#26159;&#38459;&#27490;&#20102;&#22810;&#32447;&#31243;&#24182;&#21457;&#25191;&#34892;&#65292;&#21253;&#21547;&#38145;&#30340;&#26576;&#27573;&#20195;&#30721;&#23454;&#38469;&#19978;&#21482;&#33021;&#20197;&#21333;&#32447;&#31243;&#27169;&#24335;&#25191;&#34892;&#65292;&#25928;&#29575;&#23601;&#22823;&#22823;&#22320;&#19979;&#38477;&#20102;&#12290;&#20854;&#27425;&#65292;&#30001;&#20110;&#21487;&#20197;&#23384;&#22312;&#22810;&#20010;&#38145;&#65292;&#19981;&#21516;&#30340;&#32447;&#31243;&#25345;&#26377;&#19981;&#21516;&#30340;&#38145;&#65292;&#24182;&#35797;&#22270;&#33719;&#21462;&#23545;&#26041;&#25345;&#26377;&#30340;&#38145;&#26102;&#65292;&#21487;&#33021;&#20250;&#36896;&#25104;&#27515;&#38145;&#65292;&#23548;&#33268;&#22810;&#20010;&#32447;&#31243;&#20840;&#37096;&#25346;&#36215;&#65292;&#26082;&#19981;&#33021;&#25191;&#34892;&#65292;&#20063;&#26080;&#27861;&#32467;&#26463;&#65292;&#21482;&#33021;&#38752;&#25805;&#20316;&#31995;&#32479;&#24378;&#21046;&#32456;&#27490;&#12290;</p>
<h4 id="&#22810;&#26680;cpu">&#22810;&#26680;CPU</h4>
<p>&#22914;&#26524;&#20320;&#19981;&#24184;&#25317;&#26377;&#19968;&#20010;&#22810;&#26680;CPU&#65292;&#20320;&#32943;&#23450;&#22312;&#24819;&#65292;&#22810;&#26680;&#24212;&#35813;&#21487;&#20197;&#21516;&#26102;&#25191;&#34892;&#22810;&#20010;&#32447;&#31243;&#12290;</p>
<p>&#22914;&#26524;&#20889;&#19968;&#20010;&#27515;&#24490;&#29615;&#30340;&#35805;&#65292;&#20250;&#20986;&#29616;&#20160;&#20040;&#24773;&#20917;&#21602;&#65311;</p>
<p>&#25171;&#24320;<code>Mac OS X</code>&#30340;<code>Activity Monitor</code>&#65292;&#25110;&#32773;Windows&#30340;<code>Task Manager</code>&#65292;&#37117;&#21487;&#20197;&#30417;&#25511;&#26576;&#20010;&#36827;&#31243;&#30340;CPU&#20351;&#29992;&#29575;&#12290;</p>
<p>&#25105;&#20204;&#21487;&#20197;&#30417;&#25511;&#21040;&#19968;&#20010;&#27515;&#24490;&#29615;&#32447;&#31243;&#20250;100%&#21344;&#29992;&#19968;&#20010;CPU&#12290;</p>
<p>&#22914;&#26524;&#26377;&#20004;&#20010;&#27515;&#24490;&#29615;&#32447;&#31243;&#65292;&#22312;&#22810;&#26680;CPU&#20013;&#65292;&#21487;&#20197;&#30417;&#25511;&#21040;&#20250;&#21344;&#29992;200%&#30340;CPU&#65292;&#20063;&#23601;&#26159;&#21344;&#29992;&#20004;&#20010;CPU&#26680;&#24515;&#12290;</p>
<p>&#35201;&#24819;&#25226;N&#26680;CPU&#30340;&#26680;&#24515;&#20840;&#37096;&#36305;&#28385;&#65292;&#23601;&#24517;&#39035;&#21551;&#21160;N&#20010;&#27515;&#24490;&#29615;&#32447;&#31243;&#12290;</p>
<p>&#35797;&#35797;&#29992;Python&#20889;&#20010;&#27515;&#24490;&#29615;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> threading, multiprocessing

<span class="kw">def</span> loop():
    x <span class="op">=</span> <span class="dv">0</span>
    <span class="cf">while</span> <span class="va">True</span>:
        x <span class="op">=</span> x <span class="op">^</span> <span class="dv">1</span>

<span class="cf">for</span> i <span class="op">in</span> <span class="bu">range</span>(multiprocessing.cpu_count()):
    t <span class="op">=</span> threading.Thread(target<span class="op">=</span>loop)
    t.start()</code></pre></div>
<p>&#21551;&#21160;&#19982;CPU&#26680;&#24515;&#25968;&#37327;&#30456;&#21516;&#30340;N&#20010;&#32447;&#31243;&#65292;&#22312;4&#26680;CPU&#19978;&#21487;&#20197;&#30417;&#25511;&#21040;CPU&#21344;&#29992;&#29575;&#20165;&#26377;102%&#65292;&#20063;&#23601;&#26159;&#20165;&#20351;&#29992;&#20102;&#19968;&#26680;&#12290;</p>
<p>&#20294;&#26159;&#29992;<code>C&#12289;C++</code>&#25110;<code>Java</code>&#26469;&#25913;&#20889;&#30456;&#21516;&#30340;&#27515;&#24490;&#29615;&#65292;&#30452;&#25509;&#21487;&#20197;&#25226;&#20840;&#37096;&#26680;&#24515;&#36305;&#28385;&#65292;4&#26680;&#23601;&#36305;&#21040;400%&#65292;8&#26680;&#23601;&#36305;&#21040;800%&#65292;&#20026;&#20160;&#20040;Python&#19981;&#34892;&#21602;&#65311;</p>
<p>&#22240;&#20026;Python&#30340;&#32447;&#31243;&#34429;&#28982;&#26159;&#30495;&#27491;&#30340;&#32447;&#31243;&#65292;&#20294;&#35299;&#37322;&#22120;&#25191;&#34892;&#20195;&#30721;&#26102;&#65292;&#26377;&#19968;&#20010;<code>GIL</code>&#38145;&#65306;<code>Global Interpreter Lock</code>&#65292;&#20219;&#20309;Python&#32447;&#31243;&#25191;&#34892;&#21069;&#65292;&#24517;&#39035;&#20808;&#33719;&#24471;<code>GIL</code>&#38145;&#65292;&#28982;&#21518;&#65292;&#27599;&#25191;&#34892;100&#26465;&#23383;&#33410;&#30721;&#65292;&#35299;&#37322;&#22120;&#23601;&#33258;&#21160;&#37322;&#25918;<code>GIL</code>&#38145;&#65292;&#35753;&#21035;&#30340;&#32447;&#31243;&#26377;&#26426;&#20250;&#25191;&#34892;&#12290;&#36825;&#20010;<code>GIL</code>&#20840;&#23616;&#38145;&#23454;&#38469;&#19978;&#25226;&#25152;&#26377;&#32447;&#31243;&#30340;&#25191;&#34892;&#20195;&#30721;&#37117;&#32473;&#19978;&#20102;&#38145;&#65292;&#25152;&#20197;&#65292;&#22810;&#32447;&#31243;&#22312;Python&#20013;&#21482;&#33021;&#20132;&#26367;&#25191;&#34892;&#65292;&#21363;&#20351;100&#20010;&#32447;&#31243;&#36305;&#22312;100&#26680;CPU&#19978;&#65292;&#20063;&#21482;&#33021;&#29992;&#21040;1&#20010;&#26680;&#12290;</p>
<p><code>GIL</code>&#26159;Python&#35299;&#37322;&#22120;&#35774;&#35745;&#30340;&#21382;&#21490;&#36951;&#30041;&#38382;&#39064;&#65292;&#36890;&#24120;&#25105;&#20204;&#29992;&#30340;&#35299;&#37322;&#22120;&#26159;&#23448;&#26041;&#23454;&#29616;&#30340;<code>CPython</code>&#65292;&#35201;&#30495;&#27491;&#21033;&#29992;&#22810;&#26680;&#65292;&#38500;&#38750;&#37325;&#20889;&#19968;&#20010;&#19981;&#24102;<code>GIL</code>&#30340;&#35299;&#37322;&#22120;&#12290;</p>
<p>&#25152;&#20197;&#65292;&#22312;Python&#20013;&#65292;&#21487;&#20197;&#20351;&#29992;&#22810;&#32447;&#31243;&#65292;&#20294;&#19981;&#35201;&#25351;&#26395;&#33021;&#26377;&#25928;&#21033;&#29992;&#22810;&#26680;&#12290;&#22914;&#26524;&#19968;&#23450;&#35201;&#36890;&#36807;&#22810;&#32447;&#31243;&#21033;&#29992;&#22810;&#26680;&#65292;&#37027;&#21482;&#33021;&#36890;&#36807;<code>C&#25193;&#23637;</code>&#26469;&#23454;&#29616;&#65292;&#19981;&#36807;&#36825;&#26679;&#23601;&#22833;&#21435;&#20102;Python&#31616;&#21333;&#26131;&#29992;&#30340;&#29305;&#28857;&#12290;</p>
<p>&#19981;&#36807;&#65292;&#20063;&#19981;&#29992;&#36807;&#20110;&#25285;&#24515;&#65292;Python&#34429;&#28982;&#19981;&#33021;&#21033;&#29992;&#22810;&#32447;&#31243;&#23454;&#29616;&#22810;&#26680;&#20219;&#21153;&#65292;&#20294;&#21487;&#20197;&#36890;&#36807;&#22810;&#36827;&#31243;&#23454;&#29616;&#22810;&#26680;&#20219;&#21153;&#12290;&#22810;&#20010;Python&#36827;&#31243;&#26377;&#21508;&#33258;&#29420;&#31435;&#30340;<code>GIL</code>&#38145;&#65292;&#20114;&#19981;&#24433;&#21709;&#12290;</p>
<h4 id="&#23567;&#32467;-2">&#23567;&#32467;</h4>
<p>&#22810;&#32447;&#31243;&#32534;&#31243;&#65292;&#27169;&#22411;&#22797;&#26434;&#65292;&#23481;&#26131;&#21457;&#29983;&#20914;&#31361;&#65292;&#24517;&#39035;&#29992;&#38145;&#21152;&#20197;&#38548;&#31163;&#65292;&#21516;&#26102;&#65292;&#21448;&#35201;&#23567;&#24515;&#27515;&#38145;&#30340;&#21457;&#29983;&#12290;</p>
<p>Python&#35299;&#37322;&#22120;&#30001;&#20110;&#35774;&#35745;&#26102;&#26377;<code>GIL&#20840;&#23616;&#38145;</code>&#65292;&#23548;&#33268;&#20102;&#22810;&#32447;&#31243;&#26080;&#27861;&#21033;&#29992;&#22810;&#26680;&#12290;&#22810;&#32447;&#31243;&#30340;&#24182;&#21457;&#22312;Python&#20013;&#23601;&#26159;&#19968;&#20010;&#32654;&#20029;&#30340;&#26790;&#12290;</p>
<h3 id="threadlocal">13.3 ThreadLocal</h3>
<p>&#22312;&#22810;&#32447;&#31243;&#29615;&#22659;&#19979;&#65292;&#27599;&#20010;&#32447;&#31243;&#37117;&#26377;&#33258;&#24049;&#30340;&#25968;&#25454;&#12290;&#19968;&#20010;&#32447;&#31243;&#20351;&#29992;&#33258;&#24049;&#30340;&#23616;&#37096;&#21464;&#37327;&#27604;&#20351;&#29992;&#20840;&#23616;&#21464;&#37327;&#22909;&#65292;&#22240;&#20026;&#23616;&#37096;&#21464;&#37327;&#21482;&#26377;&#32447;&#31243;&#33258;&#24049;&#33021;&#30475;&#35265;&#65292;&#19981;&#20250;&#24433;&#21709;&#20854;&#20182;&#32447;&#31243;&#65292;&#32780;&#20840;&#23616;&#21464;&#37327;&#30340;&#20462;&#25913;&#24517;&#39035;&#21152;&#38145;&#12290;</p>
<p>&#20294;&#26159;&#23616;&#37096;&#21464;&#37327;&#20063;&#26377;&#38382;&#39064;&#65292;&#23601;&#26159;&#22312;&#20989;&#25968;&#35843;&#29992;&#30340;&#26102;&#20505;&#65292;&#20256;&#36882;&#36215;&#26469;&#24456;&#40635;&#28902;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">def</span> process_student(name):
    std <span class="op">=</span> Student(name)
    <span class="co"># std&#26159;&#23616;&#37096;&#21464;&#37327;&#65292;&#20294;&#26159;&#27599;&#20010;&#20989;&#25968;&#37117;&#35201;&#29992;&#23427;&#65292;&#22240;&#27492;&#24517;&#39035;&#20256;&#36827;&#21435;&#65306;</span>
    do_task_1(std)
    do_task_2(std)

<span class="kw">def</span> do_task_1(std):
    do_subtask_1(std)
    do_subtask_2(std)

<span class="kw">def</span> do_task_2(std):
    do_subtask_2(std)
    do_subtask_2(std)</code></pre></div>
<p>&#27599;&#20010;&#20989;&#25968;&#19968;&#23618;&#19968;&#23618;&#35843;&#29992;&#37117;&#36825;&#20040;&#20256;&#21442;&#25968;&#37027;&#36824;&#24471;&#20102;&#65311;&#29992;&#20840;&#23616;&#21464;&#37327;&#65311;&#20063;&#19981;&#34892;&#65292;&#22240;&#20026;&#27599;&#20010;&#32447;&#31243;&#22788;&#29702;&#19981;&#21516;&#30340;<code>Student</code>&#23545;&#35937;&#65292;&#19981;&#33021;&#20849;&#20139;&#12290;</p>
<p>&#22914;&#26524;&#29992;&#19968;&#20010;&#20840;&#23616;<code>dict</code>&#23384;&#25918;&#25152;&#26377;&#30340;<code>Student</code>&#23545;&#35937;&#65292;&#28982;&#21518;&#20197;<code>thread</code>&#33258;&#36523;&#20316;&#20026;<code>key</code>&#33719;&#24471;&#32447;&#31243;&#23545;&#24212;&#30340;<code>Student</code>&#23545;&#35937;&#22914;&#20309;&#65311;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">global_dict <span class="op">=</span> {}

<span class="kw">def</span> std_thread(name):
    std <span class="op">=</span> Student(name)
    <span class="co"># &#25226;std&#25918;&#21040;&#20840;&#23616;&#21464;&#37327;global_dict&#20013;&#65306;</span>
    global_dict[threading.current_thread()] <span class="op">=</span> std
    do_task_1()
    do_task_2()

<span class="kw">def</span> do_task_1():
    <span class="co"># &#19981;&#20256;&#20837;std&#65292;&#32780;&#26159;&#26681;&#25454;&#24403;&#21069;&#32447;&#31243;&#26597;&#25214;&#65306;</span>
    std <span class="op">=</span> global_dict[threading.current_thread()]
    ...

<span class="kw">def</span> do_task_2():
    <span class="co"># &#20219;&#20309;&#20989;&#25968;&#37117;&#21487;&#20197;&#26597;&#25214;&#20986;&#24403;&#21069;&#32447;&#31243;&#30340;std&#21464;&#37327;&#65306;</span>
    std <span class="op">=</span> global_dict[threading.current_thread()]
    ...</code></pre></div>
<p>&#36825;&#31181;&#26041;&#24335;&#29702;&#35770;&#19978;&#26159;&#21487;&#34892;&#30340;&#65292;&#23427;&#26368;&#22823;&#30340;&#20248;&#28857;&#26159;&#28040;&#38500;&#20102;<code>std</code>&#23545;&#35937;&#22312;&#27599;&#23618;&#20989;&#25968;&#20013;&#30340;&#20256;&#36882;&#38382;&#39064;&#65292;&#20294;&#26159;&#65292;&#27599;&#20010;&#20989;&#25968;&#33719;&#21462;<code>std</code>&#30340;&#20195;&#30721;&#26377;&#28857;&#19985;&#12290;</p>
<p>&#26377;&#27809;&#26377;&#26356;&#31616;&#21333;&#30340;&#26041;&#24335;&#65311;</p>
<p><code>ThreadLocal</code>&#24212;&#36816;&#32780;&#29983;&#65292;&#19981;&#29992;&#26597;&#25214;<code>dict&#65292;ThreadLocal</code>&#24110;&#20320;&#33258;&#21160;&#20570;&#36825;&#20214;&#20107;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> threading

<span class="co"># &#21019;&#24314;&#20840;&#23616;ThreadLocal&#23545;&#35937;:</span>
local_school <span class="op">=</span> threading.local()

<span class="kw">def</span> process_student():
    <span class="co"># &#33719;&#21462;&#24403;&#21069;&#32447;&#31243;&#20851;&#32852;&#30340;student:</span>
    std <span class="op">=</span> local_school.student
    <span class="bu">print</span>(<span class="st">&#39;Hello, </span><span class="sc">%s</span><span class="st"> (in </span><span class="sc">%s</span><span class="st">)&#39;</span> <span class="op">%</span> (std, threading.current_thread().name))

<span class="kw">def</span> process_thread(name):
    <span class="co"># &#32465;&#23450;ThreadLocal&#30340;student:</span>
    local_school.student <span class="op">=</span> name
    process_student()

t1 <span class="op">=</span> threading.Thread(target<span class="op">=</span> process_thread, args<span class="op">=</span>(<span class="st">&#39;Alice&#39;</span>,), name<span class="op">=</span><span class="st">&#39;Thread-A&#39;</span>)
t2 <span class="op">=</span> threading.Thread(target<span class="op">=</span> process_thread, args<span class="op">=</span>(<span class="st">&#39;Bob&#39;</span>,), name<span class="op">=</span><span class="st">&#39;Thread-B&#39;</span>)
t1.start()
t2.start()
t1.join()
t2.join()</code></pre></div>
<p>&#25191;&#34892;&#32467;&#26524;&#65306;</p>
<pre><code>Hello, Alice (in Thread-A)
Hello, Bob (in Thread-B)</code></pre>
<p>&#20840;&#23616;&#21464;&#37327;<code>local_school</code>&#23601;&#26159;&#19968;&#20010;<code>ThreadLocal</code>&#23545;&#35937;&#65292;&#27599;&#20010;<code>Thread</code>&#23545;&#23427;&#37117;&#21487;&#20197;&#35835;&#20889;<code>student</code>&#23646;&#24615;&#65292;&#20294;&#20114;&#19981;&#24433;&#21709;&#12290;&#20320;&#21487;&#20197;&#25226;<code>local_school</code>&#30475;&#25104;&#20840;&#23616;&#21464;&#37327;&#65292;&#20294;&#27599;&#20010;&#23646;&#24615;&#22914;<code>local_school.student</code>&#37117;&#26159;&#32447;&#31243;&#30340;&#23616;&#37096;&#21464;&#37327;&#65292;&#21487;&#20197;&#20219;&#24847;&#35835;&#20889;&#32780;&#20114;&#19981;&#24178;&#25200;&#65292;&#20063;&#19981;&#29992;&#31649;&#29702;&#38145;&#30340;&#38382;&#39064;&#65292;<code>ThreadLocal</code>&#20869;&#37096;&#20250;&#22788;&#29702;&#12290;</p>
<p>&#21487;&#20197;&#29702;&#35299;&#20026;&#20840;&#23616;&#21464;&#37327;<code>local_school</code>&#26159;&#19968;&#20010;<code>dict</code>&#65292;&#19981;&#20294;&#21487;&#20197;&#29992;<code>local_school.student</code>&#65292;&#36824;&#21487;&#20197;&#32465;&#23450;&#20854;&#20182;&#21464;&#37327;&#65292;&#22914;<code>local_school.teacher</code>&#31561;&#31561;&#12290;</p>
<p><code>ThreadLocal</code>&#26368;&#24120;&#29992;&#30340;&#22320;&#26041;&#23601;&#26159;&#20026;&#27599;&#20010;&#32447;&#31243;&#32465;&#23450;&#19968;&#20010;&#25968;&#25454;&#24211;&#36830;&#25509;&#65292;HTTP&#35831;&#27714;&#65292;&#29992;&#25143;&#36523;&#20221;&#20449;&#24687;&#31561;&#65292;&#36825;&#26679;&#19968;&#20010;&#32447;&#31243;&#30340;&#25152;&#26377;&#35843;&#29992;&#21040;&#30340;&#22788;&#29702;&#20989;&#25968;&#37117;&#21487;&#20197;&#38750;&#24120;&#26041;&#20415;&#22320;&#35775;&#38382;&#36825;&#20123;&#36164;&#28304;&#12290;</p>
<h4 id="&#23567;&#32467;-3">&#23567;&#32467;</h4>
<p>&#19968;&#20010;<code>ThreadLocal</code>&#21464;&#37327;&#34429;&#28982;&#26159;&#20840;&#23616;&#21464;&#37327;&#65292;&#20294;&#27599;&#20010;&#32447;&#31243;&#37117;&#21482;&#33021;&#35835;&#20889;&#33258;&#24049;&#32447;&#31243;&#30340;&#29420;&#31435;&#21103;&#26412;&#65292;&#20114;&#19981;&#24178;&#25200;&#12290;<code>ThreadLocal</code>&#35299;&#20915;&#20102;&#21442;&#25968;&#22312;&#19968;&#20010;&#32447;&#31243;&#20013;&#21508;&#20010;&#20989;&#25968;&#20043;&#38388;&#20114;&#30456;&#20256;&#36882;&#30340;&#38382;&#39064;&#12290;</p>
<h3 id="&#36827;&#31243;-vs.-&#32447;&#31243;">13.4 &#36827;&#31243; vs. &#32447;&#31243;</h3>
<p>&#25105;&#20204;&#20171;&#32461;&#20102;&#22810;&#36827;&#31243;&#21644;&#22810;&#32447;&#31243;&#65292;&#36825;&#26159;&#23454;&#29616;&#22810;&#20219;&#21153;&#26368;&#24120;&#29992;&#30340;&#20004;&#31181;&#26041;&#24335;&#12290;&#29616;&#22312;&#65292;&#25105;&#20204;&#26469;&#35752;&#35770;&#19968;&#19979;&#36825;&#20004;&#31181;&#26041;&#24335;&#30340;&#20248;&#32570;&#28857;&#12290;</p>
<p>&#39318;&#20808;&#65292;&#35201;&#23454;&#29616;&#22810;&#20219;&#21153;&#65292;&#36890;&#24120;&#25105;&#20204;&#20250;&#35774;&#35745;<code>Master-Worker</code>&#27169;&#24335;&#65292;<code>Master</code>&#36127;&#36131;&#20998;&#37197;&#20219;&#21153;&#65292;<code>Worker</code>&#36127;&#36131;&#25191;&#34892;&#20219;&#21153;&#65292;&#22240;&#27492;&#65292;&#22810;&#20219;&#21153;&#29615;&#22659;&#19979;&#65292;&#36890;&#24120;&#26159;&#19968;&#20010;<code>Master</code>&#65292;&#22810;&#20010;<code>Worker</code>&#12290;</p>
<p>&#22914;&#26524;&#29992;&#22810;&#36827;&#31243;&#23454;&#29616;<code>Master-Worker</code>&#65292;&#20027;&#36827;&#31243;&#23601;&#26159;<code>Master</code>&#65292;&#20854;&#20182;&#36827;&#31243;&#23601;&#26159;<code>Worker</code>&#12290;</p>
<p>&#22914;&#26524;&#29992;&#22810;&#32447;&#31243;&#23454;&#29616;<code>Master-Worker</code>&#65292;&#20027;&#32447;&#31243;&#23601;&#26159;<code>Master</code>&#65292;&#20854;&#20182;&#32447;&#31243;&#23601;&#26159;<code>Worker</code>&#12290;</p>
<p>&#22810;&#36827;&#31243;&#27169;&#24335;&#26368;&#22823;&#30340;&#20248;&#28857;&#23601;&#26159;&#31283;&#23450;&#24615;&#39640;&#65292;&#22240;&#20026;&#19968;&#20010;&#23376;&#36827;&#31243;&#23849;&#28291;&#20102;&#65292;&#19981;&#20250;&#24433;&#21709;&#20027;&#36827;&#31243;&#21644;&#20854;&#20182;&#23376;&#36827;&#31243;&#12290;&#65288;&#24403;&#28982;&#20027;&#36827;&#31243;&#25346;&#20102;&#25152;&#26377;&#36827;&#31243;&#23601;&#20840;&#25346;&#20102;&#65292;&#20294;&#26159;<code>Master</code>&#36827;&#31243;&#21482;&#36127;&#36131;&#20998;&#37197;&#20219;&#21153;&#65292;&#25346;&#25481;&#30340;&#27010;&#29575;&#20302;&#65289;&#33879;&#21517;&#30340;<code>Apache</code>&#26368;&#26089;&#23601;&#26159;&#37319;&#29992;&#22810;&#36827;&#31243;&#27169;&#24335;&#12290;</p>
<p>&#22810;&#36827;&#31243;&#27169;&#24335;&#30340;&#32570;&#28857;&#26159;&#21019;&#24314;&#36827;&#31243;&#30340;&#20195;&#20215;&#22823;&#65292;&#22312;<code>Unix/Linux</code>&#31995;&#32479;&#19979;&#65292;&#29992;<code>fork</code>&#35843;&#29992;&#36824;&#34892;&#65292;&#22312;Windows&#19979;&#21019;&#24314;&#36827;&#31243;&#24320;&#38144;&#24040;&#22823;&#12290;&#21478;&#22806;&#65292;&#25805;&#20316;&#31995;&#32479;&#33021;&#21516;&#26102;&#36816;&#34892;&#30340;&#36827;&#31243;&#25968;&#20063;&#26159;&#26377;&#38480;&#30340;&#65292;&#22312;&#20869;&#23384;&#21644;CPU&#30340;&#38480;&#21046;&#19979;&#65292;&#22914;&#26524;&#26377;&#20960;&#21315;&#20010;&#36827;&#31243;&#21516;&#26102;&#36816;&#34892;&#65292;&#25805;&#20316;&#31995;&#32479;&#36830;&#35843;&#24230;&#37117;&#20250;&#25104;&#38382;&#39064;&#12290;</p>
<p>&#22810;&#32447;&#31243;&#27169;&#24335;&#36890;&#24120;&#27604;&#22810;&#36827;&#31243;&#24555;&#19968;&#28857;&#65292;&#20294;&#26159;&#20063;&#24555;&#19981;&#21040;&#21738;&#21435;&#65292;&#32780;&#19988;&#65292;&#22810;&#32447;&#31243;&#27169;&#24335;&#33268;&#21629;&#30340;&#32570;&#28857;&#23601;&#26159;&#20219;&#20309;&#19968;&#20010;&#32447;&#31243;&#25346;&#25481;&#37117;&#21487;&#33021;&#30452;&#25509;&#36896;&#25104;&#25972;&#20010;&#36827;&#31243;&#23849;&#28291;&#65292;&#22240;&#20026;&#25152;&#26377;&#32447;&#31243;&#20849;&#20139;&#36827;&#31243;&#30340;&#20869;&#23384;&#12290;&#22312;Windows&#19978;&#65292;&#22914;&#26524;&#19968;&#20010;&#32447;&#31243;&#25191;&#34892;&#30340;&#20195;&#30721;&#20986;&#20102;&#38382;&#39064;&#65292;&#20320;&#32463;&#24120;&#21487;&#20197;&#30475;&#21040;&#36825;&#26679;&#30340;&#25552;&#31034;&#65306;&#8220;&#35813;&#31243;&#24207;&#25191;&#34892;&#20102;&#38750;&#27861;&#25805;&#20316;&#65292;&#21363;&#23558;&#20851;&#38381;&#8221;&#65292;&#20854;&#23454;&#24448;&#24448;&#26159;&#26576;&#20010;&#32447;&#31243;&#20986;&#20102;&#38382;&#39064;&#65292;&#20294;&#26159;&#25805;&#20316;&#31995;&#32479;&#20250;&#24378;&#21046;&#32467;&#26463;&#25972;&#20010;&#36827;&#31243;&#12290;</p>
<p>&#22312;Windows&#19979;&#65292;&#22810;&#32447;&#31243;&#30340;&#25928;&#29575;&#27604;&#22810;&#36827;&#31243;&#35201;&#39640;&#65292;&#25152;&#20197;&#24494;&#36719;&#30340;<code>IIS&#26381;&#21153;&#22120;</code>&#40664;&#35748;&#37319;&#29992;&#22810;&#32447;&#31243;&#27169;&#24335;&#12290;&#30001;&#20110;&#22810;&#32447;&#31243;&#23384;&#22312;&#31283;&#23450;&#24615;&#30340;&#38382;&#39064;&#65292;<code>IIS</code>&#30340;&#31283;&#23450;&#24615;&#23601;&#19981;&#22914;<code>Apache</code>&#12290;&#20026;&#20102;&#32531;&#35299;&#36825;&#20010;&#38382;&#39064;&#65292;<code>IIS</code>&#21644;<code>Apache</code>&#29616;&#22312;&#21448;&#26377;&#22810;&#36827;&#31243;+&#22810;&#32447;&#31243;&#30340;&#28151;&#21512;&#27169;&#24335;&#65292;&#30495;&#26159;&#25226;&#38382;&#39064;&#36234;&#25630;&#36234;&#22797;&#26434;&#12290;</p>
<h4 id="&#32447;&#31243;&#20999;&#25442;">&#32447;&#31243;&#20999;&#25442;</h4>
<p>&#26080;&#35770;&#26159;&#22810;&#36827;&#31243;&#36824;&#26159;&#22810;&#32447;&#31243;&#65292;&#21482;&#35201;&#25968;&#37327;&#19968;&#22810;&#65292;&#25928;&#29575;&#32943;&#23450;&#19978;&#19981;&#21435;&#65292;&#20026;&#20160;&#20040;&#21602;&#65311;</p>
<p>&#25105;&#20204;&#25171;&#20010;&#27604;&#26041;&#65292;&#20551;&#35774;&#20320;&#19981;&#24184;&#27491;&#22312;&#20934;&#22791;&#20013;&#32771;&#65292;&#27599;&#22825;&#26202;&#19978;&#38656;&#35201;&#20570;&#35821;&#25991;&#12289;&#25968;&#23398;&#12289;&#33521;&#35821;&#12289;&#29289;&#29702;&#12289;&#21270;&#23398;&#36825;5&#31185;&#30340;&#20316;&#19994;&#65292;&#27599;&#39033;&#20316;&#19994;&#32791;&#26102;1&#23567;&#26102;&#12290;</p>
<p>&#22914;&#26524;&#20320;&#20808;&#33457;1&#23567;&#26102;&#20570;&#35821;&#25991;&#20316;&#19994;&#65292;&#20570;&#23436;&#20102;&#65292;&#20877;&#33457;1&#23567;&#26102;&#20570;&#25968;&#23398;&#20316;&#19994;&#65292;&#36825;&#26679;&#65292;&#20381;&#27425;&#20840;&#37096;&#20570;&#23436;&#65292;&#19968;&#20849;&#33457;5&#23567;&#26102;&#65292;&#36825;&#31181;&#26041;&#24335;&#31216;&#20026;&#21333;&#20219;&#21153;&#27169;&#22411;&#65292;&#25110;&#32773;&#25209;&#22788;&#29702;&#20219;&#21153;&#27169;&#22411;&#12290;</p>
<p>&#20551;&#35774;&#20320;&#25171;&#31639;&#20999;&#25442;&#21040;&#22810;&#20219;&#21153;&#27169;&#22411;&#65292;&#21487;&#20197;&#20808;&#20570;1&#20998;&#38047;&#35821;&#25991;&#65292;&#20877;&#20999;&#25442;&#21040;&#25968;&#23398;&#20316;&#19994;&#65292;&#20570;1&#20998;&#38047;&#65292;&#20877;&#20999;&#25442;&#21040;&#33521;&#35821;&#65292;&#20197;&#27492;&#31867;&#25512;&#65292;&#21482;&#35201;&#20999;&#25442;&#36895;&#24230;&#36275;&#22815;&#24555;&#65292;&#36825;&#31181;&#26041;&#24335;&#23601;&#21644;&#21333;&#26680;CPU&#25191;&#34892;&#22810;&#20219;&#21153;&#26159;&#19968;&#26679;&#30340;&#20102;&#65292;&#20197;&#24188;&#20799;&#22253;&#23567;&#26379;&#21451;&#30340;&#30524;&#20809;&#26469;&#30475;&#65292;&#20320;&#23601;&#27491;&#22312;&#21516;&#26102;&#20889;5&#31185;&#20316;&#19994;&#12290;</p>
<p>&#20294;&#26159;&#65292;&#20999;&#25442;&#20316;&#19994;&#26159;&#26377;&#20195;&#20215;&#30340;&#65292;&#27604;&#22914;&#20174;&#35821;&#25991;&#20999;&#21040;&#25968;&#23398;&#65292;&#35201;&#20808;&#25910;&#25342;&#26700;&#23376;&#19978;&#30340;&#35821;&#25991;&#20070;&#26412;&#12289;&#38050;&#31508;&#65288;&#36825;&#21483;&#20445;&#23384;&#29616;&#22330;&#65289;&#65292;&#28982;&#21518;&#65292;&#25171;&#24320;&#25968;&#23398;&#35838;&#26412;&#12289;&#25214;&#20986;&#22278;&#35268;&#30452;&#23610;&#65288;&#36825;&#21483;&#20934;&#22791;&#26032;&#29615;&#22659;&#65289;&#65292;&#25165;&#33021;&#24320;&#22987;&#20570;&#25968;&#23398;&#20316;&#19994;&#12290;&#25805;&#20316;&#31995;&#32479;&#22312;&#20999;&#25442;&#36827;&#31243;&#25110;&#32773;&#32447;&#31243;&#26102;&#20063;&#26159;&#19968;&#26679;&#30340;&#65292;&#23427;&#38656;&#35201;&#20808;&#20445;&#23384;&#24403;&#21069;&#25191;&#34892;&#30340;&#29616;&#22330;&#29615;&#22659;&#65288;CPU&#23492;&#23384;&#22120;&#29366;&#24577;&#12289;&#20869;&#23384;&#39029;&#31561;&#65289;&#65292;&#28982;&#21518;&#65292;&#25226;&#26032;&#20219;&#21153;&#30340;&#25191;&#34892;&#29615;&#22659;&#20934;&#22791;&#22909;&#65288;&#24674;&#22797;&#19978;&#27425;&#30340;&#23492;&#23384;&#22120;&#29366;&#24577;&#65292;&#20999;&#25442;&#20869;&#23384;&#39029;&#31561;&#65289;&#65292;&#25165;&#33021;&#24320;&#22987;&#25191;&#34892;&#12290;&#36825;&#20010;&#20999;&#25442;&#36807;&#31243;&#34429;&#28982;&#24456;&#24555;&#65292;&#20294;&#26159;&#20063;&#38656;&#35201;&#32791;&#36153;&#26102;&#38388;&#12290;&#22914;&#26524;&#26377;&#20960;&#21315;&#20010;&#20219;&#21153;&#21516;&#26102;&#36827;&#34892;&#65292;&#25805;&#20316;&#31995;&#32479;&#21487;&#33021;&#23601;&#20027;&#35201;&#24537;&#30528;&#20999;&#25442;&#20219;&#21153;&#65292;&#26681;&#26412;&#27809;&#26377;&#22810;&#23569;&#26102;&#38388;&#21435;&#25191;&#34892;&#20219;&#21153;&#20102;&#65292;&#36825;&#31181;&#24773;&#20917;&#26368;&#24120;&#35265;&#30340;&#23601;&#26159;&#30828;&#30424;&#29378;&#21709;&#65292;&#28857;&#31383;&#21475;&#26080;&#21453;&#24212;&#65292;&#31995;&#32479;&#22788;&#20110;&#20551;&#27515;&#29366;&#24577;&#12290;</p>
<p>&#25152;&#20197;&#65292;&#22810;&#20219;&#21153;&#19968;&#26086;&#22810;&#21040;&#19968;&#20010;&#38480;&#24230;&#65292;&#23601;&#20250;&#28040;&#32791;&#25481;&#31995;&#32479;&#25152;&#26377;&#30340;&#36164;&#28304;&#65292;&#32467;&#26524;&#25928;&#29575;&#24613;&#21095;&#19979;&#38477;&#65292;&#25152;&#26377;&#20219;&#21153;&#37117;&#20570;&#19981;&#22909;&#12290; &#35745;&#31639;&#23494;&#38598;&#22411; vs. IO&#23494;&#38598;&#22411;</p>
<p>&#26159;&#21542;&#37319;&#29992;&#22810;&#20219;&#21153;&#30340;&#31532;&#20108;&#20010;&#32771;&#34385;&#26159;&#20219;&#21153;&#30340;&#31867;&#22411;&#12290;&#25105;&#20204;&#21487;&#20197;&#25226;&#20219;&#21153;&#20998;&#20026;&#35745;&#31639;&#23494;&#38598;&#22411;&#21644;IO&#23494;&#38598;&#22411;&#12290;</p>
<p>&#35745;&#31639;&#23494;&#38598;&#22411;&#20219;&#21153;&#30340;&#29305;&#28857;&#26159;&#35201;&#36827;&#34892;&#22823;&#37327;&#30340;&#35745;&#31639;&#65292;&#28040;&#32791;CPU&#36164;&#28304;&#65292;&#27604;&#22914;&#35745;&#31639;&#22278;&#21608;&#29575;&#12289;&#23545;&#35270;&#39057;&#36827;&#34892;&#39640;&#28165;&#35299;&#30721;&#31561;&#31561;&#65292;&#20840;&#38752;CPU&#30340;&#36816;&#31639;&#33021;&#21147;&#12290;&#36825;&#31181;&#35745;&#31639;&#23494;&#38598;&#22411;&#20219;&#21153;&#34429;&#28982;&#20063;&#21487;&#20197;&#29992;&#22810;&#20219;&#21153;&#23436;&#25104;&#65292;&#20294;&#26159;&#20219;&#21153;&#36234;&#22810;&#65292;&#33457;&#22312;&#20219;&#21153;&#20999;&#25442;&#30340;&#26102;&#38388;&#23601;&#36234;&#22810;&#65292;CPU&#25191;&#34892;&#20219;&#21153;&#30340;&#25928;&#29575;&#23601;&#36234;&#20302;&#65292;&#25152;&#20197;&#65292;&#35201;&#26368;&#39640;&#25928;&#22320;&#21033;&#29992;CPU&#65292;&#35745;&#31639;&#23494;&#38598;&#22411;&#20219;&#21153;&#21516;&#26102;&#36827;&#34892;&#30340;&#25968;&#37327;&#24212;&#24403;&#31561;&#20110;CPU&#30340;&#26680;&#24515;&#25968;&#12290;</p>
<p>&#35745;&#31639;&#23494;&#38598;&#22411;&#20219;&#21153;&#30001;&#20110;&#20027;&#35201;&#28040;&#32791;CPU&#36164;&#28304;&#65292;&#22240;&#27492;&#65292;&#20195;&#30721;&#36816;&#34892;&#25928;&#29575;&#33267;&#20851;&#37325;&#35201;&#12290;Python&#36825;&#26679;&#30340;&#33050;&#26412;&#35821;&#35328;&#36816;&#34892;&#25928;&#29575;&#24456;&#20302;&#65292;&#23436;&#20840;&#19981;&#36866;&#21512;&#35745;&#31639;&#23494;&#38598;&#22411;&#20219;&#21153;&#12290;&#23545;&#20110;&#35745;&#31639;&#23494;&#38598;&#22411;&#20219;&#21153;&#65292;&#26368;&#22909;&#29992;C&#35821;&#35328;&#32534;&#20889;&#12290;</p>
<p>&#31532;&#20108;&#31181;&#20219;&#21153;&#30340;&#31867;&#22411;&#26159;IO&#23494;&#38598;&#22411;&#65292;&#28041;&#21450;&#21040;&#32593;&#32476;&#12289;&#30913;&#30424;IO&#30340;&#20219;&#21153;&#37117;&#26159;IO&#23494;&#38598;&#22411;&#20219;&#21153;&#65292;&#36825;&#31867;&#20219;&#21153;&#30340;&#29305;&#28857;&#26159;CPU&#28040;&#32791;&#24456;&#23569;&#65292;&#20219;&#21153;&#30340;&#22823;&#37096;&#20998;&#26102;&#38388;&#37117;&#22312;&#31561;&#24453;IO&#25805;&#20316;&#23436;&#25104;&#65288;&#22240;&#20026;IO&#30340;&#36895;&#24230;&#36828;&#36828;&#20302;&#20110;CPU&#21644;&#20869;&#23384;&#30340;&#36895;&#24230;&#65289;&#12290;&#23545;&#20110;IO&#23494;&#38598;&#22411;&#20219;&#21153;&#65292;&#20219;&#21153;&#36234;&#22810;&#65292;CPU&#25928;&#29575;&#36234;&#39640;&#65292;&#20294;&#20063;&#26377;&#19968;&#20010;&#38480;&#24230;&#12290;&#24120;&#35265;&#30340;&#22823;&#37096;&#20998;&#20219;&#21153;&#37117;&#26159;IO&#23494;&#38598;&#22411;&#20219;&#21153;&#65292;&#27604;&#22914;Web&#24212;&#29992;&#12290;</p>
<p>IO&#23494;&#38598;&#22411;&#20219;&#21153;&#25191;&#34892;&#26399;&#38388;&#65292;99%&#30340;&#26102;&#38388;&#37117;&#33457;&#22312;IO&#19978;&#65292;&#33457;&#22312;CPU&#19978;&#30340;&#26102;&#38388;&#24456;&#23569;&#65292;&#22240;&#27492;&#65292;&#29992;&#36816;&#34892;&#36895;&#24230;&#26497;&#24555;&#30340;C&#35821;&#35328;&#26367;&#25442;&#29992;Python&#36825;&#26679;&#36816;&#34892;&#36895;&#24230;&#26497;&#20302;&#30340;&#33050;&#26412;&#35821;&#35328;&#65292;&#23436;&#20840;&#26080;&#27861;&#25552;&#21319;&#36816;&#34892;&#25928;&#29575;&#12290;&#23545;&#20110;IO&#23494;&#38598;&#22411;&#20219;&#21153;&#65292;&#26368;&#21512;&#36866;&#30340;&#35821;&#35328;&#23601;&#26159;&#24320;&#21457;&#25928;&#29575;&#26368;&#39640;&#65288;&#20195;&#30721;&#37327;&#26368;&#23569;&#65289;&#30340;&#35821;&#35328;&#65292;&#33050;&#26412;&#35821;&#35328;&#26159;&#39318;&#36873;&#65292;C&#35821;&#35328;&#26368;&#24046;&#12290; &#24322;&#27493;IO</p>
<p>&#32771;&#34385;&#21040;CPU&#21644;IO&#20043;&#38388;&#24040;&#22823;&#30340;&#36895;&#24230;&#24046;&#24322;&#65292;&#19968;&#20010;&#20219;&#21153;&#22312;&#25191;&#34892;&#30340;&#36807;&#31243;&#20013;&#22823;&#37096;&#20998;&#26102;&#38388;&#37117;&#22312;&#31561;&#24453;IO&#25805;&#20316;&#65292;&#21333;&#36827;&#31243;&#21333;&#32447;&#31243;&#27169;&#22411;&#20250;&#23548;&#33268;&#21035;&#30340;&#20219;&#21153;&#26080;&#27861;&#24182;&#34892;&#25191;&#34892;&#65292;&#22240;&#27492;&#65292;&#25105;&#20204;&#25165;&#38656;&#35201;&#22810;&#36827;&#31243;&#27169;&#22411;&#25110;&#32773;&#22810;&#32447;&#31243;&#27169;&#22411;&#26469;&#25903;&#25345;&#22810;&#20219;&#21153;&#24182;&#21457;&#25191;&#34892;&#12290;</p>
<p>&#29616;&#20195;&#25805;&#20316;&#31995;&#32479;&#23545;IO&#25805;&#20316;&#24050;&#32463;&#20570;&#20102;&#24040;&#22823;&#30340;&#25913;&#36827;&#65292;&#26368;&#22823;&#30340;&#29305;&#28857;&#23601;&#26159;&#25903;&#25345;&#24322;&#27493;IO&#12290;&#22914;&#26524;&#20805;&#20998;&#21033;&#29992;&#25805;&#20316;&#31995;&#32479;&#25552;&#20379;&#30340;&#24322;&#27493;IO&#25903;&#25345;&#65292;&#23601;&#21487;&#20197;&#29992;&#21333;&#36827;&#31243;&#21333;&#32447;&#31243;&#27169;&#22411;&#26469;&#25191;&#34892;&#22810;&#20219;&#21153;&#65292;&#36825;&#31181;&#20840;&#26032;&#30340;&#27169;&#22411;&#31216;&#20026;&#20107;&#20214;&#39537;&#21160;&#27169;&#22411;&#65292;<code>Nginx</code>&#23601;&#26159;&#25903;&#25345;&#24322;&#27493;<code>IO</code>&#30340;Web&#26381;&#21153;&#22120;&#65292;&#23427;&#22312;&#21333;&#26680;CPU&#19978;&#37319;&#29992;&#21333;&#36827;&#31243;&#27169;&#22411;&#23601;&#21487;&#20197;&#39640;&#25928;&#22320;&#25903;&#25345;&#22810;&#20219;&#21153;&#12290;&#22312;&#22810;&#26680;CPU&#19978;&#65292;&#21487;&#20197;&#36816;&#34892;&#22810;&#20010;&#36827;&#31243;&#65288;&#25968;&#37327;&#19982;CPU&#26680;&#24515;&#25968;&#30456;&#21516;&#65289;&#65292;&#20805;&#20998;&#21033;&#29992;&#22810;&#26680;CPU&#12290;&#30001;&#20110;&#31995;&#32479;&#24635;&#30340;&#36827;&#31243;&#25968;&#37327;&#21313;&#20998;&#26377;&#38480;&#65292;&#22240;&#27492;&#25805;&#20316;&#31995;&#32479;&#35843;&#24230;&#38750;&#24120;&#39640;&#25928;&#12290;&#29992;&#24322;&#27493;IO&#32534;&#31243;&#27169;&#22411;&#26469;&#23454;&#29616;&#22810;&#20219;&#21153;&#26159;&#19968;&#20010;&#20027;&#35201;&#30340;&#36235;&#21183;&#12290;</p>
<p>&#23545;&#24212;&#21040;Python&#35821;&#35328;&#65292;&#21333;&#36827;&#31243;&#30340;&#24322;&#27493;&#32534;&#31243;&#27169;&#22411;&#31216;&#20026;&#21327;&#31243;&#65292;&#26377;&#20102;&#21327;&#31243;&#30340;&#25903;&#25345;&#65292;&#23601;&#21487;&#20197;&#22522;&#20110;&#20107;&#20214;&#39537;&#21160;&#32534;&#20889;&#39640;&#25928;&#30340;&#22810;&#20219;&#21153;&#31243;&#24207;&#12290;&#25105;&#20204;&#20250;&#22312;&#21518;&#38754;&#35752;&#35770;&#22914;&#20309;&#32534;&#20889;&#21327;&#31243;&#12290;</p>
<h3 id="&#20998;&#24067;&#24335;&#36827;&#31243;">13.5 &#20998;&#24067;&#24335;&#36827;&#31243;</h3>
<p>&#22312;<code>Thread</code>&#21644;<code>Process</code>&#20013;&#65292;&#24212;&#24403;&#20248;&#36873;<code>Process</code>&#65292;&#22240;&#20026;<code>Process</code>&#26356;&#31283;&#23450;&#65292;&#32780;&#19988;&#65292;<code>Process</code>&#21487;&#20197;&#20998;&#24067;&#21040;&#22810;&#21488;&#26426;&#22120;&#19978;&#65292;&#32780;<code>Thread</code>&#26368;&#22810;&#21482;&#33021;&#20998;&#24067;&#21040;&#21516;&#19968;&#21488;&#26426;&#22120;&#30340;&#22810;&#20010;CPU&#19978;&#12290;</p>
<p>Python&#30340;<code>multiprocessing</code>&#27169;&#22359;&#19981;&#20294;&#25903;&#25345;&#22810;&#36827;&#31243;&#65292;&#20854;&#20013;<code>managers</code>&#23376;&#27169;&#22359;&#36824;&#25903;&#25345;&#25226;&#22810;&#36827;&#31243;&#20998;&#24067;&#21040;&#22810;&#21488;&#26426;&#22120;&#19978;&#12290;&#19968;&#20010;&#26381;&#21153;&#36827;&#31243;&#21487;&#20197;&#20316;&#20026;&#35843;&#24230;&#32773;&#65292;&#23558;&#20219;&#21153;&#20998;&#24067;&#21040;&#20854;&#20182;&#22810;&#20010;&#36827;&#31243;&#20013;&#65292;&#20381;&#38752;&#32593;&#32476;&#36890;&#20449;&#12290;&#30001;&#20110;<code>managers</code>&#27169;&#22359;&#23553;&#35013;&#24456;&#22909;&#65292;&#19981;&#24517;&#20102;&#35299;&#32593;&#32476;&#36890;&#20449;&#30340;&#32454;&#33410;&#65292;&#23601;&#21487;&#20197;&#24456;&#23481;&#26131;&#22320;&#32534;&#20889;&#20998;&#24067;&#24335;&#22810;&#36827;&#31243;&#31243;&#24207;&#12290;</p>
<p>&#20030;&#20010;&#20363;&#23376;&#65306;&#22914;&#26524;&#25105;&#20204;&#24050;&#32463;&#26377;&#19968;&#20010;&#36890;&#36807;<code>Queue</code>&#36890;&#20449;&#30340;&#22810;&#36827;&#31243;&#31243;&#24207;&#22312;&#21516;&#19968;&#21488;&#26426;&#22120;&#19978;&#36816;&#34892;&#65292;&#29616;&#22312;&#65292;&#30001;&#20110;&#22788;&#29702;&#20219;&#21153;&#30340;&#36827;&#31243;&#20219;&#21153;&#32321;&#37325;&#65292;&#24076;&#26395;&#25226;&#21457;&#36865;&#20219;&#21153;&#30340;&#36827;&#31243;&#21644;&#22788;&#29702;&#20219;&#21153;&#30340;&#36827;&#31243;&#20998;&#24067;&#21040;&#20004;&#21488;&#26426;&#22120;&#19978;&#12290;&#24590;&#20040;&#29992;&#20998;&#24067;&#24335;&#36827;&#31243;&#23454;&#29616;&#65311;</p>
<p>&#21407;&#26377;&#30340;<code>Queue</code>&#21487;&#20197;&#32487;&#32493;&#20351;&#29992;&#65292;&#20294;&#26159;&#65292;&#36890;&#36807;<code>managers</code>&#27169;&#22359;&#25226;<code>Queue</code>&#36890;&#36807;&#32593;&#32476;&#26292;&#38706;&#20986;&#21435;&#65292;&#23601;&#21487;&#20197;&#35753;&#20854;&#20182;&#26426;&#22120;&#30340;&#36827;&#31243;&#35775;&#38382;<code>Queue</code>&#20102;&#12290;</p>
<p>&#25105;&#20204;&#20808;&#30475;&#26381;&#21153;&#36827;&#31243;&#65292;&#26381;&#21153;&#36827;&#31243;&#36127;&#36131;&#21551;&#21160;<code>Queue</code>&#65292;&#25226;<code>Queue</code>&#27880;&#20876;&#21040;&#32593;&#32476;&#19978;&#65292;&#28982;&#21518;&#24448;<code>Queue</code>&#37324;&#38754;&#20889;&#20837;&#20219;&#21153;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="co"># task_master.py</span>

<span class="im">import</span> random, time, queue
<span class="im">from</span> multiprocessing.managers <span class="im">import</span> BaseManager

<span class="co"># &#21457;&#36865;&#20219;&#21153;&#30340;&#38431;&#21015;:</span>
task_queue <span class="op">=</span> queue.Queue()
<span class="co"># &#25509;&#25910;&#32467;&#26524;&#30340;&#38431;&#21015;:</span>
result_queue <span class="op">=</span> queue.Queue()

<span class="co"># &#20174;BaseManager&#32487;&#25215;&#30340;QueueManager:</span>
<span class="kw">class</span> QueueManager(BaseManager):
    <span class="cf">pass</span>

<span class="co"># &#25226;&#20004;&#20010;Queue&#37117;&#27880;&#20876;&#21040;&#32593;&#32476;&#19978;, callable&#21442;&#25968;&#20851;&#32852;&#20102;Queue&#23545;&#35937;:</span>
QueueManager.register(<span class="st">&#39;get_task_queue&#39;</span>, <span class="bu">callable</span><span class="op">=</span><span class="kw">lambda</span>: task_queue)
QueueManager.register(<span class="st">&#39;get_result_queue&#39;</span>, <span class="bu">callable</span><span class="op">=</span><span class="kw">lambda</span>: result_queue)
<span class="co"># &#32465;&#23450;&#31471;&#21475;5000, &#35774;&#32622;&#39564;&#35777;&#30721;&#39;abc&#39;:</span>
manager <span class="op">=</span> QueueManager(address<span class="op">=</span>(<span class="st">&#39;&#39;</span>, <span class="dv">5000</span>), authkey<span class="op">=</span>b<span class="st">&#39;abc&#39;</span>)
<span class="co"># &#21551;&#21160;Queue:</span>
manager.start()
<span class="co"># &#33719;&#24471;&#36890;&#36807;&#32593;&#32476;&#35775;&#38382;&#30340;Queue&#23545;&#35937;:</span>
task <span class="op">=</span> manager.get_task_queue()
result <span class="op">=</span> manager.get_result_queue()
<span class="co"># &#25918;&#20960;&#20010;&#20219;&#21153;&#36827;&#21435;:</span>
<span class="cf">for</span> i <span class="op">in</span> <span class="bu">range</span>(<span class="dv">10</span>):
    n <span class="op">=</span> random.randint(<span class="dv">0</span>, <span class="dv">10000</span>)
    <span class="bu">print</span>(<span class="st">&#39;Put task </span><span class="sc">%d</span><span class="st">...&#39;</span> <span class="op">%</span> n)
    task.put(n)
<span class="co"># &#20174;result&#38431;&#21015;&#35835;&#21462;&#32467;&#26524;:</span>
<span class="bu">print</span>(<span class="st">&#39;Try get results...&#39;</span>)
<span class="cf">for</span> i <span class="op">in</span> <span class="bu">range</span>(<span class="dv">10</span>):
    r <span class="op">=</span> result.get(timeout<span class="op">=</span><span class="dv">10</span>)
    <span class="bu">print</span>(<span class="st">&#39;Result: </span><span class="sc">%s</span><span class="st">&#39;</span> <span class="op">%</span> r)
<span class="co"># &#20851;&#38381;:</span>
manager.shutdown()
<span class="bu">print</span>(<span class="st">&#39;master exit.&#39;</span>)</code></pre></div>
<p>&#35831;&#27880;&#24847;&#65292;&#24403;&#25105;&#20204;&#22312;&#19968;&#21488;&#26426;&#22120;&#19978;&#20889;&#22810;&#36827;&#31243;&#31243;&#24207;&#26102;&#65292;&#21019;&#24314;&#30340;<code>Queue</code>&#21487;&#20197;&#30452;&#25509;&#25343;&#26469;&#29992;&#65292;&#20294;&#26159;&#65292;&#22312;&#20998;&#24067;&#24335;&#22810;&#36827;&#31243;&#29615;&#22659;&#19979;&#65292;&#28155;&#21152;&#20219;&#21153;&#21040;<code>Queue</code>&#19981;&#21487;&#20197;&#30452;&#25509;&#23545;&#21407;&#22987;&#30340;<code>task_queue</code>&#36827;&#34892;&#25805;&#20316;&#65292;&#37027;&#26679;&#23601;&#32469;&#36807;&#20102;<code>QueueManager</code>&#30340;&#23553;&#35013;&#65292;&#24517;&#39035;&#36890;&#36807;<code>manager.get_task_queue()</code>&#33719;&#24471;&#30340;<code>Queue</code>&#25509;&#21475;&#28155;&#21152;&#12290;</p>
<p>&#28982;&#21518;&#65292;&#22312;&#21478;&#19968;&#21488;&#26426;&#22120;&#19978;&#21551;&#21160;&#20219;&#21153;&#36827;&#31243;&#65288;&#26412;&#26426;&#19978;&#21551;&#21160;&#20063;&#21487;&#20197;&#65289;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="co"># task_worker.py</span>

<span class="im">import</span> time, sys, queue
<span class="im">from</span> multiprocessing.managers <span class="im">import</span> BaseManager

<span class="co"># &#21019;&#24314;&#31867;&#20284;&#30340;QueueManager:</span>
<span class="kw">class</span> QueueManager(BaseManager):
    <span class="cf">pass</span>

<span class="co"># &#30001;&#20110;&#36825;&#20010;QueueManager&#21482;&#20174;&#32593;&#32476;&#19978;&#33719;&#21462;Queue&#65292;&#25152;&#20197;&#27880;&#20876;&#26102;&#21482;&#25552;&#20379;&#21517;&#23383;:</span>
QueueManager.register(<span class="st">&#39;get_task_queue&#39;</span>)
QueueManager.register(<span class="st">&#39;get_result_queue&#39;</span>)

<span class="co"># &#36830;&#25509;&#21040;&#26381;&#21153;&#22120;&#65292;&#20063;&#23601;&#26159;&#36816;&#34892;task_master.py&#30340;&#26426;&#22120;:</span>
server_addr <span class="op">=</span> <span class="st">&#39;127.0.0.1&#39;</span>
<span class="bu">print</span>(<span class="st">&#39;Connect to server </span><span class="sc">%s</span><span class="st">...&#39;</span> <span class="op">%</span> server_addr)
<span class="co"># &#31471;&#21475;&#21644;&#39564;&#35777;&#30721;&#27880;&#24847;&#20445;&#25345;&#19982;task_master.py&#35774;&#32622;&#30340;&#23436;&#20840;&#19968;&#33268;:</span>
m <span class="op">=</span> QueueManager(address<span class="op">=</span>(server_addr, <span class="dv">5000</span>), authkey<span class="op">=</span>b<span class="st">&#39;abc&#39;</span>)
<span class="co"># &#20174;&#32593;&#32476;&#36830;&#25509;:</span>
m.<span class="ex">connect</span>()
<span class="co"># &#33719;&#21462;Queue&#30340;&#23545;&#35937;:</span>
task <span class="op">=</span> m.get_task_queue()
result <span class="op">=</span> m.get_result_queue()
<span class="co"># &#20174;task&#38431;&#21015;&#21462;&#20219;&#21153;,&#24182;&#25226;&#32467;&#26524;&#20889;&#20837;result&#38431;&#21015;:</span>
<span class="cf">for</span> i <span class="op">in</span> <span class="bu">range</span>(<span class="dv">10</span>):
    <span class="cf">try</span>:
        n <span class="op">=</span> task.get(timeout<span class="op">=</span><span class="dv">1</span>)
        <span class="bu">print</span>(<span class="st">&#39;run task </span><span class="sc">%d</span><span class="st"> * </span><span class="sc">%d</span><span class="st">...&#39;</span> <span class="op">%</span> (n, n))
        r <span class="op">=</span> <span class="st">&#39;</span><span class="sc">%d</span><span class="st"> * </span><span class="sc">%d</span><span class="st"> = </span><span class="sc">%d</span><span class="st">&#39;</span> <span class="op">%</span> (n, n, n<span class="op">*</span>n)
        time.sleep(<span class="dv">1</span>)
        result.put(r)
    <span class="cf">except</span> Queue.Empty:
        <span class="bu">print</span>(<span class="st">&#39;task queue is empty.&#39;</span>)
<span class="co"># &#22788;&#29702;&#32467;&#26463;:</span>
<span class="bu">print</span>(<span class="st">&#39;worker exit.&#39;</span>)</code></pre></div>
<p>&#20219;&#21153;&#36827;&#31243;&#35201;&#36890;&#36807;&#32593;&#32476;&#36830;&#25509;&#21040;&#26381;&#21153;&#36827;&#31243;&#65292;&#25152;&#20197;&#35201;&#25351;&#23450;&#26381;&#21153;&#36827;&#31243;&#30340;IP&#12290;</p>
<p>&#29616;&#22312;&#65292;&#21487;&#20197;&#35797;&#35797;&#20998;&#24067;&#24335;&#36827;&#31243;&#30340;&#24037;&#20316;&#25928;&#26524;&#20102;&#12290;&#20808;&#21551;&#21160;<code>task_master.py</code>&#26381;&#21153;&#36827;&#31243;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode bash"><code class="sourceCode bash">$ <span class="kw">python3</span> task_master.py 
<span class="kw">Put</span> task 3411...
<span class="kw">Put</span> task 1605...
<span class="kw">Put</span> task 1398...
<span class="kw">Put</span> task 4729...
<span class="kw">Put</span> task 5300...
<span class="kw">Put</span> task 7471...
<span class="kw">Put</span> task 68...
<span class="kw">Put</span> task 4219...
<span class="kw">Put</span> task 339...
<span class="kw">Put</span> task 7866...
<span class="kw">Try</span> get results...</code></pre></div>
<p><code>task_master.py</code>&#36827;&#31243;&#21457;&#36865;&#23436;&#20219;&#21153;&#21518;&#65292;&#24320;&#22987;&#31561;&#24453;result&#38431;&#21015;&#30340;&#32467;&#26524;&#12290;&#29616;&#22312;&#21551;&#21160;<code>task_worker.py</code>&#36827;&#31243;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode bash"><code class="sourceCode bash">$ <span class="kw">python3</span> task_worker.py
<span class="kw">Connect</span> to server 127.0.0.1...
<span class="kw">run</span> task 3411 * 3411...
<span class="kw">run</span> task 1605 * 1605...
<span class="kw">run</span> task 1398 * 1398...
<span class="kw">run</span> task 4729 * 4729...
<span class="kw">run</span> task 5300 * 5300...
<span class="kw">run</span> task 7471 * 7471...
<span class="kw">run</span> task 68 * 68...
<span class="kw">run</span> task 4219 * 4219...
<span class="kw">run</span> task 339 * 339...
<span class="kw">run</span> task 7866 * 7866...
<span class="kw">worker</span> exit.</code></pre></div>
<p><code>task_worker.py</code>&#36827;&#31243;&#32467;&#26463;&#65292;&#22312;<code>task_master.py</code>&#36827;&#31243;&#20013;&#20250;&#32487;&#32493;&#25171;&#21360;&#20986;&#32467;&#26524;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">Result: <span class="dv">3411</span> <span class="op">*</span> <span class="dv">3411</span> <span class="op">=</span> <span class="dv">11634921</span>
Result: <span class="dv">1605</span> <span class="op">*</span> <span class="dv">1605</span> <span class="op">=</span> <span class="dv">2576025</span>
Result: <span class="dv">1398</span> <span class="op">*</span> <span class="dv">1398</span> <span class="op">=</span> <span class="dv">1954404</span>
Result: <span class="dv">4729</span> <span class="op">*</span> <span class="dv">4729</span> <span class="op">=</span> <span class="dv">22363441</span>
Result: <span class="dv">5300</span> <span class="op">*</span> <span class="dv">5300</span> <span class="op">=</span> <span class="dv">28090000</span>
Result: <span class="dv">7471</span> <span class="op">*</span> <span class="dv">7471</span> <span class="op">=</span> <span class="dv">55815841</span>
Result: <span class="dv">68</span> <span class="op">*</span> <span class="dv">68</span> <span class="op">=</span> <span class="dv">4624</span>
Result: <span class="dv">4219</span> <span class="op">*</span> <span class="dv">4219</span> <span class="op">=</span> <span class="dv">17799961</span>
Result: <span class="dv">339</span> <span class="op">*</span> <span class="dv">339</span> <span class="op">=</span> <span class="dv">114921</span>
Result: <span class="dv">7866</span> <span class="op">*</span> <span class="dv">7866</span> <span class="op">=</span> <span class="dv">61873956</span></code></pre></div>
<p>&#36825;&#20010;&#31616;&#21333;&#30340;<code>Master/Worker</code>&#27169;&#22411;&#26377;&#20160;&#20040;&#29992;&#65311;&#20854;&#23454;&#36825;&#23601;&#26159;&#19968;&#20010;&#31616;&#21333;&#20294;&#30495;&#27491;&#30340;&#20998;&#24067;&#24335;&#35745;&#31639;&#65292;&#25226;&#20195;&#30721;&#31245;&#21152;&#25913;&#36896;&#65292;&#21551;&#21160;&#22810;&#20010;<code>worker</code>&#65292;&#23601;&#21487;&#20197;&#25226;&#20219;&#21153;&#20998;&#24067;&#21040;&#20960;&#21488;&#29978;&#33267;&#20960;&#21313;&#21488;&#26426;&#22120;&#19978;&#65292;&#27604;&#22914;&#25226;&#35745;&#31639;<code>n*n</code>&#30340;&#20195;&#30721;&#25442;&#25104;&#21457;&#36865;&#37038;&#20214;&#65292;&#23601;&#23454;&#29616;&#20102;&#37038;&#20214;&#38431;&#21015;&#30340;&#24322;&#27493;&#21457;&#36865;&#12290;</p>
<p><code>Queue</code>&#23545;&#35937;&#23384;&#20648;&#22312;&#21738;&#65311;&#27880;&#24847;&#21040;<code>task_worker.py</code>&#20013;&#26681;&#26412;&#27809;&#26377;&#21019;&#24314;Queue&#30340;&#20195;&#30721;&#65292;&#25152;&#20197;&#65292;<code>Queue</code>&#23545;&#35937;&#23384;&#20648;&#22312;<code>task_master.py</code>&#36827;&#31243;&#20013;&#65306;</p>
<div class="figure">
<img src="http://www.liaoxuefeng.com/files/attachments/001431929951799fda95088b12c48e2bd44b9157b8050c9000/l" alt="" />

</div>
<p>&#32780;<code>Queue</code>&#20043;&#25152;&#20197;&#33021;&#36890;&#36807;&#32593;&#32476;&#35775;&#38382;&#65292;&#23601;&#26159;&#36890;&#36807;<code>QueueManager</code>&#23454;&#29616;&#30340;&#12290;&#30001;&#20110;<code>QueueManager</code>&#31649;&#29702;&#30340;&#19981;&#27490;&#19968;&#20010;<code>Queue</code>&#65292;&#25152;&#20197;&#65292;&#35201;&#32473;&#27599;&#20010;<code>Queue</code>&#30340;&#32593;&#32476;&#35843;&#29992;&#25509;&#21475;&#36215;&#20010;&#21517;&#23383;&#65292;&#27604;&#22914;<code>get_task_queue</code>&#12290;</p>
<p><code>authkey</code>&#26377;&#20160;&#20040;&#29992;&#65311;&#36825;&#26159;&#20026;&#20102;&#20445;&#35777;&#20004;&#21488;&#26426;&#22120;&#27491;&#24120;&#36890;&#20449;&#65292;&#19981;&#34987;&#20854;&#20182;&#26426;&#22120;&#24694;&#24847;&#24178;&#25200;&#12290;&#22914;&#26524;<code>task_worker.py</code>&#30340;<code>authkey</code>&#21644;<code>task_master.py</code>&#30340;<code>authkey</code>&#19981;&#19968;&#33268;&#65292;&#32943;&#23450;&#36830;&#25509;&#19981;&#19978;&#12290;</p>
<h4 id="&#23567;&#32467;-4">&#23567;&#32467;</h4>
<p>Python&#30340;&#20998;&#24067;&#24335;&#36827;&#31243;&#25509;&#21475;&#31616;&#21333;&#65292;&#23553;&#35013;&#33391;&#22909;&#65292;&#36866;&#21512;&#38656;&#35201;&#25226;&#32321;&#37325;&#20219;&#21153;&#20998;&#24067;&#21040;&#22810;&#21488;&#26426;&#22120;&#30340;&#29615;&#22659;&#19979;&#12290;</p>
<p>&#27880;&#24847;: <code>Queue</code>&#30340;&#20316;&#29992;&#26159;&#29992;&#26469;&#20256;&#36882;&#20219;&#21153;&#21644;&#25509;&#25910;&#32467;&#26524;&#65292;&#27599;&#20010;&#20219;&#21153;&#30340;&#25551;&#36848;&#25968;&#25454;&#37327;&#35201;&#23613;&#37327;&#23567;&#12290;&#27604;&#22914;&#21457;&#36865;&#19968;&#20010;&#22788;&#29702;&#26085;&#24535;&#25991;&#20214;&#30340;&#20219;&#21153;&#65292;&#23601;&#19981;&#35201;&#21457;&#36865;&#20960;&#30334;&#20806;&#30340;&#26085;&#24535;&#25991;&#20214;&#26412;&#36523;&#65292;&#32780;&#26159;&#21457;&#36865;&#26085;&#24535;&#25991;&#20214;&#23384;&#25918;&#30340;&#23436;&#25972;&#36335;&#24452;&#65292;&#30001;<code>Worker</code>&#36827;&#31243;&#20877;&#21435;&#20849;&#20139;&#30340;&#30913;&#30424;&#19978;&#35835;&#21462;&#25991;&#20214;&#12290;</p>
</body>
</html>
