<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <link rel="stylesheet" href="book.css" type="text/css" />
</head>
<body>
<h2 id="&#24320;&#32963;&#33756;">1. &#24320;&#32963;&#33756;</h2>
<p>&#22914;&#26524;&#20320;&#35201;&#29992;&#35745;&#31639;&#26426;&#20570;&#24456;&#22810;&#24037;&#20316;&#65292;&#26368;&#32456;&#20320;&#21457;&#29616;&#26159;&#26377;&#19968;&#20123;&#24744;&#24076;&#26395;&#33258;&#21160;&#25191;&#34892;&#30340;&#20219;&#21153;&#12290;&#20363;&#22914;&#65292;&#20320;&#21487;&#33021;&#24076;&#26395;&#23545;&#22823;&#37327;&#30340;&#25991;&#26412;&#30340;&#25991;&#20214;&#25191;&#34892;&#25628;&#32034;&#21644;&#26367;&#25442;&#65292;&#25110;&#20197;&#22797;&#26434;&#30340;&#26041;&#24335;&#37325;&#21629;&#21517;&#24182;&#37325;&#26032;&#25490;&#21015;&#19968;&#22534;&#29031;&#29255;&#25991;&#20214;&#12290;&#20063;&#35768;&#20320;&#24819;&#20889;&#19968;&#20010;&#23567;&#30340;&#33258;&#23450;&#20041;&#25968;&#25454;&#24211;&#65292;&#25110;&#19968;&#20010;&#19987;&#38376;&#30340; GUI &#24212;&#29992;&#31243;&#24207;&#25110;&#19968;&#20010;&#31616;&#21333;&#30340;&#28216;&#25103;&#12290;</p>
<p>&#22914;&#26524;&#20320;&#26159;&#19968;&#20010;&#19987;&#19994;&#30340;&#36719;&#20214;&#24320;&#21457;&#20154;&#21592;&#65292;&#24744;&#21487;&#33021;&#24517;&#39035;&#20351;&#29992;&#20960;&#20010; C/C++ /Java &#24211;&#65292;&#20294;&#21457;&#29616;&#36890;&#24120;&#30340;&#32534;&#20889;/&#32534;&#35793;/&#27979;&#35797;/&#37325;&#26032;&#32534;&#35793;&#21608;&#26399;&#22826;&#24930;&#12290;&#20063;&#35768;&#20320;&#35201;&#20889;&#36825;&#26679;&#30340;&#24211;&#20013;&#30340;&#27979;&#35797;&#22871;&#20214;&#65292;&#28982;&#21518;&#21457;&#29616;&#32534;&#20889;&#27979;&#35797;&#20195;&#30721;&#26159;&#24456;&#20047;&#21619;&#30340;&#24037;&#20316;&#12290;&#25110;&#20063;&#35768;&#24744;&#32534;&#20889;&#20102;&#19968;&#20010;&#31243;&#24207;&#65292;&#23427;&#21487;&#20197;&#20351;&#29992;&#19968;&#31181;&#25193;&#23637;&#35821;&#35328;&#65292;&#20294;&#20320;&#19981;&#24819;&#20026;&#24744;&#30340;&#24212;&#29992;&#31243;&#24207;&#26469;&#35774;&#35745;&#19982;&#23454;&#29616;&#19968;&#20010;&#23436;&#25972;&#30340;&#26032;&#35821;&#35328;&#12290;</p>
<p>Python &#27491;&#26159;&#36825;&#26679;&#20026;&#20320;&#20934;&#22791;&#30340;&#35821;&#35328;&#12290;</p>
<p>&#20320;&#21487;&#20197;&#20026;&#20854;&#20013;&#19968;&#20123;&#20219;&#21153;&#20889;&#19968;&#20010; Unix shell &#33050;&#26412;&#25110; Windows &#25209;&#22788;&#29702;&#25991;&#20214;&#65292;&#20294;&#26159; shell &#33050;&#26412;&#26368;&#36866;&#21512;&#22788;&#29702;&#25991;&#20214;&#31227;&#21160;&#21644;&#25991;&#26412;&#32534;&#36753;&#65292;&#32780;&#19981;&#36866;&#29992;&#20110; GUI &#24212;&#29992;&#31243;&#24207;&#21644;&#28216;&#25103;&#12290;&#20320;&#21487;&#20197;&#20889;&#19968;&#20010; C/C++/Java &#31243;&#24207;&#65292;&#20294;&#26159;&#29978;&#33267;&#31243;&#24207;&#30340;&#31532;&#19968;&#20010;&#21021;&#31295;&#37117;&#21487;&#33021;&#33457;&#36153;&#22823;&#37327;&#30340;&#24320;&#21457;&#26102;&#38388;&#12290;Python &#26356;&#31616;&#21333;&#26131;&#29992;&#65292; &#21487;&#29992;&#20110; Windows&#12289; Mac OS X &#21644; Unix &#25805;&#20316;&#31995;&#32479;&#65292;&#24182;&#23558;&#24110;&#21161;&#24744;&#26356;&#24555;&#22320;&#23436;&#25104;&#24037;&#20316;&#12290;</p>
<p>Python &#20351;&#29992;&#24456;&#31616;&#21333;&#65292;&#20294;&#23427;&#26159;&#19968;&#20010;&#30495;&#27491;&#30340;&#32534;&#31243;&#35821;&#35328;&#65292;&#27604; shell &#33050;&#26412;&#25110;&#25209;&#22788;&#29702;&#25991;&#20214;&#23545;&#20110;&#22823;&#22411;&#30340;&#31243;&#24207;&#25552;&#20379;&#26356;&#22810;&#30340;&#32467;&#26500;&#21644;&#25903;&#25345;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;Python &#36824;&#25552;&#20379;&#20102;&#27604; C &#26356;&#22810;&#30340;&#38169;&#35823;&#26816;&#26597;&#65292;&#24182;&#19988;&#65292;&#20316;&#20026;&#19968;&#31181;&#39640;&#32423;&#35821;&#35328;&#65292;&#23427;&#26377;&#20869;&#32622;&#30340;&#39640;&#32423;&#25968;&#25454;&#31867;&#22411;&#65292;&#27604;&#22914;&#28789;&#27963;&#30340;&#25968;&#32452;&#21644;&#23383;&#20856;&#12290;&#22240;&#20026;&#20854;&#26356;&#21152;&#19968;&#33324;&#30340;&#25968;&#25454;&#31867;&#22411;&#65292; Python &#27604; Awk &#29978;&#33267; Perl &#36866;&#29992;&#20110;&#24456;&#22810;&#26356;&#22823;&#30340;&#38382;&#39064;&#39046;&#22495;&#65292;&#32780;&#19988;&#24456;&#22810;&#20107;&#24773;&#22312; Python &#20013;&#33267;&#23569;&#21644;&#37027;&#20123;&#35821;&#35328;&#19968;&#26679;&#23481;&#26131;&#12290;</p>
<p>Python &#20801;&#35768;&#24744;&#23558;&#24744;&#30340;&#31243;&#24207;&#25286;&#20998;&#25104;&#21487;&#20197;&#22312;&#20854;&#20182; Python &#31243;&#24207;&#20013;&#37325;&#22797;&#20351;&#29992;&#30340;&#27169;&#22359;&#12290;&#23427;&#25317;&#26377;&#22823;&#37327;&#30340;&#26631;&#20934;&#27169;&#22359;&#65292;&#20320;&#21487;&#20197;&#23558;&#20854;&#29992;&#20316;&#20320;&#30340;&#31243;&#24207;&#30340;&#22522;&#30784; &#8212; &#25110;&#32773;&#20316;&#20026;&#23398;&#20064; Python &#32534;&#31243;&#30340;&#31034;&#20363;&#12290;&#36825;&#20123;&#27169;&#22359;&#25552;&#20379;&#35832;&#22914;&#25991;&#20214; I/O&#12289; &#31995;&#32479;&#35843;&#29992;&#12289; &#22871;&#25509;&#23383;&#21644;&#29978;&#33267;&#29992;&#25143;&#22270;&#24418;&#30028;&#38754;&#25509;&#21475;&#65292;&#20363;&#22914;Tk&#12290;</p>
<p>Python &#26159;&#19968;&#38376;&#35299;&#37322;&#24615;&#30340;&#35821;&#35328;&#65292;&#22240;&#20026;&#27809;&#26377;&#32534;&#35793;&#21644;&#38142;&#25509;&#65292;&#23427;&#21487;&#20197;&#33410;&#30465;&#20320;&#31243;&#24207;&#24320;&#21457;&#36807;&#31243;&#20013;&#30340;&#22823;&#37327;&#26102;&#38388;&#12290;Python &#35299;&#37322;&#22120;&#21487;&#20197;&#20132;&#20114;&#22320;&#20351;&#29992;&#65292;&#36825;&#20351;&#24471;&#35797;&#39564;Python&#35821;&#35328;&#30340;&#29305;&#24615;&#12289;&#32534;&#20889;&#29992;&#21518;&#21363;&#25172;&#30340;&#31243;&#24207;&#25110;&#22312;&#33258;&#24213;&#21521;&#19978;&#30340;&#31243;&#24207;&#24320;&#21457;&#20013;&#27979;&#35797;&#21151;&#33021;&#38750;&#24120;&#23481;&#26131;&#12290;&#23427;&#20063;&#26159;&#19968;&#20010;&#26041;&#20415;&#30340;&#26700;&#38754;&#35745;&#31639;&#22120;&#12290;</p>
<p>Python &#20351;&#31243;&#24207;&#32534;&#20889;&#36215;&#26469;&#33021;&#22815;&#32039;&#20945;&#21644;&#21487;&#35835;&#12290;&#32534;&#20889;&#30340; Python &#31243;&#24207;&#36890;&#24120;&#27604;&#31561;&#20215;&#30340; C&#12289;C++&#25110;Java &#31243;&#24207;&#30701;&#24456;&#22810;&#65292;&#21407;&#22240;&#26377;&#20960;&#20010;&#65306;</p>
<pre><code>1. &#39640;&#32423;&#25968;&#25454;&#31867;&#22411;&#20801;&#35768;&#24744;&#22312;&#21333;&#20010;&#35821;&#21477;&#20013;&#26469;&#34920;&#36798;&#22797;&#26434;&#30340;&#25805;&#20316;&#65307;
2. &#35821;&#21477;&#20998;&#32452;&#26159;&#36890;&#36807;&#32553;&#36827;&#65292;&#32780;&#19981;&#26159;&#24320;&#22987;&#21644;&#32467;&#26463;&#30340;&#25324;&#21495; &#65307;
3. &#20219;&#20309;&#21464;&#37327;&#25110;&#21442;&#25968;&#30340;&#22768;&#26126;&#19981;&#26159;&#24517;&#35201;&#30340;&#12290;</code></pre>
<p>Python &#26159;&#21487;&#25193;&#23637;&#30340;: &#22914;&#26524;&#20320;&#30693;&#36947;&#22914;&#20309;&#29992;C&#32534;&#31243;&#65292;&#37027;&#20040;&#23558;&#24456;&#23481;&#26131;&#28155;&#21152;&#19968;&#20010;&#26032;&#30340;&#20869;&#32622;&#20989;&#25968;&#25110;&#27169;&#22359;&#21040;&#35299;&#37322;&#22120;&#20013;&#65292;&#35201;&#20040;&#20026;&#20102;&#20197;&#26368;&#24555;&#30340;&#36895;&#24230;&#25191;&#34892;&#20851;&#38190;&#30340;&#25805;&#20316;&#65292;&#35201;&#20040;&#20026;&#20102;&#23558; Python &#31243;&#24207;&#19982;&#21482;&#26377;&#20108;&#36827;&#21046;&#24418;&#24335;&#30340;&#24211;&#65288;&#22914;&#29305;&#23450;&#20379;&#24212;&#21830;&#25552;&#20379;&#30340;&#22270;&#24418;&#24211;&#65289;&#38142;&#25509;&#36215;&#26469;&#12290;&#19968;&#26086;&#20320;&#30495;&#30340;&#30528;&#36855;&#65292;&#20320;&#21487;&#20197;&#25226; Python &#35299;&#37322;&#22120;&#38142;&#25509;&#21040; C &#32534;&#20889;&#30340;&#24212;&#29992;&#31243;&#24207;&#20013;&#65292;&#24182;&#25226;&#23427;&#24403;&#20316;&#37027;&#20010;&#31243;&#24207;&#30340;&#25193;&#23637;&#25110;&#21629;&#20196;&#34892;&#35821;&#35328;&#12290;</p>
<p>&#39034;&#20415;&#35828;&#19968;&#21477;&#65292;Python &#35821;&#35328;&#30340;&#21517;&#23383;&#26469;&#33258;&#20110;BBC &#30340; &#8220;Monty Python's Flying Circus&#8221; &#33410;&#30446;&#65292;&#19982;&#29228;&#34892;&#21160;&#29289;&#26080;&#20851;&#12290;&#25105;&#20204;&#20801;&#35768;&#29978;&#33267;&#40723;&#21169;&#22312;&#25991;&#26723;&#20013;&#24341;&#29992;Monty Python &#30701;&#21095;&#65281;</p>
<p>&#26082;&#28982;&#29616;&#22312;&#20320;&#20204;&#37117;&#20026; Python &#24863;&#21040;&#20852;&#22859;&#65292;&#20320;&#20204;&#19968;&#23450;&#20250;&#24819;&#26356;&#21152;&#35814;&#32454;&#22320;&#30740;&#31350;&#23427;&#12290;&#23398;&#20064;&#19968;&#38376;&#35821;&#35328;&#26368;&#22909;&#30340;&#26041;&#27861;&#23601;&#26159;&#20351;&#29992;&#23427;&#65292;&#26412;&#25945;&#31243;&#25512;&#33616;&#20320;&#36793;&#35835;&#36793;&#20351;&#29992; Python &#35299;&#37322;&#22120;&#32451;&#20064;&#12290;</p>
<p>&#22312;&#19979;&#19968;&#31456;&#20013;&#65292;&#25105;&#20204;&#23558;&#35299;&#37322; Python &#35299;&#37322;&#22120;&#30340;&#29992;&#27861;&#12290;&#36825;&#26159;&#24456;&#31616;&#21333;&#30340;&#19968;&#20214;&#20107;&#24773;&#65292;&#20294;&#23427;&#26377;&#21161;&#20110;&#35797;&#39564;&#21518;&#38754;&#30340;&#20363;&#23376;</p>
<p>&#26412;&#25945;&#31243;&#30340;&#20854;&#20313;&#37096;&#20998;&#36890;&#36807;&#23454;&#20363;&#20171;&#32461;&#20102; Python &#35821;&#35328;&#21644;&#20307;&#31995;&#30340;&#21508;&#31181;&#29305;&#24615;&#65292;&#20197;&#31616;&#21333;&#30340;&#34920;&#36798;&#24335;&#12289; &#35821;&#21477;&#21644;&#25968;&#25454;&#31867;&#22411;&#24320;&#22987;&#65292;&#28982;&#21518;&#26159; &#20989;&#25968;&#21644;&#27169;&#22359;&#65292;&#26368;&#21518;&#35762;&#36848;&#39640;&#32423;&#27010;&#24565;&#65292;&#22914;&#24322;&#24120;&#21644;&#29992;&#25143;&#33258;&#23450;&#20041;&#30340;&#31867;&#12290;</p>
</body>
</html>
