<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <link rel="stylesheet" href="book.css" type="text/css" />
</head>
<body>
<h2 id="python&#35299;&#37322;&#22120;">2. Python&#35299;&#37322;&#22120;</h2>
<h3 id="&#35843;&#29992;&#35299;&#37322;&#22120;">2.1 &#35843;&#29992;&#35299;&#37322;&#22120;</h3>
<p>Python &#35299;&#37322;&#22120;&#22312;&#21487;&#29992;&#30340;&#26426;&#22120;&#19978;&#36890;&#24120;&#23433;&#35013;&#25104;/usr/local/bin/python3.4&#65307;&#23558;/usr/local/bin&#28155;&#21152;&#21040;shell&#30340;&#29615;&#22659;&#21464;&#37327;&#20013;&#21435;&#65292;&#23601;&#21487;&#38190;&#20837;&#21629;&#20196;&quot;<code>python3.4</code>&quot;&#21551;&#21160;Python&#12290;</p>
<p>&#22312;Windows&#26426;&#22120;&#19978;&#65292;Python&#30340;&#23433;&#35013;&#20301;&#32622;&#36890;&#24120;&#26159;C:\Python3&#65292;&#23558;&#20854;&#28155;&#21152;&#21040;&#36335;&#24452;&#30340;&#26041;&#27861;&#26159;&#65306;</p>
<pre><code>set path=%path%;C:\python34</code></pre>
<p>&#36864;&#20986;Python&#35299;&#37322;&#22120;&#30340;&#26041;&#27861;&#26159;C-d(Unix)/C-z(Windows)&#65292;&#20351;&#24471;&#35813;&#35299;&#37322;&#22120;&#20197;&#38646;&#36864;&#20986;&#29366;&#24577;&#36864;&#20986;&#12290;&#22914;&#26080;&#27861;&#24037;&#20316;&#21487;&#38190;&#20837;&#21629;&#20196;<code>quit()</code>&#36864;&#20986;&#35299;&#37322;&#22120;&#12290;</p>
<p>&#32534;&#36753;&#22120;&#30340;&#34892;&#32534;&#36753;&#21151;&#33021;&#21253;&#25324;&#20132;&#20114;&#24335;&#32534;&#36753;&#65292;&#21382;&#21490;&#35760;&#24405;&#21644;&#20195;&#30721;&#34917;&#20840;&#65292;&#20854;&#20013;&#20195;&#30721;&#34917;&#20840;&#21151;&#33021;&#38656;&#35201;&#31995;&#32479;&#25903;&#25345;readline&#24211;&#12290;&#20063;&#35768;&#26368;&#24555;&#30340;&#26816;&#26597;&#65292;&#30475;&#30475;&#26159;&#21542;&#25903;&#25345;&#21629;&#20196;&#34892;&#32534;&#36753;&#23545;&#20320;&#30340;&#31532;&#19968;&#20010; Python &#25552;&#31034;Ctrl-P&#12290;&#22914;&#26524;&#23427;&#21457;&#20986;&#34562;&#40483;&#22768;&#65292;&#21017;&#26377;&#21629;&#20196;&#34892;&#32534;&#36753; &#65307;&#35831;&#21442;&#38405;&#38468;&#24405;&#20132;&#20114;&#24335;&#36755;&#20837;&#32534;&#36753;&#21644;&#21382;&#21490;&#26367;&#20195; &#30340;&#26377;&#20851;&#24555;&#25463;&#38190;&#30340;&#20171;&#32461;&#12290;&#22914;&#26524;&#20160;&#20040;&#37117;&#27809;&#21457;&#29983;&#65292;&#25110;&#32773;&#26174;&#31034;^ P&#65292;&#21629;&#20196;&#34892;&#32534;&#36753;&#19981;&#21487;&#29992; &#65307;&#20320;&#23601;&#21482;&#33021;&#22815;&#20351;&#29992;&#36864;&#26684;&#38190;&#21024;&#38500;&#24403;&#21069;&#34892;&#20013;&#30340;&#23383;&#31526;&#12290;</p>
<p>&#35299;&#37322;&#22120;&#26377;&#20123;&#20687; Unix shell&#65306;&#24403;&#20351;&#29992;tty&#35774;&#22791;&#20316;&#20026;&#26631;&#20934;&#36755;&#20837;&#35843;&#29992;&#26102;&#65292;&#23427;&#20132;&#20114;&#22320;&#35835;&#21462;&#24182;&#25191;&#34892;&#21629;&#20196; &#65307;&#24403;&#29992;&#25991;&#20214;&#21517;&#21442;&#25968;&#25110;&#25991;&#20214;&#20316;&#20026;&#26631;&#20934;&#36755;&#20837;&#35843;&#29992;&#65292;&#23427;&#23558;&#35835;&#21462;&#24182;&#25191;&#34892;&#35813;&#25991;&#20214;&#20013;&#30340;&#33050;&#26412;&#12290;</p>
<p>&#31532;&#20108;&#31181;&#21551;&#21160;&#35299;&#37322;&#22120;&#30340;&#26041;&#24335;&#26159;python -c command [arg] ...&#65292;&#36825;&#31181;&#26041;&#24335;&#26159;&#22312;command&#20013;&#25191;&#34892;&#35821;&#21477;&#65292;&#31867;&#20284;&#20110; shell &#30340;-c&#36873;&#39033;&#20013;&#12290;&#22240;&#20026; Python &#35821;&#21477;&#32463;&#24120;&#21253;&#21547;&#31354;&#26684;&#25110;&#20854;&#20182;shell &#29305;&#27530;&#23383;&#31526;&#65292;&#36890;&#24120;&#24314;&#35758;&#25226;&#20840;&#37096;&#21629;&#20196;&#25918;&#22312;&#21333;&#24341;&#21495;&#37324;&#12290;</p>
<p>&#26377;&#20123; Python &#27169;&#22359;&#21516;&#26102;&#20063;&#26159;&#21487;&#25191;&#34892;&#30340;&#33050;&#26412;&#12290;&#36825;&#20123;&#27169;&#22359;&#21487;&#20197;&#20351;&#29992;python -m module [arg] ......&#30452;&#25509;&#35843;&#29992;&#65292;&#36825;&#21644;&#22312;&#21629;&#20196;&#34892;&#36755;&#20837;&#23436;&#25972;&#30340;&#36335;&#24452;&#21517;&#25191;&#34892;&#27169;&#22359; &#30340;&#28304;&#25991;&#20214;&#26159;&#19968;&#26679;&#30340;&#12290;</p>
<p>&#24403;&#20351;&#29992;&#19968;&#20010;&#33050;&#26412;&#25991;&#20214;&#26102;&#65292;&#36816;&#34892;&#35813;&#33050;&#26412;&#20043;&#21518;&#36827;&#20837;&#20132;&#20114;&#27169;&#24335;&#65292;&#26377;&#26102;&#26159;&#24456;&#26377;&#29992;&#30340;&#12290;&#36825;&#21487;&#20197;&#36890;&#36807;&#22312;&#33050;&#26412;&#21069;&#38754;&#21152;&#19978;-i &#36873;&#39033;&#23454;&#29616;&#12290;</p>
<p>All command line options are described in Command line and environment.</p>
<h4 id="&#21442;&#25968;&#20256;&#36882;">2.1.1 &#21442;&#25968;&#20256;&#36882;</h4>
<p>&#35843;&#29992;&#35299;&#37322;&#22120;&#26102;&#33050;&#26412;&#21517;&#31216;&#21644;&#20854;&#20182;&#21442;&#25968;&#34987;&#36716;&#25442;&#25104;&#19968;&#20010;&#23383;&#31526;&#20018;&#21015;&#34920;&#24182;&#36171;&#20540;&#32473;<code>sys</code>&#27169;&#22359;&#20013;&#30340;<code>argv</code>&#21464;&#37327;&#65292;&#21487;&#20197;&#36890;&#36807;<code>import sys</code>&#35775;&#38382;&#27492;&#21015;&#34920;&#12290;&#35813;&#21015;&#34920;&#30340;&#38271;&#24230;&#33267;&#23569;&#20026;1,&#65307;&#22914;&#27809;&#26377;&#32473;&#20986;&#33050;&#26412;&#30340;&#21442;&#25968;&#65292;<code>sys.argv[0]</code>&#23601;&#26159;&#19968;&#20010;&#31354;&#23383;&#31526;&#20018;&#12290;&#24403;&#20351;&#29992;<code>-c</code>&#21629;&#20196;&#26102;&#65292;<code>sys.argv[0]</code>&#35774;&#32622;&#20026;<code>-c</code>&#12290;&#24403;&#20351;&#29992;<code>-m</code>&#27169;&#22359;&#21442;&#25968;&#26102;&#65292;<code>sys.argv[0]</code>&#34987;&#35774;&#23450;&#20026;&#25351;&#23450;&#27169;&#22359;&#30340;&#20840;&#21517;&#12290;<code>-c</code>&#36873;&#39033;&#25110;<code>-m</code>&#36873;&#39033;&#21518;&#38754;&#30340;&#36873;&#39033;&#19981;&#20250;&#34987;Python&#35299;&#37322;&#22120;&#22788;&#29702;&#65292;&#20294;&#20250;&#20445;&#23384;&#22312;<code>sys.argv</code>&#20013;&#65292;&#20379;&#21629;&#20196;&#25110;&#27169;&#22359;&#20351;&#29992;&#12290;</p>
<h4 id="&#20132;&#20114;&#27169;&#24335;">2.1.2 &#20132;&#20114;&#27169;&#24335;</h4>
<p>&#24403;&#20174;tty&#35835;&#21462;&#21629;&#20196;&#26102;&#65292;&#35299;&#37322;&#22120;&#22312;<strong>&#20132;&#20114;&#27169;&#24335;</strong>&#19979;&#12290;&#27492;&#26102;&#65292;&#35299;&#37322;&#22120;&#20197;<strong>&#20027;&#25552;&#31034;&#31526;</strong>&#25552;&#31034;&#36755;&#20837;&#21629;&#20196;&#65292;&#20027;&#25552;&#31034;&#31526;&#36890;&#24120;&#26631;&#35782;&#20026;&#19977;&#20010;&#22823;&#20110;&#21495;&#65306;<code>&gt;&gt;&gt;</code>;&#22914;&#26377;&#32493;&#34892;&#65292;&#35299;&#37322;&#22120;&#20197;<strong>&#20174;&#25552;&#31034;&#31526;</strong>&#25552;&#31034;&#36755;&#20837;&#65292;&#40664;&#35748;&#20026;&#19977;&#20010;&#28857;&#65306;<code>...</code>&#12290;</p>
<p>&#36755;&#20837;&#22810;&#34892;&#32467;&#26500;&#26102;&#38656;&#35201;&#32493;&#34892;&#65292;&#20363;&#22914;<code>if</code>&#35821;&#21477;&#65306;</p>
<pre class="{python}"><code>&gt;&gt;&gt; the_world_is_flat = True
&gt;&gt;&gt; if the_world_is_flat:
...     print (&quot;Be careful not to fall off!&quot;)
...
Be careful not to fall off!</code></pre>
<h3 id="&#35299;&#37322;&#22120;&#21450;&#20854;&#29615;&#22659;">2.2 &#35299;&#37322;&#22120;&#21450;&#20854;&#29615;&#22659;</h3>
<h4 id="&#28304;&#31243;&#24207;&#30340;&#32534;&#30721;">2.2.1 &#28304;&#31243;&#24207;&#30340;&#32534;&#30721;</h4>
<p>Python&#28304;&#25991;&#20214;&#40664;&#35748;&#20197;UTF-8&#32534;&#30721;&#12290;&#22312;&#36825;&#31181;&#32534;&#30721;&#19979;&#65292;&#19990;&#30028;&#19978;&#22823;&#22810;&#25968;&#35821;&#35328;&#30340;&#23383;&#31526;&#21487;&#20197;&#22312;&#23383;&#31526;&#20018;&#65292;&#26631;&#35782;&#31526;&#21644;&#27880;&#37322;&#20013;&#21516;&#26102;&#20351;&#29992; &#8212; &#23613;&#31649;&#26631;&#20934;&#24211;&#20013;&#30340;&#26631;&#35782;&#31526;&#21482;&#20351;&#29992;ASCII&#23383;&#31526;&#65292;&#23427;&#26159;&#21487;&#31227;&#26893;&#20195;&#30721;&#24212;&#35813;&#36981;&#24490;&#30340;&#19968;&#20010;&#24815;&#20363;&#12290;&#20026;&#20102;&#33021;&#22815;&#27491;&#30830;&#26174;&#31034;&#25152;&#26377;&#30340;&#36825;&#20123;&#23383;&#31526;&#65292;&#20320;&#30340;&#32534;&#36753;&#22120;&#24517;&#39035;&#33021;&#22815;&#35782;&#21035;&#25991;&#20214;&#26159;UTF-8&#32534;&#30721;&#65292;&#19988;&#24517;&#39035;&#20351;&#29992;&#25903;&#25345;&#25991;&#20214;&#20013;&#25152;&#26377;&#23383;&#31526;&#30340;&#23383;&#20307;&#12290;</p>
<p>&#20063;&#21487;&#20197;&#32473;&#28304;&#25991;&#20214;&#25351;&#23450;&#19968;&#20010;&#19981;&#21516;&#30340;&#32534;&#30721;&#12290;&#26041;&#27861;&#26159;&#22312; #! &#34892;&#30340;&#21518;&#38754;&#20877;&#22686;&#21152;&#19968;&#34892;&#29305;&#27530;&#30340;&#27880;&#37322;&#26469;&#23450;&#20041;&#28304;&#25991;&#20214;&#30340;&#32534;&#30721;&#65306;</p>
<pre><code># -*- coding: encoding -*-</code></pre>
<p>&#36890;&#36807;&#27492;&#22768;&#26126;&#65292;&#28304;&#25991;&#20214;&#20013;&#30340;&#25152;&#26377;&#23383;&#31526;&#23558;&#30001;encoding&#32780;&#19981;&#26159;UTF-8&#32534;&#30721;&#12290;</p>
</body>
</html>
