<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <link rel="stylesheet" href="book.css" type="text/css" />
</head>
<body>
<h2 id="python&#31616;&#20171;">3. Python&#31616;&#20171;</h2>
<p>&#20197;&#19979;&#31034;&#20363;&#20013;&#65292;&#36755;&#20837;&#21644;&#36755;&#20986;&#27809;&#26377;&#20197;&#25552;&#31034;&#31526;&#36827;&#34892;&#21306;&#20998;&#65292;&#27809;&#26377;&#25552;&#31034;&#31526;&#24320;&#22836;&#30340;&#26159;&#35299;&#37322;&#22120;&#30340;&#36755;&#20986;&#12290;&#27880;&#24847;&#31034;&#20363;&#20013;&#20986;&#29616;&#20174;&#25552;&#31034;&#31526;&#24847;&#21619;&#30528;&#20320;&#19968;&#23450;&#35201;&#22312;&#26368;&#21518;&#21152;&#19978;&#19968;&#20010;&#31354;&#34892;&#65307;&#36825;&#29992;&#20110;&#32467;&#26463;&#19968;&#20010;&#22810;&#34892;&#21629;&#20196;&#12290;</p>
<p>&#26412;&#25163;&#20876;&#20013;&#30340;&#24456;&#22810;&#31034;&#20363;&#65292;&#29978;&#33267;&#22312;&#20132;&#20114;&#26041;&#24335;&#19979;&#36755;&#20837;&#30340;&#31034;&#20363;&#65292;&#37117;&#24102;&#26377;&#27880;&#37322;&#12290;Python &#20013;&#30340;&#27880;&#37322;&#20197;&#8220;&#20117;&#21495;&#8221;&#65292; #&#65292;&#24320;&#22987;&#65292;&#30452;&#33267;&#23454;&#38469;&#30340;&#34892;&#23614;&#12290;&#27880;&#37322;&#21487;&#20197;&#20174;&#34892;&#39318;&#24320;&#22987;&#65292;&#20063;&#21487;&#20197;&#36319;&#22312;&#31354;&#30333;&#25110;&#20195;&#30721;&#20043;&#21518;&#65292;&#20294;&#19981;&#33021;&#21253;&#21547;&#22312;&#23383;&#31526;&#20018;&#23383;&#38754;&#37327;&#20013;&#12290;&#23383;&#31526;&#20018;&#23383;&#38754;&#37327;&#20013;&#30340;#&#23383;&#31526;&#20165;&#20165;&#34920;&#31034;#&#12290;&#22240;&#20026;&#27880;&#37322;&#21482;&#26159;&#20026;&#20102;&#35299;&#37322;&#20195;&#30721;&#24182;&#19988;&#19981;&#20250;&#34987;Python&#35299;&#37322;&#22120;&#35299;&#37322;&#65292;&#25152;&#20197;&#25970;&#20837;&#31034;&#20363;&#30340;&#26102;&#20505;&#21487;&#20197;&#24573;&#30053;&#23427;&#20204;&#12290;</p>
<h3 id="&#23558;python&#24403;&#20316;&#35745;&#31639;&#22120;">3.1 &#23558;Python&#24403;&#20316;&#35745;&#31639;&#22120;</h3>
<p>&#39318;&#20808;&#65292;&#23581;&#35797;&#19968;&#20123;&#31616;&#21333;&#30340;Python&#21629;&#20196;&#65292;&#21551;&#21160;&#35299;&#37322;&#22120;&#28982;&#21518;&#31561;&#24453;&#20027;&#25552;&#31034;&#31526;<code>&gt;&gt;&gt;</code>&#12290;</p>
<h4 id="&#25968;&#23383;">3.1.1 &#25968;&#23383;</h4>
<p>&#35299;&#37322;&#22120;&#20316;&#20026;&#19968;&#20010;&#31616;&#21333;&#30340;&#35745;&#31639;&#22120;&#65306;&#20320;&#21487;&#20197;&#21521;&#23427;&#36755;&#20837;&#19968;&#20010;&#34920;&#36798;&#24335;&#65292;&#23427;&#23558;&#36820;&#22238;&#20854;&#32467;&#26524;&#12290;</p>
<ul>
<li><p>&#25972;&#25968;&#30340;&#31867;&#22411;&#26159;<code>int</code>,&#28014;&#28857;&#22411;&#26159;<code>float</code>.&#20854;&#20013;&#65292;&#38500;&#27861;&#27704;&#36828;&#36820;&#22238;&#28014;&#28857;&#25968;&#12290;&#22914;&#35201;&#20351;&#29992;<code>floor&#38500;&#27861;</code>&#24182;&#19988;&#24471;&#21040;&#25972;&#25968;&#32467;&#26524;&#65292;&#21487;&#20197;&#20351;&#29992;&#36816;&#31639;&#31526;<code>//</code>&#65292;&#32780;&#21462;&#20313;&#36816;&#31639;&#21487;&#20351;&#29992;<code>%</code>&#12290;&#65288;&#27880;&#65306;python3.4&#20013;&#35980;&#20284;&#25972;&#25968;/&#25972;&#25968;&#20173;&#24471;&#21040;&#25972;&#25968;&#65311;&#65289;&#27492;&#22806;&#65292;&#36890;&#36807;<code>**</code>&#36816;&#31639;&#31526;&#21487;&#20197;&#35745;&#31639;&#24130;&#20056;&#26041;<a href="#fn1" class="footnoteRef" id="fnref1"><sup>1</sup></a>&#12290;&#31561;&#21495;<code>=</code>&#21487;&#29992;&#20110;&#32473;&#21464;&#37327;&#36171;&#20540;&#65292;&#22914;<code>age = 25</code>&#12290;</p></li>
<li><p>&#28014;&#28857;&#25968;&#23436;&#20840;&#25903;&#25345;&#65306;&#22312;&#25972;&#25968;&#19982;&#28014;&#28857;&#25968;&#30340;&#28151;&#21512;&#35745;&#31639;&#20013;&#65292;&#25972;&#25968;&#20250;&#34987;&#36716;&#25442;&#20026;&#28014;&#28857;&#25968;&#12290;&#22312;&#20132;&#20114;&#27169;&#24335;&#19979;&#65292;&#26368;&#36817;&#19968;&#27425;&#34920;&#36798;&#24335;&#30340;&#20540;&#34987;&#36171;&#20540;&#32473;&#21464;&#37327;&#65306;<code>_</code>&#12290;</p></li>
</ul>
<p>&#22312;&#20132;&#20114;&#24335;&#35299;&#37322;&#22120;&#20013;&#65292;&#36755;&#20986;&#30340;&#23383;&#31526;&#20018;&#20250;&#29992;&#24341;&#21495;&#24341;&#36215;&#26469;&#65292;&#29305;&#27530;&#23383;&#31526;&#20250;&#29992;&#21453;&#26012;&#26464;&#36716;&#20041;&#12290;&#34429;&#28982;&#21487;&#33021;&#21644;&#36755;&#20837;&#30475;&#19978;&#21435;&#19981;&#22826;&#19968;&#26679;&#65292;&#20294;&#26159;&#20004;&#20010;&#23383;&#31526;&#20018;&#26159;&#30456;&#31561;&#30340;&#12290;&#22914;&#26524;&#23383;&#31526;&#20018;&#20013;&#21482;&#26377;&#21333;&#24341;&#21495;&#32780;&#27809;&#26377;&#21452;&#24341;&#21495;&#65292;&#23601;&#29992;&#21452;&#24341;&#21495;&#24341;&#29992;&#65292;&#21542;&#21017;&#29992;&#21333;&#24341;&#21495;&#24341;&#29992;&#12290;print()&#20989;&#25968;&#29983;&#25104;&#21487;&#35835;&#24615;&#26356;&#22909;&#30340;&#36755;&#20986;, &#23427;&#20250;&#30465;&#21435;&#24341;&#21495;&#24182;&#19988;&#25171;&#21360;&#20986;&#36716;&#20041;&#21518;&#30340;&#29305;&#27530;&#23383;&#31526;&#12290;</p>
<p>&#21069;&#38754;&#24102;&#26377;&#21453;&#26012;&#26464;\ &#30340;&#23383;&#31526;&#34987;&#24403;&#20316;&#29305;&#27530;&#23383;&#31526;<a href="#fn2" class="footnoteRef" id="fnref2"><sup>2</sup></a>&#65292;&#22914;&#35201;&#20351;&#29992;&#21407;&#22987;&#23383;&#31526;&#20018;&#65292;&#38656;&#22312;&#31532;&#19968;&#20010;&#24341;&#21495;&#21069;&#21152;&#19968;&#20010;<code>r</code>.</p>
<p>&#23383;&#31526;&#20018;&#21487;&#20197;&#36328;&#22810;&#34892;&#12290;&#19968;&#31181;&#26041;&#27861;&#26159;&#20351;&#29992;&#19977;&#24341;&#21495;&#65306;&quot;&quot;&quot;...&quot;&quot;&quot;&#25110;&#32773;'''...'''&#12290;&#34892;&#23614;&#25442;&#34892;&#31526;&#20250;&#34987;&#33258;&#21160;&#21253;&#21547;&#21040;&#23383;&#31526;&#20018;&#20013;&#65292;&#20294;&#26159;&#21487;&#20197;&#22312;&#34892;&#23614;&#21152;&#19978; ``` &#26469;&#36991;&#20813;&#36825;&#20010;&#34892;&#20026;&#12290;&#19979;&#38754;&#30340;&#31034;&#20363;&#65306;</p>
<pre><code>print(&quot;&quot;&quot;\
Usage: thingy [OPTIONS]
     -h                        Display this usage message
     -H hostname               Hostname to connect to
&quot;&quot;&quot;)</code></pre>
<p>&#23558;&#29983;&#25104;&#20197;&#19979;&#36755;&#20986;&#65288;&#27880;&#24847;&#65292;&#27809;&#26377;&#24320;&#22987;&#30340;&#31532;&#19968;&#34892;&#65289;&#65306;</p>
<pre><code>Usage: thingy [OPTIONS]
     -h                        Display this usage message
     -H hostname               Hostname to connect to</code></pre>
<ul>
<li><p>&#23383;&#31526;&#20018;&#21487;&#20197;&#29992;<code>+</code>&#25805;&#20316;&#31526;&#36830;&#25509;&#65292;&#20063;&#21487;&#29992;<code>*</code>&#25805;&#20316;&#31526;&#37325;&#22797;&#22810;&#27425;&#65306;<code>3*\un + 'ium'</code>&#24471;&#21040;<code>unununium</code>&#12290;&#30456;&#37051;&#30340;&#20004;&#20010;&#25110;&#22810;&#20010;<strong>&#23383;&#31526;&#20018;&#23383;&#38754;&#37327;</strong>&#65288;&#24341;&#21495;&#24341;&#36215;&#26469;&#65289;&#20250;&#33258;&#21160;&#36830;&#25509;&#12290;&#22914;&#35201;&#36830;&#25509;&#21464;&#37327;&#19982;&#24120;&#37327;&#25110;&#32773;&#21464;&#37327;&#19982;&#21464;&#37327;&#21487;&#36890;&#36807;<code>+</code>&#12290;</p></li>
<li><p>&#23383;&#31526;&#20018;&#21487;&#20197;<strong>&#32034;&#24341;</strong>&#65292;&#31532;&#19968;&#20010;&#23383;&#31526;&#30340;&#32034;&#24341;&#20540;&#20026;0. &#32034;&#24341;&#20063;&#21487;&#20197;&#26159;&#36127;&#20540;&#65292;&#27492;&#26102;&#20174;&#21491;&#20391;&#35745;&#25968;&#12290;&#23383;&#31526;&#20018;&#36824;&#25903;&#25345;&#20999;&#29255;&#65292;&#22914;<code>word[2:5]</code>,<code>word[2:]</code>,<code>word[:4]</code>&#65292;&#32780;<code>word[:i] + word[i:]</code>&#24658;&#31561;&#20110;<code>word</code>&#26412;&#36523;&#12290;&#65288;&#27880;&#24847;&#65306;&#20999;&#29255;<strong>&#21253;&#21547;&#24320;&#22987;&#30340;&#23383;&#31526;&#65292;&#19981;&#21253;&#21547;&#32467;&#23614;&#30340;&#23383;&#31526;</strong>&#12290;</p>
<pre><code>&gt;&gt;&gt; word = &quot;Python&quot;
&gt;&gt;&gt; word[0]
&#39;P&#39;</code></pre></li>
</ul>
<blockquote>
<p>&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#21333;&#23383;&#31526;&#32034;&#24341;&#19981;&#21487;&#20986;&#30028;&#65292;&#32780;&#20999;&#29255;&#21017;&#21487;&#20197;&#65292;&#19981;&#36807;&#20250;&#33258;&#21160;&#24573;&#30053;&#20986;&#30028;&#37096;&#20998;&#12290;</p>
</blockquote>
<ul>
<li><p>Python &#23383;&#31526;&#20018;&#19981;&#21487;&#20197;&#25913;&#21464;&#8212;&#23427;&#20204;&#26159;&#19981;&#21487;&#21464;&#30340;&#12290;&#22240;&#27492;&#65292;&#36171;&#20540;&#32473;&#23383;&#31526;&#20018;&#32034;&#24341;&#30340;&#20301;&#32622;&#20250;&#23548;&#33268;&#38169;&#35823;&#65307;&#22914;&#38656;&#19968;&#20010;&#19981;&#21516;&#30340;&#23383;&#31526;&#20018;&#65292;&#35201;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#12290;&#65288;&#23383;&#31526;&#20018;&#21464;&#37327;&#21487;&#20197;&#36890;&#36807;&#37325;&#26032;&#36171;&#20540;&#36827;&#34892;&#25913;&#21464;&#65289;</p></li>
<li><p>&#20869;&#32622;&#20989;&#25968;<strong><code>len()</code></strong>&#36820;&#22238;&#23383;&#31526;&#20018;&#30340;&#38271;&#24230;&#12290;</p></li>
</ul>
<h4 id="&#21015;&#34920;">3.1.3 &#21015;&#34920;</h4>
<p>Python&#26377;&#20960;&#20010;<strong>&#22797;&#21512;</strong>&#25968;&#25454;&#31867;&#22411;&#65292;&#29992;&#20110;&#32452;&#21512;&#20854;&#20182;&#20540;&#12290;&#26368;&#26377;&#29992;&#30340;&#26159;<strong>&#21015;&#34920;</strong>&#65292;&#21487;&#20197;&#20889;&#25104;&#20013;&#25324;&#21495;&#20013;&#30340;&#19968;&#21015;&#29992;&#36887;&#21495;&#20998;&#38548;&#30340;&#20540;&#12290;&#21015;&#34920;&#21487;&#20197;&#21253;&#21547;&#19981;&#21516;&#31867;&#22411;&#30340;&#20803;&#32032;&#65292;&#20294;&#36890;&#24120;&#25152;&#26377;&#30340;&#20803;&#32032;&#37117;&#20855;&#26377;&#30456;&#21516;&#30340;&#31867;&#22411;&#65292;&#22914;&#65306;<code>square = [1,4,9,16,25]</code>&#12290;</p>
<p>&#21644;&#23383;&#31526;&#20018;&#19968;&#26679;&#65292;&#21015;&#34920;&#21516;&#26679;&#21487;&#20197;&#32034;&#24341;&#21644;&#20999;&#29255;&#65292;&#19981;&#21516;&#30340;&#26159;&#23427;&#30340;&#36820;&#22238;&#20540;&#20998;&#21035;&#26159;&#20803;&#32032;&#21644;&#21015;&#34920;&#12290;&#36890;&#36807;<code>+</code>&#25805;&#20316;&#31526;&#21487;&#20197;&#24310;&#38271;&#21015;&#34920;&#65288;&#21015;&#34920;&#36830;&#25509;&#65289;&#12290;</p>
<p>&#19982;&#19981;&#21487;&#21464;&#30340;&#23383;&#31526;&#20018;&#19981;&#21516;&#65292;&#21015;&#34920;&#26159;&#21487;&#21464;&#30340;&#31867;&#22411;&#65292;&#21487;&#36890;&#36807;&#32034;&#24341;&#36171;&#20540;&#31561;&#36827;&#34892;&#25913;&#21464;&#12290;&#36890;&#36807;&#32473;&#20999;&#29255;&#36171;&#20540;&#20063;&#21487;&#20197;&#65292;&#27492;&#25805;&#20316;&#29978;&#33267;&#21487;&#20197;&#25913;&#21464;&#21015;&#34920;&#30340;&#22823;&#23567;&#25110;&#32773;&#28165;&#31354;&#65288;&#36171;&#20104;&#31354;&#21015;&#34920;<code>[]</code>)</p>
<p>&#20351;&#29992;&#20989;&#25968;<code>append()</code>&#21487;&#20197;&#22312;&#21015;&#34920;&#26411;&#23614;&#28155;&#21152;&#26032;&#30340;&#20803;&#32032;&#65292;&#20363;&#22914;&#65306;<code>listname.append(x)</code>,&#20854;&#20013;x&#21487;&#20197;&#26159;&#26631;&#37327;&#65292;&#20063;&#21487;&#20197;&#26159;&#34920;&#36798;&#24335;&#12290;</p>
<p>&#27492;&#22806;&#65292;&#21015;&#34920;&#21487;&#20197;&#23884;&#22871;&#65292;&#21363;&#21015;&#34920;&#20013;&#30340;&#26576;&#19968;&#20010;&#20803;&#32032;&#36824;&#26159;&#19968;&#20010;&#21015;&#34920;&#65292;&#35835;&#21462;&#20854;&#20013;&#27425;&#32423;&#21015;&#34920;&#30340;&#26041;&#27861;&#26159;<code>list[i][j]</code>&#12290;</p>
<ul>
<li>&#20869;&#32622;&#20989;&#25968;<code>len()</code>&#21516;&#26679;&#36866;&#29992;&#20110;&#21015;&#34920;&#65292;&#21487;&#36820;&#22238;&#21015;&#34920;&#30340;&#20803;&#32032;&#20010;&#25968;&#65288;&#21015;&#34920;&#38271;&#24230;&#65289;&#12290;</li>
</ul>
<h3 id="&#32534;&#31243;&#31532;&#19968;&#27493;">3.2 &#32534;&#31243;&#31532;&#19968;&#27493;</h3>
<p>&#29992;Python&#29983;&#25104;&#19968;&#20010;&#26000;&#27874;&#37027;&#22865;&#21021;&#22987;&#23376;&#24207;&#21015;&#65306;</p>
<pre><code>&gt;&gt;&gt; # Fibonacci series
... # the sum of two elements defines the next
&gt;&gt;&gt; a, b = 0, 1
&gt;&gt;&gt; while b &lt; 10:
...         print(b)
...         a, b= b, a+b
...
1
1
2
3
5
8</code></pre>
<p>&#35813;&#31034;&#20363;&#21253;&#21547;&#20197;&#19979;&#26032;&#21151;&#33021;&#65306;</p>
<ul>
<li><p>&#22810;&#37325;&#36171;&#20540;&#65306;&#21464;&#37327;a&#21644;b&#21516;&#26102;&#33719;&#24471;&#26032;&#20540;0&#21644;1&#12290;&#26368;&#21518;&#19968;&#34892;&#20063;&#26159;&#22914;&#27492;&#12290;&#20854;&#20013;&#65292;&#31561;&#21495;&#21491;&#36793;&#30340;&#34920;&#36798;&#24335;&#34987;&#23436;&#20840;&#35299;&#26512;&#65292;&#32780;&#21491;&#20391;&#34920;&#36798;&#24335;&#26159;&#20174;&#24038;&#21521;&#21491;&#35745;&#31639;&#30340;&#12290;</p></li>
<li><p>&#21482;&#35201;&#26465;&#20214;&#65288;b &lt;10&#65289;&#28385;&#36275;&#65292;&#21363;&#20026;True&#65292;while&#35821;&#21477;&#24490;&#29615;&#25191;&#34892;&#12290;Python&#20013;&#20219;&#20309;&#38750;&#38646;&#25972;&#25968;&#20540;&#37117;&#20026;True&#65292;&#32780;&#38646;&#20026;false&#12290;&#23545;&#23383;&#31526;&#20018;&#26469;&#35828;&#65292;&#38750;&#31354;&#20026;true&#65292;&#31354;&#24207;&#21015;&#20026;false&#12290;</p></li>
<li><p>&#24490;&#29615;&#20307;&#26159;<strong>&#32553;&#36827;</strong>&#26159;python&#20998;&#32452;&#35821;&#21477;&#30340;&#26041;&#24335;&#12290;&#20132;&#20114;&#24335;&#36755;&#20837;&#26102;&#65292;&#24517;&#39035;&#20026;&#27599;&#20010;&#32553;&#36827;&#34892;&#36755;&#20837;&#19968;&#20010;tab&#25110;&#22810;&#20010;&#31354;&#26684;&#12290;&#20132;&#20114;&#24335;&#36755;&#20837;&#22797;&#21512;&#35821;&#21477;&#26102;&#65292;&#26368;&#21518;&#24517;&#39035;&#36319;&#38543;&#19968;&#20010;&#31354;&#34892;&#34920;&#31034;&#32467;&#26463;&#12290;&#27880;&#24847;&#65306;<strong>&#22522;&#26412;&#22359;&#20869;&#30340;&#27599;&#19968;&#34892;&#24517;&#39035;&#25353;&#29031;&#30456;&#21516;&#30340;&#37327;&#36827;&#34892;&#32553;&#36827;&#12290;</strong></p></li>
<li><p><code>print()</code>&#20989;&#25968;&#36755;&#20986;&#20256;&#32473;&#23427;&#30340;&#21442;&#25968;&#30340;&#20540;&#12290;&#23427;&#21487;&#20197;&#36755;&#20986;&#34920;&#36798;&#24335;&#32467;&#26524;&#12289;&#22810;&#20010;&#21442;&#25968;&#12289;&#28014;&#28857;&#25968;&#21644;&#23383;&#31526;&#20018;&#12290;&#27492;&#26102;&#65292;&#25171;&#21360;&#20986;&#30340;&#23383;&#31526;&#20018;&#19981;&#21547;&#24341;&#21495;&#65292;&#19988;&#20197;&#36887;&#21495;&#30456;&#36830;&#30340;&#19981;&#21516;&#39033;&#30446;&#20043;&#38388;&#37117;&#20250;&#25554;&#20837;&#19968;&#20010;&#24341;&#21495;&#12290;&#65288;&#27599;&#27425;&#25171;&#21360;&#26368;&#21518;&#36755;&#20986;&#19968;&#20010;&#25442;&#34892;&#31526;&#65311;&#65311;&#65289;&#36890;&#36807;&#20851;&#38190;&#23383;&#21442;&#25968;<code>end</code>&#21487;&#20197;&#36991;&#20813;print&#27599;&#27425;&#37117;&#36755;&#20986;&#25442;&#34892;&#31526;&#65292;&#25110;&#32773;&#25351;&#23450;&#19968;&#20010;&#20998;&#38548;&#31526;&#65292;&#22914;<code>print (b, end='')</code>&#25110;<code>print (b,&quot;,&quot;)</code>&#12290;</p></li>
</ul>
<div class="footnotes">
<hr />
<ol>
<li id="fn1"><p>&#22240;&#20056;&#24130;&#36816;&#31639; <code>**</code> &#27604;&#21462;&#36127;&#36816;&#31639; -&#26377;&#26356;&#39640;&#30340;&#20248;&#20808;&#32423;, &#22240;&#27492;<code>-3**2</code> &#23558;&#34987;&#35299;&#37322;&#20026; <code>-(3**2)</code> &#25152;&#20197;&#32467;&#26524;&#20250;&#24471;&#21040;-9. &#20026;&#36991;&#20813;&#36825;&#31181;&#32467;&#26524;&#65292;&#32780;&#24471;&#21040;&#24819;&#35201;&#30340;&#32467;&#26524; 9, &#20320;&#21487;&#20197;&#20351;&#29992; <code>(-3)**2</code>.<a href="#fnref1">&#8617;</a></p></li>
<li id="fn2"><p>&#19981;&#21516;&#20110;&#20854;&#20182;&#35821;&#35328;&#30340;&#65292;&#29305;&#27530;&#23383;&#31526;&#22914; <code>\n</code> &#22312;&#21333;&#24341;&#21495; ('...') &#21644;&#21452;&#24341;&#21495; (&quot;...&quot;) &#20043;&#20869;&#26159;&#19968;&#26679;&#30340;. &#20004;&#32773;&#20043;&#38388;&#30340;&#21807;&#19968;&#21306;&#21035;&#26159;&#21333;&#24341;&#21495;&#20869;&#19981;&#38656;&#35201;&#23545;&#21452;&#24341;&#21495; &quot; &#36716;&#20041;(&#20294;&#20320;&#35201;&#36716;&#20041;&#21333;&#24341;&#21495; ') &#21453;&#20043;&#20134;&#28982;.<a href="#fnref2">&#8617;</a></p></li>
</ol>
</div>
</body>
</html>
