<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <link rel="stylesheet" href="book.css" type="text/css" />
</head>
<body>
<h2 id="&#25511;&#21046;&#27969;">4. &#25511;&#21046;&#27969;</h2>
<p>&#38500;&#20102;&#65292;&#21069;&#38754;&#30340;<code>while</code>&#35821;&#21477;&#22806;&#65292;Python&#20063;&#26377;&#20854;&#20182;&#24120;&#35265;&#30340;&#27969;&#31243;&#25511;&#21046;&#35821;&#21477;&#65292;&#20294;&#26159;&#31245;&#26377;&#19981;&#21516;&#12290;</p>
<h3 id="if&#35821;&#21477;">4.1 if&#35821;&#21477;</h3>
<p>&#20063;&#35768;&#26368;&#30693;&#21517;&#30340;&#35821;&#21477;&#26159;<code>if</code>&#35821;&#21477;&#12290;&#20363;&#22914;&#65306;</p>
<pre><code>&gt;&gt;&gt; x = int (input(&quot;Please enter an integer: &quot;))
Please enter an integer: 42
&gt;&gt;&gt; if x &lt; 0:
...         x=0
...         print (&#39;Negative changed to zero&#39;)
... elif x==0:
...         print(&#39;Zero&#39;)
... elif x==1:
...         print(&#39;Single&#39;)
... else:
...     print(&#39;More&#39;)
...
More</code></pre>
<p>if&#35821;&#21477;&#21487;&#20197;&#26377;&#38646;&#20010;&#25110;&#22810;&#20010;elif&#37096;&#20998;&#65292;&#19988;else&#37096;&#20998;&#20063;&#26159;&#21487;&#36873;&#30340;&#12290;</p>
<h3 id="for&#35821;&#21477;">4.2 for&#35821;&#21477;</h3>
<p>Python&#30340;<code>for</code>&#35821;&#21477;&#25353;&#29031;&#20803;&#32032;&#20986;&#29616;&#30340;&#39034;&#24207;&#36845;&#20195;&#20219;&#20309;&#24207;&#21015;(&#21015;&#34920;&#25110;&#23383;&#31526;&#20018;),&#20363;&#22914;&#65306;</p>
<pre><code>&gt;&gt;&gt; # Measure some strings:
... words = [&#39;cat&#39;,&#39;window&#39;,&#39;defenestrate&#39;]
&gt;&gt;&gt; for w in words:
...         print (w, len(w))
...
cat 3
window 6
defenestrate 12</code></pre>
<p>&#22914;&#35201;&#22312;&#24490;&#29615;&#20869;&#20462;&#25913;&#27491;&#22312;&#36845;&#20195;&#30340;&#24207;&#21015;&#65288;&#22914;&#22797;&#21046;&#25152;&#36873;&#39033;&#30446;&#65289;&#65292;&#24314;&#35758;&#39318;&#20808;&#21046;&#20316;&#21103;&#26412;&#12290;&#36845;&#20195;&#24207;&#21015;&#19981;&#20250;&#38544;&#24335;&#30340;&#21019;&#24314;&#21103;&#26412;&#12290;&#20351;&#29992;&#20999;&#29255;&#23601;&#21487;&#20197;&#24456;&#23481;&#26131;&#30340;&#20570;&#21040;&#65306;</p>
<pre><code>&gt;&gt;&gt; for w in words[:]: # Loop over a slice copy of the entire list.
...         if len(w) &gt; 6:
...                 words.insert(0,w)
...
&gt;&gt;&gt; words
[&#39;defenestrate&#39;,&#39;cat&#39;,&#39;window&#39;,&#39;defenestrate&#39;]</code></pre>
<h3 id="range&#20989;&#25968;">4.3 range()&#20989;&#25968;</h3>
<p>&#22914;&#38656;&#36941;&#21382;&#19968;&#20010;&#25968;&#23383;&#24207;&#21015;&#65292;&#20869;&#32622;&#20989;&#25968;<code>range()</code>&#21487;&#20379;&#20351;&#29992;&#65292;&#22914;&#29983;&#25104;&#31561;&#24046;&#25968;&#21015;&#65306;</p>
<pre><code>&gt;&gt;&gt; for i in range(5):
...         print(i)
...
1
2
3
4</code></pre>
<blockquote>
<p>range()&#20013;&#32473;&#23450;&#30340;&#32456;&#28857;&#19981;&#21253;&#25324;&#12290;&#35813;&#20989;&#25968;&#21487;&#26377;1-3&#20010;&#21442;&#25968;&#65292;&#19968;&#20010;&#21442;&#25968;<code>range(n)</code>&#26159;&#34920;&#31034;0 ~ n-1,&#20004;&#20010;&#21442;&#25968;<code>range(m,n)</code>&#26159;&#34920;&#31034;m ~ n-1,&#19977;&#20010;&#21442;&#25968;<code>range(m,n,i)</code>&#26159;&#34920;&#31034;m,m+i,m+2i,....(&lt;n)</p>
</blockquote>
<p>&#33509;&#35201;&#20381;&#25454;&#32034;&#24341;&#36845;&#20195;&#24207;&#21015;&#65292;&#20320;&#21487;&#20197;&#32467;&#21512;&#20351;&#29992;range () &#21644;len() &#65292;&#22914;&#19979;&#25152;&#31034;&#65306;</p>
<pre><code>&gt;&gt;&gt; a = [&#39;Mary&#39;,&#39;had&#39;,&#39;a&#39;,&#39;little&#39;,&#39;lamb&#39;]
&gt;&gt;&gt; for i in range(len (a)):
...         print (i, a[i])
...
0 Mary
1 had
2 a
3 little
4 lamb</code></pre>
<blockquote>
<p>&#20854;&#23454;&#65292;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#22823;&#22810;&#26102;&#20505;&#20351;&#29992;&#20989;&#25968;<code>enumerate()</code>&#26356;&#21152;&#26041;&#20415;&#12290;</p>
</blockquote>
<p>&#33509;&#21482;&#25171;&#21360;range&#65292;&#32467;&#26524;&#20250;&#24456;&#35809;&#24322;&#65306;<code>print range(10)</code>&#24471;&#21040;<code>range(0,10)</code>.range()&#36820;&#22238;&#30340;&#23545;&#35937;&#30340;&#34892;&#20026;&#22312;&#24456;&#22810;&#26041;&#38754;&#24456;&#20687;&#19968;&#20010;&#21015;&#34920;&#65292;&#20294;&#23454;&#38469;&#19978;&#23427;&#24182;&#19981;&#26159;&#21015;&#34920;&#12290;&#24403;&#20320;&#36845;&#20195;&#23427;&#30340;&#26102;&#20505;&#23427;&#20250;&#20381;&#27425;&#36820;&#22238;&#26399;&#26395;&#24207;&#21015;&#30340;&#20803;&#32032;&#65292;&#20294;&#26159;&#23427;&#19981;&#20250;&#30495;&#27491;&#20135;&#29983;&#19968;&#20010;&#21015;&#34920;&#65292;&#22240;&#27492;&#21487;&#20197;&#33410;&#30465;&#31354;&#38388;&#12290;</p>
<h3 id="break&#21644;continue&#35821;&#21477;&#20197;&#21450;&#24490;&#29615;&#20013;&#30340;else&#23383;&#21477;">4.4 break&#21644;continue&#35821;&#21477;&#20197;&#21450;&#24490;&#29615;&#20013;&#30340;else&#23383;&#21477;</h3>
<p><code>break</code>&#35821;&#21477;&#19982;C&#35821;&#35328;&#20013;&#31867;&#20284;&#65292;&#29992;&#20110;&#36339;&#20986;&#26368;&#36817;&#30340;for&#25110;while&#24490;&#29615;&#12290;</p>
<p>&#24490;&#29615;&#35821;&#21477;&#20063;&#21487;&#20197;&#26377;&#19968;&#20010;<code>else</code>&#23383;&#21477;&#65306;&#24403;for&#24490;&#29615;&#36845;&#20195;&#23436;&#25972;&#20010;&#21015;&#34920;&#25110;while&#24490;&#29615;&#26465;&#20214;&#21464;&#20026;false&#65292;&#32780;&#38750;&#30001;break&#35821;&#21477;&#32456;&#27490;&#26102;&#65292;&#23427;&#20250;&#25191;&#34892;&#12290;&#19979;&#38754;&#24490;&#29615;&#25628;&#32034;&#36136;&#25968;&#30340;&#20195;&#30721;&#31034;&#20363;&#20102;&#36825;&#19968;&#28857;&#65306;</p>
<pre><code>&gt;&gt;&gt; for n in range(2,10):
...         for x in range(2,n):
...                 if n%x ==0:
...                         print(n, &#39;equals&#39;, x, &#39;*&#39;,n//x)
...                         break
...         else:
...                 # loop fell through without finding a factor
...                 print(n, &#39;is a prime number&#39;)
...
2 is a prime number
3 is a prime number
4 equals 2*2
5 is a prime number
...</code></pre>
<blockquote>
<p>&#27880;&#65306;&#30475;&#20180;&#32454;&#65292;else&#23383;&#21477;&#23646;&#20110;for&#24490;&#29615;&#65292;&#32780;<strong>&#19981;&#23646;&#20110;</strong>if&#35821;&#21477;&#12290;</p>
</blockquote>
<p>&#24403;&#20351;&#29992;&#19968;&#20010;&#24490;&#29615;&#26102;&#65292;else&#23376;&#21477;&#20013;&#26356;&#21152;&#26222;&#36941;&#30340;&#26159;else&#23383;&#21477;&#30340;try&#35821;&#21477;&#65292;&#32780;&#38750;if&#35821;&#21477;&#65306;<code>try</code>&#35821;&#21477;&#30340;else&#23376;&#21477;&#22312;&#27809;&#26377;&#20219;&#20309;&#24322;&#24120;&#21457;&#29983;&#26102;&#36816;&#34892;&#65292;&#32780;&#24490;&#29615;&#30340;else&#23376;&#21477;&#21017;&#22312;&#27809;&#26377;break&#21457;&#29983;&#26102;&#36816;&#34892;&#12290;</p>
<p><code>continue</code>&#35821;&#21477;&#20063;&#26159;&#20174;C&#35821;&#35328;&#20511;&#26469;&#30340;&#65292;&#34920;&#31034;&#32487;&#32493;&#19979;&#19968;&#27425;&#36845;&#20195;&#65306;</p>
<pre><code>&gt;&gt;&gt; for num in range(2,10):
...         if num % 2 == 0:
...                 print (&quot;Found an even number&quot;,num)
...                 continue
...         print(&quot;Found a number&quot;,num)</code></pre>
<h3 id="pass&#35821;&#21477;">4.5 pass&#35821;&#21477;</h3>
<p><code>pass</code>&#35821;&#21477;&#20160;&#20040;&#20063;&#19981;&#20570;&#65292;&#29992;&#20110;&#35821;&#27861;&#19978;&#24517;&#39035;&#26377;&#19968;&#26465;&#35821;&#21477;&#65292;&#20294;&#31243;&#24207;&#19978;&#20160;&#20040;&#20063;&#19981;&#38656;&#35201;&#20570;&#30340;&#22330;&#21512;&#12290;</p>
<pre><code>&gt;&gt;&gt; while True:
...     pass # Busy-wait for keyboard interrupt (Ctrl-C)
...</code></pre>
<p><code>pass</code>&#35821;&#21477;&#36824;&#29992;&#20110;&#21019;&#24314;&#26368;&#23567;&#30340;&#31867;&#65306;</p>
<pre><code>&gt;&gt;&gt; class MyEmptyClass:
                pass
</code></pre>
<p>&#21478;&#19968;&#20010;&#20351;&#29992;<code>pass</code>&#35821;&#21477;&#30340;&#22320;&#26041;&#23601;&#26159;&#32534;&#30721;&#26032;&#20195;&#30721;&#26102;&#20316;&#20026;&#20989;&#25968;&#20307;&#25110;&#25511;&#21046;&#20307;&#30340;&#21344;&#20301;&#31526;&#65292;&#36825;&#35753;&#20320;&#22312;&#26356;&#25277;&#35937;&#23618;&#27425;&#19978;&#24605;&#32771;&#65306;</p>
<pre><code>&gt;&gt;&gt; def initlog(*args):
                pass # Remember to implement this!</code></pre>
<h3 id="&#23450;&#20041;&#20989;&#25968;">4.6 &#23450;&#20041;&#20989;&#25968;</h3>
<p>&#20363;&#22914;&#65292;&#25105;&#20204;&#21487;&#20197;&#21019;&#24314;&#19968;&#20010;&#29983;&#25104;&#20219;&#24847;&#19978;&#30028;&#30340;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#30340;&#20989;&#25968;&#65306;</p>
<pre><code>def fib(n):     # write Fibonacci series up to n
        &quot;&quot;&quot; print a Fibonacci series up to n &quot;&quot;&quot;
        a, b = 0, 1
        while a &lt; n:
                print (a,end=&#39; &#39;)
                a, b = b, a+b
        print()

        # Now call th function we just defined:
        fib(2000)

0 1 1 2 3 5 8 13 21 34 55 89 144 377 610 987 1597</code></pre>
<p>&#30001;&#27492;&#21487;&#35265;&#65292;&#20989;&#25968;&#30001;&#20851;&#38190;&#23383;<code>def</code>&#23450;&#20041;&#65292;&#20854;&#21518;&#24517;&#39035;&#36319;&#26377;&#20989;&#25968;&#21517;&#21644;&#20197;&#25324;&#21495;&#34920;&#26126;&#30340;&#24418;&#24335;&#21442;&#25968;&#21015;&#34920;&#65292;&#32452;&#25104;&#20989;&#25968;&#20307;&#30340;&#35821;&#21477;&#20174;&#19979;&#19968;&#34892;&#24320;&#22987;&#65292;&#19988;&#24517;&#39035;&#32553;&#36827;&#12290;</p>
<p>&#20989;&#25968;&#20307;&#30340;&#31532;&#19968;&#34892;&#21487;&#20197;&#26159;&#19968;&#20010;&#21487;&#36873;&#30340;&#23383;&#31526;&#20018;&#25991;&#26412;&#65307;&#27492;&#23383;&#31526;&#20018;&#26159;&#35813;&#20989;&#25968;&#30340;&#25991;&#26723;&#23383;&#31526;&#20018;&#65292;&#25110;&#31216;&#20026;<strong>docstring</strong>&#12290;&#26377;&#24037;&#20855;&#20351;&#29992;docstring&#33258;&#21160;&#29983;&#25104;&#22312;&#32447;&#30340;&#25110;&#21487;&#25171;&#21360;&#30340;&#25991;&#26723;&#65292;&#25110;&#32773;&#35753;&#29992;&#25143;&#22312;&#20195;&#30721;&#20013;&#20132;&#20114;&#27983;&#35272;&#65307;&#22312;&#32534;&#30721;&#20013;&#21253;&#21547;docstring&#26159;&#24456;&#22909;&#30340;&#20570;&#27861;&#12290;</p>
<p>&#20989;&#25968;&#30340;&#25191;&#34892;&#20250;&#24341;&#29289;&#19968;&#20010;&#26032;&#30340;&#31526;&#21495;&#34920;&#65292;&#29992;&#20110;&#20989;&#25968;&#30340;&#23616;&#37096;&#21464;&#37327;&#12290;&#20989;&#25968;&#20013;&#30340;&#25152;&#26377;&#36171;&#20540;&#37117;&#26159;&#23558;&#20540;&#23384;&#20648;&#22312;&#23616;&#37096;&#31526;&#21495;&#34920;&#20013;&#65292;&#32780;&#21464;&#37327;&#39318;&#20808;&#26597;&#25214;&#23616;&#37096;&#31526;&#21495;&#34920;&#65292;&#28982;&#21518;&#26159;&#19978;&#23618;&#20989;&#25968;&#30340;&#23616;&#37096;&#31526;&#21495;&#34920;&#65292;&#28982;&#21518;&#26159;&#20840;&#23616;&#31526;&#21495;&#34920;&#65292;&#26368;&#21518;&#26159;&#20869;&#32622;&#21517;&#23383;&#34920;&#12290;&#22240;&#27492;&#65292;&#22312;&#20989;&#25968;&#20869;&#37096;&#20840;&#23616;&#21464;&#37327;&#19981;&#33021;&#30452;&#25509;&#36171;&#20540;&#65288;&#38500;&#38750;&#29992;global&#35821;&#21477;&#21629;&#21517;&#65289;&#65292;&#20294;&#21487;&#20197;&#24341;&#29992;&#23427;&#20204;&#12290;</p>
<p>&#20989;&#25968;&#35843;&#29992;&#30340;&#23454;&#38469;&#21442;&#25968;&#22312;&#20989;&#25968;&#34987;&#35843;&#29992;&#26102;&#24341;&#20837;&#34987;&#35843;&#20989;&#25968;&#65307;&#22240;&#27492;&#65292;&#21442;&#25968;&#30340;&#20256;&#36882;&#20351;&#29992;<strong>&#20256;&#20540;&#35843;&#29992;</strong>&#65288;&#36825;&#37324;&#30340;<strong>&#20540;</strong>&#22987;&#32456;&#26159;&#23545;&#35937;&#30340;&#24341;&#29992;&#65292;&#19981;&#26159;&#23545;&#35937;&#30340;&#20540;&#65289;&#12290;<a href="#fn1" class="footnoteRef" id="fnref1"><sup>1</sup></a> &#19968;&#20010;&#20989;&#25968;&#35843;&#29992;&#21478;&#19968;&#20010;&#20989;&#25968;&#26102;&#65292;&#20250;&#20026;&#35813;&#35843;&#29992;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#23616;&#37096;&#31526;&#21495;&#34920;&#12290;</p>
<ul>
<li><p>&#20989;&#25968;&#23450;&#20041;&#20250;&#22312;&#24403;&#21069;&#31526;&#21495;&#34920;&#20869;&#24341;&#20837;&#20989;&#25968;&#21517;&#12290;&#20989;&#25968;&#21517;&#23545;&#24212;&#20540;&#30340;&#31867;&#22411;&#26159;&#35299;&#37322;&#22120;&#21487;&#35782;&#21035;&#30340;&#29992;&#25143;&#33258;&#23450;&#20041;&#20989;&#25968;&#12290;&#35813;&#20540;&#21487;&#20197;&#20998;&#37197;&#32473;&#21478;&#19968;&#20010;&#21517;&#31216;&#65292;&#28982;&#21518;&#20063;&#21487;&#20316;&#20026;&#20989;&#25968;&#12290;&#36825;&#23601;&#26159;&#20989;&#25968;&#36890;&#29992;&#30340;<strong>&#37325;&#21629;&#21517;</strong>&#26426;&#21046;&#12290;&#22914;&#65306;</p>
<pre><code>fib
&lt;function fib at 10042eb0&gt;
f = fib
f(100)
# 0 1 1 2 3 5 8 13 21 34 55 89</code></pre></li>
</ul>
<p>&#20320;&#21487;&#33021;&#20250;&#35828;&#65306;fib&#19981;&#26159;&#19968;&#20010;&#20989;&#25968;&#65292;&#32780;&#26159;&#19968;&#20010;&#36807;&#31243;&#65292;&#22240;&#20026;&#23427;&#24182;&#26410;&#36820;&#22238;&#20219;&#20309;&#20540;&#12290;&#20854;&#23454;&#65292;&#27809;&#26377;<code>return()</code>&#35821;&#21477;&#30340;&#20989;&#25968;&#20063;&#20250;&#36820;&#22238;&#19968;&#20010;&#20540;&#65292;&#23613;&#31649;&#26159;&#19968;&#20010;&#24456;&#26080;&#32842;&#30340;&#20540;<code>None</code>&#12290;&#22914;None&#26159;&#21807;&#19968;&#30340;&#36755;&#20986;&#65292;&#35299;&#37322;&#22120;&#36890;&#24120;&#19981;&#20250;&#25171;&#21360;&#20986;&#26469;&#12290;&#22914;&#24819;&#36755;&#20986;&#35813;&#20540;&#21487;&#20197;&#20351;&#29992;<code>print(fib(0))</code>&#12290;</p>
<p>&#20889;&#19968;&#20010;&#20989;&#25968;&#36820;&#22238;&#26000;&#27874;&#37027;&#22865;&#25968;&#21015;&#30340;&#21015;&#34920;&#32780;&#38750;&#25171;&#21360;&#20986;&#26469;&#65306;</p>
<pre><code>def fib2(n): # return Fibonacci series up to n
        &quot;&quot;&quot;Return a list containing the Fibonacci series up to n.&quot;&quot;&quot;
        result =[]
        a, b = 0. 1
        while a &lt; n:
                result.append(a)
                a, b = b, a+b
        return result
f100=fib2(100) # call it
f100 #write the result
# [0,1,1,2,3,5,8,13,21,34,55,89]</code></pre>
<p>&#27492;&#31034;&#20363;&#20013;&#65292;&#21253;&#21547;&#20102;&#20197;&#19979;Python&#26032;&#21151;&#33021;&#65306;</p>
<ul>
<li><code>return</code>&#35821;&#21477;&#20174;&#20989;&#25968;&#36820;&#22238;&#19968;&#20010;&#20540;&#12290;&#19981;&#24102;&#34920;&#36798;&#24335;&#21442;&#25968;&#30340;return&#36820;&#22238;None.&#20989;&#25968;&#30452;&#25509;&#32467;&#26463;&#21518;&#20063;&#36820;&#22238;None&#12290;</li>
<li>&#35821;&#21477;<code>result.append(a)</code>&#35843;&#29992;&#23545;&#35937;&#21015;&#34920;&#23545;&#35937;<code>result</code>&#30340;&#19968;&#20010;&#26041;&#27861;&#12290;&#36825;&#31181;&#26041;&#27861;&#38582;&#23646;&#20110;&#26576;&#20010;&#23545;&#35937;&#30340;&#20989;&#25968;&#65292;&#36890;&#29992;&#24418;&#24335;&#20026;&#65306;<strong>obj.methodname</strong>&#30340;&#24418;&#24335;&#65292;&#20854;&#20013;obj&#26159;&#26576;&#20010;&#23545;&#35937;&#25110;&#32773;&#19968;&#20010;&#34920;&#36798;&#24335;&#65292;&#32780;methodname&#21017;&#26159;&#30001;&#23545;&#35937;&#31867;&#22411;&#23450;&#20041;&#30340;&#26041;&#27861;&#30340;&#21517;&#31216;&#12290;&#19981;&#21516;&#31867;&#22411;&#23450;&#20041;&#19981;&#21516;&#30340;&#26041;&#27861;&#65292;&#32780;&#19981;&#21516;&#31867;&#22411;&#30340;&#26041;&#27861;&#21487;&#33021;&#20855;&#26377;&#30456;&#21516;&#30340;&#21517;&#23383;&#65292;&#19988;&#19981;&#20250;&#24341;&#36215;&#27495;&#20041;&#12290;&#20063;&#21487;&#20197;&#20351;&#29992;class&#23450;&#20041;&#33258;&#24049;&#30340;&#23545;&#35937;&#31867;&#22411;&#21644;&#26041;&#27861;&#12290;&#26412;&#20363;&#20013;&#65292;<code>append()</code>&#26041;&#27861;&#26159;list&#23545;&#35937;&#23450;&#20041;&#30340;&#65292;&#20854;&#20316;&#29992;&#26159;&#22312;&#21015;&#34920;&#30340;&#26411;&#23614;&#28155;&#21152;&#19968;&#20010;&#26032;&#30340;&#20803;&#32032;&#65292;&#31561;&#21516;&#20110;<code>result = result + [a]</code>&#65292;&#20294;&#26356;&#20855;&#25928;&#29575;&#12290;</li>
</ul>
<h3 id="&#26356;&#22810;&#20851;&#20110;&#23450;&#20041;&#20989;&#25968;">4.7 &#26356;&#22810;&#20851;&#20110;&#23450;&#20041;&#20989;&#25968;</h3>
<p>&#21487;&#20197;&#23450;&#20041;&#20855;&#26377;&#21487;&#21464;&#25968;&#30446;&#30340;&#21442;&#25968;&#30340;&#20989;&#25968;&#65292;&#20854;&#20013;&#26377;&#19977;&#31181;&#20989;&#25968;&#34892;&#20070;&#65292;&#21487;&#20197;&#32467;&#21512;&#20351;&#29992;&#12290;</p>
<h4 id="&#40664;&#35748;&#21442;&#25968;&#20540;">4.7.1 &#40664;&#35748;&#21442;&#25968;&#20540;</h4>
<p>&#26368;&#26377;&#29992;&#30340;&#24418;&#24335;&#26159;&#25351;&#23450;&#19968;&#20010;&#25110;&#22810;&#20010;&#21442;&#25968;&#30340;&#40664;&#35748;&#20540;&#65292;&#36825;&#31181;&#26041;&#27861;&#21019;&#24314;&#20989;&#25968;&#26102;&#34987;&#35843;&#29992;&#65292;&#21487;&#20197;&#24102;&#26377;&#27604;&#23450;&#20041;&#30340;&#35201;&#23569;&#30340;&#21442;&#25968;&#65292;&#20363;&#22914;&#65306;</p>
<pre><code>def ask_ok(prompt,retries=4,complaint=&quot;Yes or no, Please!&quot;):
        while Ture:
                ok = input(prompt)
                if ok in (&#39;y&#39;, &#39;ye&#39;, &#39;yes&#39;):
                        return True
                if ok in (&#39;n&#39;, &#39;no&#39;, &#39;nop&#39;, &#39;nope&#39;):
                        return False
                retries = retries - 1
                if retries &lt; 0:
                        raise OSError(&#39;uncooperative user&#39;)
                print (complaint)</code></pre>
<p>&#36825;&#20010;&#20989;&#25968;&#21487;&#20197;&#36890;&#36807;&#20197;&#19979;&#20960;&#31181;&#26041;&#24335;&#35843;&#29992;&#65306;</p>
<ol style="list-style-type: decimal">
<li>&#21482;&#32473;&#20986;&#24378;&#21046;&#21442;&#25968;prompt:<code>ask_ok('Do you really want to quit?')</code></li>
<li>&#32473;&#20986;&#31532;&#19968;&#20010;&#21487;&#36873;&#21442;&#25968;&#65306;<code>ask_ok('Ok to overwrite the file?',2)</code></li>
<li>&#32473;&#20986;&#25152;&#26377;&#21442;&#25968;: <code>ask_ok('OK to overwrite the file?',2,'Come on, only yes or no!')</code></li>
</ol>
<p>&#27492;&#31034;&#20363;&#36824;&#24341;&#20837;&#20102;<code>in</code>&#20851;&#38190;&#23383;&#65292;&#23427;&#27979;&#35797;&#19968;&#20010;&#24207;&#21015;&#26159;&#21542;&#21253;&#21547;&#29305;&#23450;&#30340;&#20540;&#12290;</p>
<p>&#27492;&#22806;&#65292;&#40664;&#35748;&#20540;&#30340;&#35745;&#31639;&#22312;&#23450;&#20041;&#22495;&#20013;&#30340;&#20989;&#25968;&#23450;&#20041;&#30340;&#26102;&#20505;&#23601;&#24050;&#30830;&#23450;&#65292;&#20363;&#22914;&#65306;</p>
<pre><code>i=5

def f(arg=i)
        print(arg)

i=6
f()  # will get 5</code></pre>
<ul>
<li><strong>&#37325;&#35201;&#30340;&#35686;&#21578;</strong>&#65306;&#40664;&#35748;&#20540;&#21482;&#35745;&#31639;&#19968;&#27425;&#65292;&#36825;&#20351;&#24471;&#40664;&#35748;&#20540;&#26159;&#21015;&#34920;&#12289;&#23383;&#20856;&#25110;&#22823;&#37096;&#20998;&#31867;&#30340;&#23454;&#20363;&#26102;&#20250;&#26377;&#25152;&#19981;&#21516;&#65292;&#20363;&#22914;&#65292;&#19979;&#38754;&#30340;&#20989;&#25968;&#22312;&#21518;&#32493;&#35843;&#29992;&#20013;&#20250;&#32047;&#31215;&#20256;&#32473;&#23427;&#20204;&#30340;&#21442;&#25968;&#65306;</li>
</ul>
<pre><code>def f(a,L=[]):
        L.append(a)
        return L

print (f(1)) # [1]
print (f(2)) # [1,2]
print (f(3)) # [1,2,3]</code></pre>
<p>&#33509;&#19981;&#35753;&#40664;&#35748;&#20540;&#22312;&#38543;&#21518;&#30340;&#35843;&#29992;&#20013;&#20849;&#20139;&#65292;&#21487;&#20197;&#36825;&#26679;&#65306;</p>
<pre><code>def f(a, L=None):
        if L is None:
                L = []
        L.append(a)
        return L</code></pre>
<h4 id="&#20851;&#38190;&#23383;&#21442;&#25968;">4.7.2 &#20851;&#38190;&#23383;&#21442;&#25968;</h4>
<p>&#20989;&#25968;&#20063;&#21487;&#20197;&#36890;&#36807;<code>kwarg = value</code>&#36825;&#31181;<code>**&#20851;&#38190;&#23383;=&#21442;&#25968;**</code>&#30340;&#24418;&#24335;&#35843;&#29992;&#65292;&#20363;&#22914;&#65306;</p>
<pre><code>def parrot(voltage, state=&#39;a stiff&#39;, action=&#39;voom&#39;, type=&#39;Norwegian Blue&#39;):
        print (&quot;-- This parrot wouldn&#39;t&quot;, action, end=&#39; &#39;)
        print (&quot;if you put&quot;, voltage, &quot;volts throug it.&quot;)
        print (&quot;-- Lovely plumage, the&quot;, type)
        print (&quot;-- It&#39;s&quot;, state, &quot;!&quot;)</code></pre>
<p>&#35813;&#20989;&#25968;&#25509;&#21463;&#19968;&#20010;&#24517;&#36873;&#21442;&#25968;<code>voltage</code>&#21644;&#19977;&#20010;&#21487;&#36873;&#21442;&#25968;<code>state, action, type</code>&#65292;&#21487;&#20197;&#29992;&#19979;&#21015;&#20219;&#24847;&#19968;&#31181;&#26041;&#24335;&#35843;&#29992;&#65306;</p>
<pre><code>parrot(1000)                                          # 1 positional argument
parrot(voltage=1000)                                  # 1 keyword argument
parrot(voltage=1000000, action=&#39;VOOOOOM&#39;)             # 2 keyword arguments
parrot(action=&#39;VOOOOOM&#39;, voltage=1000000)             # 2 keyword arguments
parrot(&#39;a million&#39;, &#39;bereft of life&#39;, &#39;jump&#39;)         # 3 positional arguments
parrot(&#39;a thousand&#39;, state=&#39;pushing up the daisies&#39;)  # 1 positional, 1 keyword</code></pre>
<p>&#32780;&#19979;&#38754;&#30340;&#36825;&#20123;&#35843;&#29992;&#37117;&#26159;&#26080;&#25928;&#30340;&#65306;</p>
<pre><code>parrot()                     # required argument missing
parrot(voltage=5.0, &#39;dead&#39;)  # non-keyword argument after a keyword argument
parrot(110, voltage=220)     # duplicate value for the same argument
parrot(actor=&#39;John Cleese&#39;)  # unknown keyword argument</code></pre>
<p>&#30001;&#27492;&#21487;&#20197;&#21457;&#29616;&#65306;&#22312;&#20989;&#25968;&#35843;&#29992;&#20013;&#65292;&#20851;&#38190;&#23383;&#30340;&#21442;&#25968;&#24517;&#39035;&#36319;&#38543;&#22312;&#20301;&#32622;&#21442;&#25968;&#21518;&#38754;&#65292;&#20256;&#36882;&#30340;&#25152;&#26377;&#20851;&#38190;&#23383;&#21442;&#25968;&#24517;&#39035;&#19982;&#20989;&#25968;&#25509;&#25910;&#21040;&#26576;&#20010;&#21442;&#25968;&#30456;&#21305;&#37197;&#65292;&#20294;&#23427;&#20204;&#30340;&#39034;&#24207;&#24182;&#19981;&#37325;&#35201;&#65292;&#36825;&#20063;&#21253;&#25324;&#38750;&#21487;&#36873;&#21442;&#25968;&#12290;&#20219;&#20309;&#21442;&#25968;&#37117;&#19981;&#21487;&#22810;&#27425;&#36171;&#20540;&#65292;&#20363;&#22914;&#65306;</p>
<pre class="{python}"><code>def function(a)
        pass


function(0,a=0)
Traceback (most recent call last):
  File &quot;&lt;stdin&gt;&quot;, line 1, in ?
TypeError: function() got multiple values for keyword argument &#39;a&#39;</code></pre>
<p>&#24403;&#26368;&#21518;&#19968;&#20010;&#24418;&#21442;&#20197;<code>**name</code>&#24418;&#24335;&#20986;&#29616;&#65292;&#23427;&#25509;&#21463;&#19968;&#20010;&#23383;&#20856;&#65292;&#35813;&#23383;&#20856;&#21253;&#21547;&#20102;&#25152;&#26377;&#26410;&#20986;&#29616;&#22312;&#24418;&#24335;&#21442;&#25968;&#21015;&#34920;&#20013;&#30340;&#20851;&#38190;&#23383;&#21442;&#25968;&#12290;&#23427;&#36824;&#21487;&#33021;&#19982;<code>**name</code>&#24418;&#24335;&#30340;&#21442;&#25968;&#32452;&#21512;&#20351;&#29992;&#65292;<code>*name</code>&#25509;&#21463;&#19968;&#20010;&#21253;&#21547;&#25152;&#26377;&#27809;&#26377;&#20986;&#29616;&#22312;&#24418;&#24335;&#21442;&#25968;&#21015;&#34920;&#20013;&#30340;&#20301;&#32622;&#21442;&#25968;&#20803;&#32452;&#12290;&#65288;&#27880;&#65306;<code>*name</code>&#24517;&#39035;&#20986;&#29616;&#22312;<code>**name</code>&#20043;&#21069;&#12290;&#65289;&#20363;&#22914;&#65306;</p>
<pre><code>def cheeseshop(kind, *arguments, **keywords):
        print(&quot;-- Do you have any&quot;, kind, &quot;?&quot;)
    print(&quot;-- I&#39;m sorry, we&#39;re all out of&quot;, kind)
    for arg in arguments:
        print(arg)
    print(&quot;-&quot; * 40)
    keys = sorted(keywords.keys())
    for kw in keys:
        print(kw, &quot;:&quot;, keywords[kw])</code></pre>
<p>&#23427;&#21487;&#20197;&#36825;&#26679;&#35843;&#29992;&#65306;</p>
<pre><code>cheeseshop(&quot;Limburger&quot;, &quot;It&#39;s very runny, sir.&quot;,
                   &quot;It&#39;s really very, VERY runny, sir.&quot;,
                     shopkeeper=&quot;Micheal Palin&quot;,
                     clinet=&quot;John Cleese&quot;,
                     sketch=&quot;Cheese Shop Sketch&quot;)</code></pre>
<p>&#23427;&#20250;&#36755;&#20986;&#65306;</p>
<pre><code>-- Do you have any Limburger ?
-- I&#39;m sorry, we&#39;re all out of Limburger
It&#39;s very runny, sir.
It&#39;s really very, VERY runny, sir.
----------------------------------------
client : John Cleese
shopkeeper : Michael Palin
sketch : Cheese Shop Sketch</code></pre>
<blockquote>
<p>&#27880;&#24847;&#22312;&#25171;&#21360;&#20851;&#38190;&#23383;&#21442;&#25968;&#20043;&#21069;&#65292;&#36890;&#36807;&#23545;&#20851;&#38190;&#23383;&#23383;&#20856; <code>keys()</code> &#26041;&#27861;&#30340;&#32467;&#26524;&#36827;&#34892;&#25490;&#24207;&#65292;&#29983;&#25104;&#20102;&#20851;&#38190;&#23383;&#21442;&#25968;&#21517;&#30340;&#21015;&#34920;&#65307;&#22914;&#26524;&#19981;&#36825;&#26679;&#20570;&#65292;&#25171;&#21360;&#20986;&#26469;&#30340;&#21442;&#25968;&#30340;&#39034;&#24207;&#26159;&#26410;&#23450;&#20041;&#30340;&#12290;</p>
</blockquote>
<h4 id="&#20219;&#24847;&#21442;&#25968;&#21015;&#34920;">4.7.3 &#20219;&#24847;&#21442;&#25968;&#21015;&#34920;</h4>
<p>&#19968;&#20010;&#26368;&#19981;&#24120;&#29992;&#30340;&#22330;&#26223;&#26159;&#35753;&#20989;&#25968;&#21487;&#20197;&#34987;&#21487;&#21464;&#20010;&#25968;&#30340;&#21442;&#25968;&#35843;&#29992;&#65292;&#36825;&#20123;&#21442;&#25968;&#34987;&#25918;&#22312;&#19968;&#20010;&#20803;&#32452;&#20013;&#12290;&#22312;&#21487;&#21464;&#20010;&#25968;&#30340;&#21442;&#25968;&#20043;&#21069;&#65292;&#21487;&#20197;&#26377;&#38646;&#21040;&#22810;&#20010;&#26222;&#36890;&#30340;&#21442;&#25968;&#12290;</p>
<pre><code>def write_multiple_items(file, separator, *args):
        file.write(separator.join(args))</code></pre>
<p>&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#36825;&#20123;&#21487;&#21464;&#21442;&#25968;&#20301;&#20110;&#24418;&#24335;&#21442;&#25968;&#21015;&#34920;&#30340;&#26368;&#21518;&#65292;&#22240;&#20026;&#23427;&#20204;&#20250;&#25628;&#38598;&#20256;&#36882;&#32473;&#20989;&#25968;&#30340;&#25152;&#26377;&#21097;&#20313;&#21442;&#25968;&#12290;&#20986;&#29616;&#22312;<code>*args</code>&#21442;&#25968;&#21518;&#38754;&#30340;&#20219;&#20309;&#24418;&#24335;&#21442;&#25968;&#37117;&#26159;<code>keyword-only</code>&#21442;&#25968;&#65292;&#24847;&#21619;&#30528;&#23427;&#20204;&#21482;&#33021;&#20316;&#20026;&#20851;&#38190;&#23383;&#21442;&#25968;&#32780;&#19981;&#33021;&#20316;&#20026;&#20301;&#32622;&#21442;&#25968;&#65292;&#20363;&#22914;&#65306;</p>
<pre><code>def concat(*args,sep=&quot;/&quot;)
        return sep.join(args)

concat(&quot;earth&quot;, &quot;mars&quot;, &quot;venus&quot;)                    #&#39;earth/mars/venus&#39;
concat(&quot;earth&quot;, &quot;mars&quot;, &quot;venus&quot;, sep=&quot;.&quot;) # &#39;earth.mars.venus&#39;</code></pre>
<h4 id="&#21442;&#25968;&#21015;&#34920;&#30340;&#20998;&#25286;">4.7.4 &#21442;&#25968;&#21015;&#34920;&#30340;&#20998;&#25286;</h4>
<p>&#24403;&#20256;&#36882;&#30340;&#21442;&#25968;&#24050;&#32463;&#26159;&#19968;&#20010;&#21015;&#34920;&#25110;&#32773;&#20803;&#32452;&#26102;&#65292;&#24773;&#20917;&#19982;&#20043;&#21069;&#30456;&#21453;&#65292;&#38656;&#35201;&#20998;&#25286;&#36825;&#20123;&#21442;&#25968;&#12290;&#22240;&#20026;&#20989;&#25968;&#35843;&#29992;&#35201;&#27714;&#29420;&#31435;&#30340;&#20301;&#32622;&#21442;&#25968;&#12290;&#20363;&#22914;&#65292;&#20869;&#32622;&#30340;<code>range()</code>&#20989;&#25968;&#26399;&#26395;&#21333;&#29420;&#30340;start&#21644;stop&#21442;&#25968;&#65292;&#22914;&#33509;&#23427;&#20204;&#19981;&#26159;&#29420;&#31435;&#30340;&#65292;&#20989;&#25968;&#35843;&#29992;&#26102;&#38656;&#35201;&#20351;&#29992;<code>*</code>&#25805;&#20316;&#31526;&#23558;&#21442;&#25968;&#20174;&#21015;&#34920;&#25110;&#20803;&#32452;&#20013;&#20998;&#25286;&#24320;&#26469;&#65306;</p>
<pre><code>list(range(3,6))        #[3,4,5]
args=[3,6]
list(range(*args))  #[3,4,5]</code></pre>
<p>&#20197;&#21516;&#26679;&#30340;&#26041;&#24335;&#65292;&#21487;&#20197;&#29992;<code>**</code>&#25805;&#20316;&#31526;&#35753;&#23383;&#20856;&#20256;&#36882;&#20851;&#38190;&#23383;&#21442;&#25968;&#65306;</p>
<pre><code>def parrot(voltage, state=&#39;a stiff&#39;, action=&#39;voom&#39;):
     print(&quot;-- This parrot wouldn&#39;t&quot;, action, end=&#39; &#39;)
     print(&quot;if you put&quot;, voltage, &quot;volts through it.&quot;, end=&#39; &#39;)
     print(&quot;E&#39;s&quot;, state, &quot;!&quot;)

d = {&quot;voltage&quot;: &quot;four million&quot;, &quot;state&quot;: &quot;bleedin&#39; demised&quot;, &quot;action&quot;: &quot;VOOM&quot;}
parrot(**d)
-- This parrot wouldn&#39;t VOOM if you put four million volts through it. E&#39;s bleedin&#39; demised !</code></pre>
<h4 id="lambda&#34920;&#36798;&#24335;">4.7.5 lambda&#34920;&#36798;&#24335;</h4>
<p>&#21487;&#20197;&#20351;&#29992;<code>lambda</code>&#20851;&#38190;&#23383;&#21019;&#24314;&#23567;&#30340;&#21311;&#21517;&#20989;&#25968;&#12290;&#35813;&#20989;&#25968;&#36820;&#22238;&#20854;&#20004;&#20010;&#21442;&#25968;&#30340;&#24635;&#21644;&#65306;<code>lambda a, b: a+b</code>.lambda&#20989;&#25968;&#21487;&#20197;&#29992;&#20110;&#20219;&#20309;&#20989;&#25968;&#23545;&#35937;&#38656;&#35201;&#30340;&#22320;&#26041;&#12290;&#22312;&#35821;&#27861;&#19978;&#65292;&#23427;&#20204;&#23616;&#38480;&#20110;&#21482;&#33021;&#26377;&#19968;&#20010;&#21333;&#29420;&#30340;&#34920;&#36798;&#24335;&#65307;&#22312;&#35821;&#20041;&#19978;&#65292;&#23427;&#20204;&#21482;&#26159;&#26222;&#36890;&#20989;&#25968;&#23450;&#20041;&#30340;&#35821;&#27861;&#31958;&#12290;&#20687;&#23884;&#22871;&#30340;&#20989;&#25968;&#23450;&#20041;&#65292;lambda&#20989;&#25968;&#21487;&#20197;&#20174;&#21253;&#21547;&#33539;&#22260;&#24341;&#29992;&#21464;&#37327;&#65306;</p>
<pre><code>def make_incrementor(n)
        return lambda x: x+n

f = make_incrementor(42)
f(0)    # 42
f(1)    # 43</code></pre>
<p>&#19978;&#38754;&#30340;&#31034;&#20363;&#20351;&#29992; lambda &#34920;&#36798;&#24335;&#36820;&#22238;&#19968;&#20010;&#20989;&#25968;&#12290;&#21478;&#19968;&#20010;&#29992;&#36884;&#26159;&#23558;&#19968;&#20010;&#23567;&#20989;&#25968;&#20316;&#20026;&#21442;&#25968;&#20256;&#36882;&#65306;</p>
<pre><code>pairs = [(1, &#39;one&#39;), (2, &#39;two&#39;), (3, &#39;three&#39;), (4, &#39;four&#39;)]
pairs.sort(key=lambda pair: pair[1])
pairs
[(4, &#39;four&#39;), (1, &#39;one&#39;), (3, &#39;three&#39;), (2, &#39;two&#39;)]</code></pre>
<h4 id="&#25991;&#26723;&#23383;&#31526;&#20018;">4.7.6 &#25991;&#26723;&#23383;&#31526;&#20018;</h4>
<p>&#19979;&#38754;&#26159;&#19968;&#20123;&#20851;&#20110;&#25991;&#26723;&#23383;&#31526;&#20018;&#20869;&#23481;&#21644;&#26684;&#24335;&#30340;&#24815;&#20363;&#12290;</p>
<p>&#31532;&#19968;&#34892;&#27704;&#36828;&#24212;&#35813;&#26159;&#23545;&#35937;&#29992;&#36884;&#30340;&#31616;&#30701;&#12289;&#31934;&#30830;&#30340;&#24635;&#36848;&#12290;&#20026;&#20102;&#31616;&#21333;&#36215;&#35265;&#65292;&#19981;&#24212;&#35813;&#26126;&#30830;&#30340;&#38472;&#36848;&#23545;&#35937;&#30340;&#21517;&#23383;&#25110;&#31867;&#22411;&#65292;&#22240;&#20026;&#36825;&#20123;&#20449;&#24687;&#21487;&#20197;&#20174;&#21035;&#30340;&#36884;&#24452;&#20102;&#35299;&#21040;&#65288;&#38500;&#38750;&#36825;&#20010;&#21517;&#23383;&#30896;&#24039;&#23601;&#26159;&#25551;&#36848;&#36825;&#20010;&#20989;&#25968;&#25805;&#20316;&#30340;&#21160;&#35789;&#65289;&#12290;&#36825;&#19968;&#34892;&#24212;&#35813;&#20197;&#22823;&#20889;&#23383;&#27597;&#24320;&#22836;&#65292;&#24182;&#20197;&#21477;&#21495;&#32467;&#23614;&#12290;</p>
<p>&#22914;&#26524;&#22312;&#25991;&#26723;&#23383;&#31526;&#20018;&#20013;&#26377;&#26356;&#22810;&#30340;&#34892;&#65292;&#31532;&#20108;&#34892;&#24212;&#35813;&#26159;&#31354;&#30333;&#65292;&#22312;&#35270;&#35273;&#19978;&#25226;&#25688;&#35201;&#19982;&#21097;&#20313;&#30340;&#25551;&#36848;&#20998;&#31163;&#24320;&#26469;&#12290;&#20197;&#19979;&#21508;&#34892;&#24212;&#35813;&#26159;&#19968;&#27573;&#25110;&#22810;&#27573;&#25551;&#36848;&#23545;&#35937;&#30340;&#35843;&#29992;&#32422;&#23450;&#12289; &#20854;&#21103;&#20316;&#29992;&#31561;&#12290;</p>
<p>Python &#35299;&#37322;&#22120;&#19981;&#20250;&#20174;&#22810;&#34892;&#30340;&#25991;&#26723;&#23383;&#31526;&#20018;&#20013;&#21435;&#38500;&#32553;&#36827;&#65292;&#25152;&#20197;&#24517;&#35201;&#30340;&#26102;&#20505;&#22788;&#29702;&#25991;&#26723;&#23383;&#31526;&#20018;&#30340;&#24037;&#20855;&#24212;&#24403;&#33258;&#24049;&#28165;&#38500;&#32553;&#36827;&#12290;&#36825;&#36890;&#36807;&#20351;&#29992;&#20197;&#19979;&#32422;&#23450;&#21487;&#20197;&#36798;&#21040;&#12290;&#31532;&#19968;&#34892;&#20043;&#21518; &#30340;&#31532;&#19968;&#20010;&#38750;&#31354;&#34892;&#23383;&#31526;&#20018;&#30830;&#23450;&#25972;&#20010;&#25991;&#26723;&#23383;&#31526;&#20018;&#30340;&#32553;&#36827;&#30340;&#37327;&#12290;&#65288;&#25105;&#20204;&#19981;&#29992;&#31532;&#19968;&#34892;&#26159;&#22240;&#20026;&#23427;&#36890;&#24120;&#32039;&#38752;&#30528;&#23383;&#31526;&#20018;&#36215;&#22987;&#30340;&#24341;&#21495;&#65292;&#20854;&#32553;&#36827;&#26684;&#24335;&#19981;&#26126;&#26224;&#12290;&#65289;&#25152;&#26377;&#34892;&#36215;&#22987;&#30340;&#31561;&#20110;&#32553;&#36827;&#37327;&#30340;&#31354;&#26684;&#37117;&#23558;&#34987;&#36807;&#28388;&#25481;&#12290;&#19981;&#24212;&#35813;&#21457;&#29983;&#32553;&#36827;&#36739;&#23569;&#30340;&#34892;&#65292;&#20294;&#22914;&#26524;&#20182;&#20204;&#21457;&#29983;&#65292;&#24212;&#21435;&#38500;&#25152;&#26377;&#20854;&#21069;&#23548;&#31354;&#30333;&#12290;&#30041;&#30333;&#30340;&#38271;&#24230;&#24212;&#24403;&#31561;&#20110;&#25193;&#23637;&#21046;&#34920;&#31526;&#30340;&#23485;&#24230;&#65288;&#27491;&#24120;&#26159; 8 &#20010;&#31354;&#26684;&#65289;&#12290;</p>
<p>&#36825;&#37324;&#26159;&#19968;&#20010;&#22810;&#34892;&#25991;&#26723;&#23383;&#31526;&#20018;&#30340;&#31034;&#20363;&#65306;</p>
<pre><code>def my_function():
     &quot;&quot;&quot;Do nothing, but document it.

     No, really, it doesn&#39;t do anything.
     &quot;&quot;&quot;
     pass

print(my_function.__doc__)
## output
Do nothing, but document it.

    No, really, it doesn&#39;t do anything.</code></pre>
<h4 id="&#20989;&#25968;&#27880;&#37322;">4.7.7 &#20989;&#25968;&#27880;&#37322;</h4>
<blockquote>
<p>Function annotations are completely optional metadata information about the types used by user-defined functions (see PEP 484 for more information).</p>
</blockquote>
<p>&#27880;&#37322;&#20197;&#23383;&#20856;&#30340;&#24418;&#24335;&#23384;&#20648;&#22312;&#20989;&#25968;&#30340;<code>__annotations__</code>&#23646;&#24615;&#20013;&#65292;&#23545;&#20989;&#25968;&#30340;&#20854;&#23427;&#20219;&#20309;&#37096;&#20998;&#37117;&#27809;&#26377;&#24433;&#21709;&#12290;Parameter annotations are defined by a colon after the parameter name, followed by an expression evaluating to the value of the annotation.Return annotations are defined by a literal -&gt;, followed by an expression, between the parameter list and the colon denoting the end of the def statement.&#19979;&#38754;&#30340;&#31034;&#20363;&#21253;&#21547;&#19968;&#20010;&#20301;&#32622;&#21442;&#25968;&#65292;&#19968;&#20010;&#20851;&#38190;&#23383;&#21442;&#25968;&#65292;&#21644;&#27809;&#26377;&#24847;&#20041;&#30340;&#36820;&#22238;&#20540;&#27880;&#37322;&#12290;</p>
<pre><code>def f(ham: str, eggs: str = &#39;eggs&#39;) -&gt; str:
     print(&quot;Annotations:&quot;, f.__annotations__)
     print(&quot;Arguments:&quot;, ham, eggs)
     return ham + &#39; and &#39; + eggs

f(&#39;spam&#39;)
###
Annotations: {&#39;ham&#39;: &lt;class &#39;str&#39;&gt;, &#39;return&#39;: &lt;class &#39;str&#39;&gt;, &#39;eggs&#39;: &lt;class &#39;str&#39;&gt;}
Arguments: spam eggs
&#39;spam and eggs&#39;</code></pre>
<h3 id="&#25554;&#26354;&#32534;&#30721;&#39118;&#26684;">4.8 &#25554;&#26354;&#65306;&#32534;&#30721;&#39118;&#26684;</h3>
<p>&#26082;&#28982;&#20320;&#23558;&#35201;&#32534;&#20889;&#26356;&#38271;&#26356;&#22797;&#26434;&#30340; Python &#29255;&#27573;&#65292;&#36825;&#26159;&#35848;&#19968;&#35848;<strong>&#32534;&#30721;&#39118;&#26684;</strong> &#30340;&#22909;&#26102;&#26426;&#12290;&#22823;&#22810;&#25968;&#35821;&#35328;&#21487;&#20197;&#32534;&#20889;&#25104;&#65288;&#25110;&#32773;&#26356;&#20934;&#30830;&#22320;&#35762;&#65292;&#26684;&#24335;&#21270;&#25104;&#65289;&#19981;&#21516;&#30340;&#39118;&#26684;&#65307;&#20854;&#20013;&#26377;&#19968;&#20123;&#20250;&#27604;&#20854;&#20182;&#39118;&#26684;&#26356;&#20855;&#21487;&#35835;&#24615;&#12290;&#35753;&#20320;&#30340;&#20195;&#30721;&#23545;&#21035;&#20154;&#26356;&#26131;&#35835;&#27704;&#36828;&#26159;&#20010;&#22909;&#24819;&#27861;&#65292;&#20859;&#25104;&#33391;&#22909;&#30340;&#32534;&#30721;&#39118;&#26684;&#23545;&#27492;&#26377;&#24456;&#22823;&#30340;&#24110;&#21161;&#12290;</p>
<p>&#23545;&#20110; Python &#32780;&#35328;&#65292;<code>PEP 8</code> &#24050;&#25104;&#20026;&#22823;&#22810;&#25968;&#39033;&#30446;&#36981;&#24490;&#30340;&#39118;&#26684;&#25351;&#21335;&#65307;&#23427;&#32473;&#20986;&#20102;&#19968;&#20010;&#39640;&#24230;&#21487;&#35835;&#65292;&#35270;&#35273;&#21451;&#22909;&#30340;&#32534;&#30721;&#39118;&#26684;&#12290;&#27599;&#20010; Python &#24320;&#21457;&#32773;&#24212;&#35813;&#38405;&#35835;&#19968;&#19979;&#65307;&#36825;&#37324;&#26159;&#20026;&#20320;&#25552;&#21462;&#20986;&#26469;&#30340;&#26368;&#37325;&#35201;&#30340;&#35201;&#28857;&#65306;</p>
<ul>
<li>&#20351;&#29992; 4 &#20010;&#31354;&#26684;&#30340;&#32553;&#36827;&#65292;&#19981;&#35201;&#20351;&#29992;&#21046;&#34920;&#31526;&#12290;<br />
 4 &#20010;&#31354;&#26684;&#26159;&#23567;&#32553;&#36827;&#65288;&#20801;&#35768;&#26356;&#28145;&#30340;&#23884;&#22871;&#65289;&#21644;&#22823;&#32553;&#36827;&#65288;&#26131;&#20110;&#38405;&#35835;&#65289;&#20043;&#38388;&#24456;&#22909;&#30340;&#25240;&#34935;&#12290;&#21046;&#34920;&#31526;&#20250;&#24341;&#36215;&#28151;&#20081;&#65292;&#26368;&#22909;&#24323;&#29992;&#12290;</li>
<li>&#25240;&#34892;&#20197;&#30830;&#20445;&#20854;&#19981;&#20250;&#36229;&#36807; 79 &#20010;&#23383;&#31526;&#12290;<br />
 &#36825;&#26377;&#21161;&#20110;&#23567;&#26174;&#31034;&#22120;&#29992;&#25143;&#38405;&#35835;&#65292;&#20063;&#21487;&#20197;&#35753;&#22823;&#26174;&#31034;&#22120;&#33021;&#24182;&#25490;&#26174;&#31034;&#20960;&#20010;&#20195;&#30721;&#25991;&#20214;&#12290;</li>
<li>&#20351;&#29992;&#31354;&#34892;&#20998;&#38548;&#20989;&#25968;&#21644;&#31867;&#65292;&#20197;&#21450;&#20989;&#25968;&#20869;&#30340;&#22823;&#22359;&#20195;&#30721;&#12290;</li>
<li>&#22914;&#26524;&#21487;&#33021;&#65292;&#27880;&#37322;&#29420;&#21344;&#19968;&#34892;&#12290;</li>
<li>&#20351;&#29992; docstrings&#12290;</li>
<li>&#36816;&#31639;&#31526;&#21608;&#22260;&#21644;&#36887;&#21495;&#21518;&#38754;&#20351;&#29992;&#31354;&#26684;&#65292;&#20294;&#26159;&#25324;&#21495;&#37324;&#20391;&#19981;&#21152;&#31354;&#26684;&#65306; a = f (1, 2) + g(3, 4)&#12290;</li>
<li>&#19968;&#33268;&#22320;&#21629;&#21517;&#24744;&#30340;&#31867;&#21644;&#20989;&#25968;&#65307;&#24120;&#35265;&#30340;&#20570;&#27861;&#26159;&#21629;&#21517;&#31867;&#30340;&#26102;&#20505;&#20351;&#29992;&#39548;&#23792;&#27861;&#65292;&#21629;&#21517;&#20989;&#25968;&#21644;&#26041;&#27861;&#30340;&#26102;&#20505;&#20351;&#29992;&#23567;&#20889;&#23383;&#27597;+&#19979;&#21010;&#32447;&#27861;&#12290;&#22987;&#32456;&#20351;&#29992;self&#20316;&#20026;&#26041;&#27861;&#30340;&#31532;&#19968;&#20010;&#21442;&#25968;&#30340;&#21517;&#31216; &#65288;&#35831;&#21442;&#35265;<code>&#21021;&#35782;&#31867;</code>&#26356;&#22810;&#30340;&#20851;&#20110;&#30340;&#31867;&#21644;&#26041;&#27861;&#65289;&#12290;</li>
<li>&#22914;&#26524;&#24076;&#26395;&#20320;&#30340;&#20195;&#30721;&#22312;&#22269;&#38469;&#21270;&#29615;&#22659;&#20013;&#20351;&#29992;&#65292;&#19981;&#35201;&#20351;&#29992;&#22855;&#29305;&#30340;&#32534;&#30721;&#12290;Python&#40664;&#35748;&#30340;UTF-8&#65292;&#25110;&#32773;&#32431; ASCII &#22312;&#20219;&#20309;&#24773;&#20917;&#19979;&#27704;&#36828;&#24037;&#20316;&#24471;&#26368;&#22909;&#12290;</li>
<li>&#21516;&#26679;&#22320;&#65292;&#22914;&#26524;&#35762;&#20854;&#23427;&#35821;&#35328;&#30340;&#20154;&#24456;&#23569;&#26377;&#26426;&#20250;&#38405;&#35835;&#25110;&#32500;&#25252;&#20320;&#30340;&#20195;&#30721;&#65292;&#19981;&#35201;&#20351;&#29992;&#38750;ASCII&#23383;&#31526;&#20316;&#20026;&#26631;&#35782;&#31526;&#12290;</li>
</ul>
<div class="footnotes">
<hr />
<ol>
<li id="fn1"><p>Actually, call by object reference would be a better description, since if a mutable object is passed, the caller will see any changes the callee makes to it (items inserted into a list).<a href="#fnref1">&#8617;</a></p></li>
</ol>
</div>
</body>
</html>
