<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <style type="text/css">
div.sourceCode { overflow-x: auto; }
table.sourceCode, tr.sourceCode, td.lineNumbers, td.sourceCode {
  margin: 0; padding: 0; vertical-align: baseline; border: none; }
table.sourceCode { width: 100%; line-height: 100%; }
td.lineNumbers { text-align: right; padding-right: 4px; padding-left: 4px; color: #aaaaaa; border-right: 1px solid #aaaaaa; }
td.sourceCode { padding-left: 5px; }
code > span.kw { color: #007020; font-weight: bold; } /* Keyword */
code > span.dt { color: #902000; } /* DataType */
code > span.dv { color: #40a070; } /* DecVal */
code > span.bn { color: #40a070; } /* BaseN */
code > span.fl { color: #40a070; } /* Float */
code > span.ch { color: #4070a0; } /* Char */
code > span.st { color: #4070a0; } /* String */
code > span.co { color: #60a0b0; font-style: italic; } /* Comment */
code > span.ot { color: #007020; } /* Other */
code > span.al { color: #ff0000; font-weight: bold; } /* Alert */
code > span.fu { color: #06287e; } /* Function */
code > span.er { color: #ff0000; font-weight: bold; } /* Error */
code > span.wa { color: #60a0b0; font-weight: bold; font-style: italic; } /* Warning */
code > span.cn { color: #880000; } /* Constant */
code > span.sc { color: #4070a0; } /* SpecialChar */
code > span.vs { color: #4070a0; } /* VerbatimString */
code > span.ss { color: #bb6688; } /* SpecialString */
code > span.im { } /* Import */
code > span.va { color: #19177c; } /* Variable */
code > span.cf { color: #007020; font-weight: bold; } /* ControlFlow */
code > span.op { color: #666666; } /* Operator */
code > span.bu { } /* BuiltIn */
code > span.ex { } /* Extension */
code > span.pp { color: #bc7a00; } /* Preprocessor */
code > span.at { color: #7d9029; } /* Attribute */
code > span.do { color: #ba2121; font-style: italic; } /* Documentation */
code > span.an { color: #60a0b0; font-weight: bold; font-style: italic; } /* Annotation */
code > span.cv { color: #60a0b0; font-weight: bold; font-style: italic; } /* CommentVar */
code > span.in { color: #60a0b0; font-weight: bold; font-style: italic; } /* Information */
  </style>
  <link rel="stylesheet" href="book.css" type="text/css" />
</head>
<body>
<h2 id="&#27169;&#22359;">6. &#27169;&#22359;</h2>
<p>&#20351;&#29992;Python&#35299;&#37322;&#22120;&#20197;&#20132;&#20114;&#27169;&#24335;&#36827;&#34892;&#31243;&#24207;&#35774;&#35745;&#65292;&#19981;&#20415;&#20110;&#20445;&#23384;&#31243;&#24207;&#25968;&#25454;&#12290;&#22240;&#27492;&#65292;&#32534;&#20889;&#31243;&#24207;&#26102;&#65292;&#26368;&#22909;&#20351;&#29992;&#25991;&#26412;&#32534;&#36753;&#22120;&#20808;&#32534;&#20889;&#22909;&#65292;&#28982;&#21518;&#20877;&#36816;&#34892;&#36825;&#20010;&#25991;&#20214;&#12290;&#36825;&#23601;&#26159;&#25152;&#35859;&#30340;&quot;<strong>&#33050;&#26412;</strong>&quot;&#12290;&#38543;&#30528;&#31243;&#24207;&#21464;&#38271;&#65292;&#26368;&#21518;&#23558;&#20854;&#20998;&#25104;&#20960;&#20010;&#25991;&#20214;&#65292;&#36825;&#26679;&#26356;&#26131;&#20110;&#32500;&#25252;&#12290;&#21478;&#22806;&#65292;&#33509;&#35201;&#22312;&#20854;&#20182;&#31243;&#24207;&#20013;&#20351;&#29992;&#24050;&#32534;&#20889;&#22909;&#30340;&#20989;&#25968;&#65292;&#19981;&#38656;&#35201;&#25226;&#20989;&#25968;&#25335;&#36125;&#21040;&#27599;&#20010;&#31243;&#24207;&#20013;&#12290;</p>
<p>&#20026;&#23454;&#29616;&#35813;&#21151;&#33021;&#65292;Python&#25552;&#20379;&#20102;&#19968;&#31181;&#21150;&#27861;&#65306;&#25226;&#23450;&#20041;&#30340;&#20989;&#25968;&#25918;&#21040;&#19968;&#20010;&#25991;&#20214;&#20013;&#65292;&#28982;&#21518;&#22312;&#33050;&#26412;&#25110;&#32773;&#20132;&#20114;&#26041;&#24335;&#20013;&#35843;&#29992;&#65292;&#36825;&#31181;&#25991;&#20214;&#31216;&#20043;&#20026;<strong>&#27169;&#22359;</strong>&#65307;&#27169;&#22359;&#20013;&#30340;&#23450;&#20041;&#21487;&#20197;&#23548;&#20837;&#20854;&#20182;&#27169;&#22359;&#25110;&#20027;&#27169;&#22359;&#20013;&#12290;</p>
<p>&#27169;&#22359;&#26159;&#21253;&#21547;python&#23450;&#20041;&#21644;&#22768;&#26126;&#30340;&#25991;&#20214;&#12290;&#25991;&#20214;&#21517;&#23601;&#26159;&#27169;&#22359;&#21517;&#21152;<code>.py</code>&#21518;&#32512;&#12290;&#22312;&#27169;&#22359;&#37324;&#65292;&#27169;&#22359;&#30340;&#21517;&#23383;&#21487;&#20197;&#30001;&#20840;&#23616;&#21464;&#37327;<code>__name__</code>&#30340;&#20540;&#24471;&#21040;&#12290;&#20363;&#22914;&#65292;&#29992;&#20320;&#21916;&#27426;&#30340;&#25991;&#20214;&#32534;&#36753;&#22120;&#22312;&#24403;&#21069;&#30446;&#24405;&#19979;&#21019;&#24314;&#19968;&#20010;&#21517;&#20026;<code>fibo.py</code>&#30340;&#25991;&#20214;&#65292;&#20854;&#20869;&#23481;&#22914;&#19979;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="co"># Fibonacci numbers module</span>

<span class="kw">def</span> fib(n):    <span class="co"># print Fibonacci series up to n</span>
    a, b <span class="op">=</span> <span class="dv">0</span>, <span class="dv">1</span>
    <span class="cf">while</span> b <span class="op">&lt;</span> n:
        <span class="bu">print</span>(b, end<span class="op">=</span><span class="st">&#39; &#39;</span>)
        a, b <span class="op">=</span> b, a<span class="op">+</span>b
    <span class="bu">print</span>()

<span class="kw">def</span> fib2(n): <span class="co"># return Fibonacci series up to n</span>
    result <span class="op">=</span> []
    a, b <span class="op">=</span> <span class="dv">0</span>, <span class="dv">1</span>
    <span class="cf">while</span> b <span class="op">&lt;</span> n:
        result.append(b)
        a, b <span class="op">=</span> b, a<span class="op">+</span>b
    <span class="cf">return</span> result</code></pre></div>
<p>&#29616;&#22312;&#21487;&#20197;&#22312;&#21035;&#30340;&#31243;&#24207;&#20013;&#35843;&#29992;&#35813;&#27169;&#22359;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> fibo
fibo.fib(<span class="dv">1000</span>)
fibo.fib2(<span class="dv">100</span>)
fibo.<span class="va">__name__</span>
<span class="co">## &#39;fibo&#39;</span></code></pre></div>
<p>&#22914;&#25171;&#31639;&#39057;&#32321;&#20351;&#29992;&#35813;&#20989;&#25968;&#65292;&#21487;&#20197;&#36171;&#32473;&#23427;&#19968;&#20010;&#26412;&#22320;&#30340;&#21464;&#37327;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">fib <span class="op">=</span> fibo.fib
fib(<span class="dv">500</span>)</code></pre></div>
<h3 id="&#28145;&#20837;&#27169;&#22359;">6.1 &#28145;&#20837;&#27169;&#22359;</h3>
<p>&#27169;&#22359;&#21487;&#20197;&#21253;&#21547;&#21487;&#25191;&#34892;&#35821;&#21477;&#20197;&#21450;&#20989;&#25968;&#30340;&#23450;&#20041;&#12290;&#36825;&#20123;&#35821;&#21477;&#36890;&#24120;&#29992;&#20110;&#21021;&#22987;&#21270;&#27169;&#22359;&#12290;&#23427;&#20204;&#21482;&#22312;<strong>&#31532;&#19968;&#27425;</strong> &#23548;&#20837;&#26102;&#25191;&#34892;&#12290;[^1]&#65288;&#22914;&#26524;&#25991;&#20214;&#20197;&#33050;&#26412;&#30340;&#26041;&#24335;&#25191;&#34892;&#65292;&#23427;&#20204;&#20063;&#20250;&#36816;&#34892;&#12290;&#65289;</p>
<p>&#27599;&#20010;&#27169;&#22359;&#37117;&#26377;&#33258;&#24049;&#30340;&#31169;&#26377;&#31526;&#21495;&#34920;&#65292;&#27169;&#22359;&#20869;&#23450;&#20041;&#30340;&#25152;&#26377;&#20989;&#25968;&#29992;&#20854;&#20316;&#20026;&#20840;&#23616;&#31526;&#21495;&#34920;&#12290;&#22240;&#27492;&#65292;&#27169;&#22359;&#30340;&#20316;&#32773;&#21487;&#20197;&#22312;&#27169;&#22359;&#37324;&#20351;&#29992;&#20840;&#23616;&#21464;&#37327;&#65292;&#32780;&#19981;&#29992;&#25285;&#24515;&#19982;&#26576;&#20010;&#29992;&#25143;&#30340;&#20840;&#23616;&#21464;&#37327;&#26377;&#20914;&#31361;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#20320;&#30693;&#36947;&#33258;&#24049;&#22312;&#20570;&#20160;&#20040;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#24341;&#29992;&#27169;&#22359;&#20989;&#25968;&#30340;&#34920;&#31034;&#27861;&#35775;&#38382;&#27169;&#22359;&#30340;&#20840;&#23616;&#21464;&#37327;&#65292;<code>modname.itemname</code>&#12290;</p>
<p>&#27169;&#22359;&#20013;&#21487;&#20197;&#23548;&#20837;&#20854;&#23427;&#27169;&#22359;&#12290;&#20064;&#24815;&#19978;&#23558;&#25152;&#26377;&#30340; <code>import</code> &#35821;&#21477;&#25918;&#22312;&#27169;&#22359;&#65288;&#25110;&#32773;&#33050;&#26412;&#65289;&#30340;&#24320;&#22987;&#65292;&#20294;&#36825;&#19981;&#26159;&#24378;&#21046;&#24615;&#30340;&#12290;&#34987;&#23548;&#20837;&#30340;&#27169;&#22359;&#30340;&#21517;&#23383;&#25918;&#22312;&#23548;&#20837;&#27169;&#22359;&#30340;&#20840;&#23616;&#31526;&#21495;&#34920;&#20013;&#12290;</p>
<p><code>import</code> &#35821;&#21477;&#30340;&#19968;&#20010;&#21464;&#20307;&#30452;&#25509;&#20174;&#34987;&#23548;&#20837;&#30340;&#27169;&#22359;&#20013;&#23548;&#20837;&#21517;&#23383;&#21040;&#27169;&#22359;&#30340;&#31526;&#21495;&#34920;&#20013;&#12290;&#20363;&#22914;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">from</span> fibo <span class="im">import</span> fib, fib2
fib(<span class="dv">500</span>)</code></pre></div>
<p>&#36825;&#19981;&#20250;&#21543;&#27169;&#22359;&#21517;&#23548;&#20837;&#21040;&#26412;&#22320;&#31526;&#21495;&#34920;&#20013;&#12290;</p>
<p>&#36824;&#26377;&#19968;&#31181;&#26041;&#24335;&#21487;&#20197;&#23548;&#20837;&#27169;&#22359;&#20013;&#23450;&#20041;&#30340;&#22810;&#26377;&#21517;&#23383;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">from</span> fibo <span class="im">import</span> <span class="op">*</span>
fib(<span class="dv">500</span>)</code></pre></div>
<p>&#36825;&#31181;&#26041;&#24335;&#19981;&#20250;&#23548;&#20837;&#20197;&#19979;&#21010;&#32447;<code>_</code>&#24320;&#22836;&#30340;&#21517;&#31216;&#12290;&#22823;&#22810;&#24773;&#20917;&#19979;&#65292;python&#31243;&#24207;&#21592;&#19981;&#20250;&#20351;&#29992;&#36825;&#20010;&#20415;&#21033;&#30340;&#26041;&#27861;&#65292;&#22240;&#20026;&#23427;&#20250;&#24341;&#20837;&#19968;&#31995;&#21015;&#26410;&#30693;&#30340;&#21517;&#31216;&#21040;&#35299;&#37322;&#22120;&#20013;&#65292;&#36825;&#24456;&#21487;&#33021;&#38544;&#34255;&#20320;&#23450;&#20041;&#30340;&#19968;&#20123;&#19996;&#35199;&#12290;</p>
<blockquote>
<p>&#27880;&#24847;&#65306;&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#19981;&#36190;&#25104;&#20174;&#19968;&#20010;&#27169;&#22359;&#25110;&#21253;&#20013;&#23548;&#20837;<code>*</code>&#65292;&#22240;&#20026;&#36825;&#36890;&#24120;&#20250;&#23548;&#33268;&#20195;&#30721;&#24456;&#38590;&#35835;&#12290;&#19981;&#36807;&#65292;&#22312;&#20132;&#20114;&#24335;&#20250;&#35805;&#20013;&#26159;&#21487;&#20197;&#36825;&#26679;&#29992;&#30340;&#65292;&#23427;&#21487;&#20197;&#35753;&#20320;&#23569;&#25970;&#19968;&#20123;&#20195;&#30721;&#12290;</p>
</blockquote>
<ul>
<li>&#27880;&#24847;&#65306;&#22788;&#20110;&#24615;&#33021;&#32771;&#34385;&#65292;&#27599;&#20010;&#27169;&#22359;&#22312;&#27599;&#20010;&#35299;&#37322;&#22120;&#20250;&#35805;&#20013;&#21482;&#23548;&#20837;&#19968;&#36941;&#65292;&#22240;&#27492;&#65292;&#22914;&#26524;&#20320;&#20462;&#25913;&#20102;&#20320;&#30340;&#27169;&#22359;&#65292;&#20320;&#24517;&#39035;&#37325;&#21551;&#35299;&#37322;&#22120;&#12290;&#25110;&#32773;&#65292;&#22914;&#26524;&#20320;&#23601;&#26159;&#24819;&#20132;&#20114;&#24335;&#22320;&#27979;&#35797;&#19968;&#19979;&#27169;&#22359;&#65292;&#21487;&#20197;&#20351;&#29992;<code>imp.reload()</code>&#65292;&#20363;&#22914;<code>import imp; imp.reload(modulename)</code>&#12290;</li>
</ul>
<h4 id="&#25191;&#34892;&#27169;&#22359;">6.1.1 &#25191;&#34892;&#27169;&#22359;</h4>
<p>&#24403;&#20320;&#29992;&#19979;&#38754;&#30340;&#26041;&#24335;&#36816;&#34892;&#19968;&#20010;python&#27169;&#22359;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">python fibo.py <span class="op">&lt;</span>arguments<span class="op">&gt;</span></code></pre></div>
<p>&#27169;&#22359;&#20013;&#30340;&#20195;&#30721;&#23558;&#20250;&#34987;&#25191;&#34892;&#65292;&#23601;&#34892;&#23548;&#20837;&#23427;&#19968;&#26679;&#65292;&#19981;&#36807;&#27492;&#26102;<code>__name__</code>&#34987;&#35774;&#32622;&#20026;&quot;<code>__main__</code>&quot;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#22914;&#26524;&#20320;&#22312;&#27169;&#22359;&#21518;&#21152;&#20837;&#20197;&#19979;&#20195;&#30721;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="cf">if</span> <span class="va">__name__</span> <span class="op">==</span> <span class="st">&quot;__main__&quot;</span>:
        <span class="im">import</span> sys
        fib(<span class="bu">int</span>(sys.argv[<span class="dv">1</span>]))</code></pre></div>
<p>&#23601;&#21487;&#20197;&#35753;&#27492;&#25991;&#20214;&#26082;&#21487;&#20197;&#20316;&#20026;&#21487;&#25191;&#34892;&#33050;&#26412;&#65292;&#20063;&#21487;&#20197;&#20316;&#20026;&#23548;&#20837;&#30340;&#27169;&#22359;&#65292;&#22240;&#20026;&#35299;&#26512;&#21629;&#20196;&#34892;&#30340;&#37027;&#37096;&#20998;&#20195;&#30721;&#21482;&#26377;&#22312;&#27169;&#22359;&#20316;&#20026;&#8220;main&#8221;&#25991;&#20214;&#26102;&#25165;&#34987;&#35843;&#29992;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode bash"><code class="sourceCode bash">$ <span class="kw">python</span> fibo.py 50
<span class="co">## 1 1 2 3 5 8 13 21 34</span></code></pre></div>
<p>&#22914;&#26524;&#27169;&#22359;&#26159;&#34987;&#23548;&#20837;&#30340;&#65292;&#23558;&#19981;&#20250;&#36816;&#34892;&#36825;&#27573;&#20195;&#30721;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> fibo</code></pre></div>
<h4 id="&#27169;&#22359;&#25628;&#32034;&#36335;&#24452;">6.1.2 &#27169;&#22359;&#25628;&#32034;&#36335;&#24452;</h4>
<p>&#24403;&#23548;&#20837;&#19968;&#20010;&#21517;&#20026;spam&#30340;&#27169;&#22359;&#26102;&#65292;&#35299;&#37322;&#22120;&#39318;&#20808;&#25628;&#32034;&#20855;&#26377;&#25913;&#21517;&#31216;&#30340;&#20869;&#32622;&#27169;&#22359;&#12290;&#22914;&#27809;&#26377;&#25214;&#21040;&#65292;&#23427;&#20250;&#25509;&#30528;&#21040;<code>sys.path</code>&#21464;&#37327;&#32473;&#20986;&#30340;&#30446;&#24405;&#20013;&#26597;&#25214;&#21517;&#20026;<code>spam.py</code>&#30340;&#25991;&#20214;&#12290;<code>sys.path</code>&#21464;&#37327;&#30340;&#21021;&#22987;&#20540;&#26469;&#33258;&#36825;&#20123;&#20301;&#32622;&#65306;</p>
<ul>
<li>&#33050;&#26412;&#25152;&#22312;&#30340;&#30446;&#24405;&#65288;&#22914;&#26410;&#25351;&#26126;&#25991;&#20214;&#65292;&#21017;&#20026;&#24403;&#21069;&#30446;&#24405;&#65289;</li>
<li><code>PYTHONPATH</code>&#65288;&#19968;&#20010;&#21253;&#21547;&#30446;&#24405;&#21517;&#30340;&#21015;&#34920;&#65292;&#19982;shell&#21464;&#37327;PATH&#30340;&#35821;&#27861;&#30456;&#21516;&#65289;</li>
<li>&#19982;&#23433;&#35013;&#30456;&#20851;&#30340;&#40664;&#35748;&#20540;&#12290;</li>
</ul>
<blockquote>
<p>Note: &#22312;&#25903;&#25345;&#31526;&#21495;&#36830;&#25509;&#30340;&#25991;&#20214;&#31995;&#32479;&#20013;&#65292;&#36755;&#20837;&#30340;&#33050;&#26412;&#25152;&#22312;&#30340;&#30446;&#24405;&#26159;&#31526;&#21495;&#36830;&#25509;&#25351;&#21521;&#30340;&#30446;&#24405;&#12290; &#25442;&#21477;&#35805;&#35828;&#20063;&#23601;&#26159;&#21253;&#21547;&#31526;&#21495;&#38142;&#25509;&#30340;&#30446;&#24405;&#19981;&#20250;&#34987;&#21152;&#21040;&#30446;&#24405;&#25628;&#32034;&#36335;&#24452;&#20013;&#12290;</p>
</blockquote>
</body>
</html>
