<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <style type="text/css">
div.sourceCode { overflow-x: auto; }
table.sourceCode, tr.sourceCode, td.lineNumbers, td.sourceCode {
  margin: 0; padding: 0; vertical-align: baseline; border: none; }
table.sourceCode { width: 100%; line-height: 100%; }
td.lineNumbers { text-align: right; padding-right: 4px; padding-left: 4px; color: #aaaaaa; border-right: 1px solid #aaaaaa; }
td.sourceCode { padding-left: 5px; }
code > span.kw { color: #007020; font-weight: bold; } /* Keyword */
code > span.dt { color: #902000; } /* DataType */
code > span.dv { color: #40a070; } /* DecVal */
code > span.bn { color: #40a070; } /* BaseN */
code > span.fl { color: #40a070; } /* Float */
code > span.ch { color: #4070a0; } /* Char */
code > span.st { color: #4070a0; } /* String */
code > span.co { color: #60a0b0; font-style: italic; } /* Comment */
code > span.ot { color: #007020; } /* Other */
code > span.al { color: #ff0000; font-weight: bold; } /* Alert */
code > span.fu { color: #06287e; } /* Function */
code > span.er { color: #ff0000; font-weight: bold; } /* Error */
code > span.wa { color: #60a0b0; font-weight: bold; font-style: italic; } /* Warning */
code > span.cn { color: #880000; } /* Constant */
code > span.sc { color: #4070a0; } /* SpecialChar */
code > span.vs { color: #4070a0; } /* VerbatimString */
code > span.ss { color: #bb6688; } /* SpecialString */
code > span.im { } /* Import */
code > span.va { color: #19177c; } /* Variable */
code > span.cf { color: #007020; font-weight: bold; } /* ControlFlow */
code > span.op { color: #666666; } /* Operator */
code > span.bu { } /* BuiltIn */
code > span.ex { } /* Extension */
code > span.pp { color: #bc7a00; } /* Preprocessor */
code > span.at { color: #7d9029; } /* Attribute */
code > span.do { color: #ba2121; font-style: italic; } /* Documentation */
code > span.an { color: #60a0b0; font-weight: bold; font-style: italic; } /* Annotation */
code > span.cv { color: #60a0b0; font-weight: bold; font-style: italic; } /* CommentVar */
code > span.in { color: #60a0b0; font-weight: bold; font-style: italic; } /* Information */
  </style>
  <link rel="stylesheet" href="book.css" type="text/css" />
</head>
<body>
<h2 id="&#27169;&#22359;">6. &#27169;&#22359;</h2>
<p>&#20351;&#29992;Python&#35299;&#37322;&#22120;&#20197;&#20132;&#20114;&#27169;&#24335;&#36827;&#34892;&#31243;&#24207;&#35774;&#35745;&#65292;&#19981;&#20415;&#20110;&#20445;&#23384;&#31243;&#24207;&#25968;&#25454;&#12290;&#22240;&#27492;&#65292;&#32534;&#20889;&#31243;&#24207;&#26102;&#65292;&#26368;&#22909;&#20351;&#29992;&#25991;&#26412;&#32534;&#36753;&#22120;&#20808;&#32534;&#20889;&#22909;&#65292;&#28982;&#21518;&#20877;&#36816;&#34892;&#36825;&#20010;&#25991;&#20214;&#12290;&#36825;&#23601;&#26159;&#25152;&#35859;&#30340;&quot;<strong>&#33050;&#26412;</strong>&quot;&#12290;&#38543;&#30528;&#31243;&#24207;&#21464;&#38271;&#65292;&#26368;&#21518;&#23558;&#20854;&#20998;&#25104;&#20960;&#20010;&#25991;&#20214;&#65292;&#36825;&#26679;&#26356;&#26131;&#20110;&#32500;&#25252;&#12290;&#21478;&#22806;&#65292;&#33509;&#35201;&#22312;&#20854;&#20182;&#31243;&#24207;&#20013;&#20351;&#29992;&#24050;&#32534;&#20889;&#22909;&#30340;&#20989;&#25968;&#65292;&#19981;&#38656;&#35201;&#25226;&#20989;&#25968;&#25335;&#36125;&#21040;&#27599;&#20010;&#31243;&#24207;&#20013;&#12290;</p>
<p>&#20026;&#23454;&#29616;&#35813;&#21151;&#33021;&#65292;Python&#25552;&#20379;&#20102;&#19968;&#31181;&#21150;&#27861;&#65306;&#25226;&#23450;&#20041;&#30340;&#20989;&#25968;&#25918;&#21040;&#19968;&#20010;&#25991;&#20214;&#20013;&#65292;&#28982;&#21518;&#22312;&#33050;&#26412;&#25110;&#32773;&#20132;&#20114;&#26041;&#24335;&#20013;&#35843;&#29992;&#65292;&#36825;&#31181;&#25991;&#20214;&#31216;&#20043;&#20026;<strong>&#27169;&#22359;</strong>&#65307;&#27169;&#22359;&#20013;&#30340;&#23450;&#20041;&#21487;&#20197;&#23548;&#20837;&#20854;&#20182;&#27169;&#22359;&#25110;&#20027;&#27169;&#22359;&#20013;&#12290;</p>
<p>&#27169;&#22359;&#26159;&#21253;&#21547;python&#23450;&#20041;&#21644;&#22768;&#26126;&#30340;&#25991;&#20214;&#12290;&#25991;&#20214;&#21517;&#23601;&#26159;&#27169;&#22359;&#21517;&#21152;<code>.py</code>&#21518;&#32512;&#12290;&#22312;&#27169;&#22359;&#37324;&#65292;&#27169;&#22359;&#30340;&#21517;&#23383;&#21487;&#20197;&#30001;&#20840;&#23616;&#21464;&#37327;<code>__name__</code>&#30340;&#20540;&#24471;&#21040;&#12290;&#20363;&#22914;&#65292;&#29992;&#20320;&#21916;&#27426;&#30340;&#25991;&#20214;&#32534;&#36753;&#22120;&#22312;&#24403;&#21069;&#30446;&#24405;&#19979;&#21019;&#24314;&#19968;&#20010;&#21517;&#20026;<code>fibo.py</code>&#30340;&#25991;&#20214;&#65292;&#20854;&#20869;&#23481;&#22914;&#19979;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="co"># Fibonacci numbers module</span>

<span class="kw">def</span> fib(n):    <span class="co"># print Fibonacci series up to n</span>
    a, b <span class="op">=</span> <span class="dv">0</span>, <span class="dv">1</span>
    <span class="cf">while</span> b <span class="op">&lt;</span> n:
        <span class="bu">print</span>(b, end<span class="op">=</span><span class="st">&#39; &#39;</span>)
        a, b <span class="op">=</span> b, a<span class="op">+</span>b
    <span class="bu">print</span>()

<span class="kw">def</span> fib2(n): <span class="co"># return Fibonacci series up to n</span>
    result <span class="op">=</span> []
    a, b <span class="op">=</span> <span class="dv">0</span>, <span class="dv">1</span>
    <span class="cf">while</span> b <span class="op">&lt;</span> n:
        result.append(b)
        a, b <span class="op">=</span> b, a<span class="op">+</span>b
    <span class="cf">return</span> result</code></pre></div>
<p>&#29616;&#22312;&#21487;&#20197;&#22312;&#21035;&#30340;&#31243;&#24207;&#20013;&#35843;&#29992;&#35813;&#27169;&#22359;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> fibo
fibo.fib(<span class="dv">1000</span>)
fibo.fib2(<span class="dv">100</span>)
fibo.<span class="va">__name__</span>
<span class="co">## &#39;fibo&#39;</span></code></pre></div>
<p>&#22914;&#25171;&#31639;&#39057;&#32321;&#20351;&#29992;&#35813;&#20989;&#25968;&#65292;&#21487;&#20197;&#36171;&#32473;&#23427;&#19968;&#20010;&#26412;&#22320;&#30340;&#21464;&#37327;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">fib <span class="op">=</span> fibo.fib
fib(<span class="dv">500</span>)</code></pre></div>
<h3 id="&#28145;&#20837;&#27169;&#22359;">6.1 &#28145;&#20837;&#27169;&#22359;</h3>
<p>&#27169;&#22359;&#21487;&#20197;&#21253;&#21547;&#21487;&#25191;&#34892;&#35821;&#21477;&#20197;&#21450;&#20989;&#25968;&#30340;&#23450;&#20041;&#12290;&#36825;&#20123;&#35821;&#21477;&#36890;&#24120;&#29992;&#20110;&#21021;&#22987;&#21270;&#27169;&#22359;&#12290;&#23427;&#20204;&#21482;&#22312;<strong>&#31532;&#19968;&#27425;</strong> &#23548;&#20837;&#26102;&#25191;&#34892;&#12290;<a href="#fn1" class="footnoteRef" id="fnref1"><sup>1</sup></a>&#65288;&#22914;&#26524;&#25991;&#20214;&#20197;&#33050;&#26412;&#30340;&#26041;&#24335;&#25191;&#34892;&#65292;&#23427;&#20204;&#20063;&#20250;&#36816;&#34892;&#12290;&#65289;</p>
<p>&#27599;&#20010;&#27169;&#22359;&#37117;&#26377;&#33258;&#24049;&#30340;&#31169;&#26377;&#31526;&#21495;&#34920;&#65292;&#27169;&#22359;&#20869;&#23450;&#20041;&#30340;&#25152;&#26377;&#20989;&#25968;&#29992;&#20854;&#20316;&#20026;&#20840;&#23616;&#31526;&#21495;&#34920;&#12290;&#22240;&#27492;&#65292;&#27169;&#22359;&#30340;&#20316;&#32773;&#21487;&#20197;&#22312;&#27169;&#22359;&#37324;&#20351;&#29992;&#20840;&#23616;&#21464;&#37327;&#65292;&#32780;&#19981;&#29992;&#25285;&#24515;&#19982;&#26576;&#20010;&#29992;&#25143;&#30340;&#20840;&#23616;&#21464;&#37327;&#26377;&#20914;&#31361;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#20320;&#30693;&#36947;&#33258;&#24049;&#22312;&#20570;&#20160;&#20040;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#24341;&#29992;&#27169;&#22359;&#20989;&#25968;&#30340;&#34920;&#31034;&#27861;&#35775;&#38382;&#27169;&#22359;&#30340;&#20840;&#23616;&#21464;&#37327;&#65292;<code>modname.itemname</code>&#12290;</p>
<p>&#27169;&#22359;&#20013;&#21487;&#20197;&#23548;&#20837;&#20854;&#23427;&#27169;&#22359;&#12290;&#20064;&#24815;&#19978;&#23558;&#25152;&#26377;&#30340; <code>import</code> &#35821;&#21477;&#25918;&#22312;&#27169;&#22359;&#65288;&#25110;&#32773;&#33050;&#26412;&#65289;&#30340;&#24320;&#22987;&#65292;&#20294;&#36825;&#19981;&#26159;&#24378;&#21046;&#24615;&#30340;&#12290;&#34987;&#23548;&#20837;&#30340;&#27169;&#22359;&#30340;&#21517;&#23383;&#25918;&#22312;&#23548;&#20837;&#27169;&#22359;&#30340;&#20840;&#23616;&#31526;&#21495;&#34920;&#20013;&#12290;</p>
<p><code>import</code> &#35821;&#21477;&#30340;&#19968;&#20010;&#21464;&#20307;&#30452;&#25509;&#20174;&#34987;&#23548;&#20837;&#30340;&#27169;&#22359;&#20013;&#23548;&#20837;&#21517;&#23383;&#21040;&#27169;&#22359;&#30340;&#31526;&#21495;&#34920;&#20013;&#12290;&#20363;&#22914;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">from</span> fibo <span class="im">import</span> fib, fib2
fib(<span class="dv">500</span>)</code></pre></div>
<p>&#36825;&#19981;&#20250;&#21543;&#27169;&#22359;&#21517;&#23548;&#20837;&#21040;&#26412;&#22320;&#31526;&#21495;&#34920;&#20013;&#12290;</p>
<p>&#36824;&#26377;&#19968;&#31181;&#26041;&#24335;&#21487;&#20197;&#23548;&#20837;&#27169;&#22359;&#20013;&#23450;&#20041;&#30340;&#22810;&#26377;&#21517;&#23383;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">from</span> fibo <span class="im">import</span> <span class="op">*</span>
fib(<span class="dv">500</span>)</code></pre></div>
<p>&#36825;&#31181;&#26041;&#24335;&#19981;&#20250;&#23548;&#20837;&#20197;&#19979;&#21010;&#32447;<code>_</code>&#24320;&#22836;&#30340;&#21517;&#31216;&#12290;&#22823;&#22810;&#24773;&#20917;&#19979;&#65292;python&#31243;&#24207;&#21592;&#19981;&#20250;&#20351;&#29992;&#36825;&#20010;&#20415;&#21033;&#30340;&#26041;&#27861;&#65292;&#22240;&#20026;&#23427;&#20250;&#24341;&#20837;&#19968;&#31995;&#21015;&#26410;&#30693;&#30340;&#21517;&#31216;&#21040;&#35299;&#37322;&#22120;&#20013;&#65292;&#36825;&#24456;&#21487;&#33021;&#38544;&#34255;&#20320;&#23450;&#20041;&#30340;&#19968;&#20123;&#19996;&#35199;&#12290;</p>
<blockquote>
<p>&#27880;&#24847;&#65306;&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#19981;&#36190;&#25104;&#20174;&#19968;&#20010;&#27169;&#22359;&#25110;&#21253;&#20013;&#23548;&#20837;<code>*</code>&#65292;&#22240;&#20026;&#36825;&#36890;&#24120;&#20250;&#23548;&#33268;&#20195;&#30721;&#24456;&#38590;&#35835;&#12290;&#19981;&#36807;&#65292;&#22312;&#20132;&#20114;&#24335;&#20250;&#35805;&#20013;&#26159;&#21487;&#20197;&#36825;&#26679;&#29992;&#30340;&#65292;&#23427;&#21487;&#20197;&#35753;&#20320;&#23569;&#25970;&#19968;&#20123;&#20195;&#30721;&#12290;</p>
</blockquote>
<ul>
<li>&#27880;&#24847;&#65306;&#22788;&#20110;&#24615;&#33021;&#32771;&#34385;&#65292;&#27599;&#20010;&#27169;&#22359;&#22312;&#27599;&#20010;&#35299;&#37322;&#22120;&#20250;&#35805;&#20013;&#21482;&#23548;&#20837;&#19968;&#36941;&#65292;&#22240;&#27492;&#65292;&#22914;&#26524;&#20320;&#20462;&#25913;&#20102;&#20320;&#30340;&#27169;&#22359;&#65292;&#20320;&#24517;&#39035;&#37325;&#21551;&#35299;&#37322;&#22120;&#12290;&#25110;&#32773;&#65292;&#22914;&#26524;&#20320;&#23601;&#26159;&#24819;&#20132;&#20114;&#24335;&#22320;&#27979;&#35797;&#19968;&#19979;&#27169;&#22359;&#65292;&#21487;&#20197;&#20351;&#29992;<code>imp.reload()</code>&#65292;&#20363;&#22914;<code>import imp; imp.reload(modulename)</code>&#12290;</li>
</ul>
<h4 id="&#25191;&#34892;&#27169;&#22359;">6.1.1 &#25191;&#34892;&#27169;&#22359;</h4>
<p>&#24403;&#20320;&#29992;&#19979;&#38754;&#30340;&#26041;&#24335;&#36816;&#34892;&#19968;&#20010;python&#27169;&#22359;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">python fibo.py <span class="op">&lt;</span>arguments<span class="op">&gt;</span></code></pre></div>
<p>&#27169;&#22359;&#20013;&#30340;&#20195;&#30721;&#23558;&#20250;&#34987;&#25191;&#34892;&#65292;&#23601;&#34892;&#23548;&#20837;&#23427;&#19968;&#26679;&#65292;&#19981;&#36807;&#27492;&#26102;<code>__name__</code>&#34987;&#35774;&#32622;&#20026;&quot;<code>__main__</code>&quot;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#22914;&#26524;&#20320;&#22312;&#27169;&#22359;&#21518;&#21152;&#20837;&#20197;&#19979;&#20195;&#30721;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="cf">if</span> <span class="va">__name__</span> <span class="op">==</span> <span class="st">&quot;__main__&quot;</span>:
        <span class="im">import</span> sys
        fib(<span class="bu">int</span>(sys.argv[<span class="dv">1</span>]))</code></pre></div>
<p>&#23601;&#21487;&#20197;&#35753;&#27492;&#25991;&#20214;&#26082;&#21487;&#20197;&#20316;&#20026;&#21487;&#25191;&#34892;&#33050;&#26412;&#65292;&#20063;&#21487;&#20197;&#20316;&#20026;&#23548;&#20837;&#30340;&#27169;&#22359;&#65292;&#22240;&#20026;&#35299;&#26512;&#21629;&#20196;&#34892;&#30340;&#37027;&#37096;&#20998;&#20195;&#30721;&#21482;&#26377;&#22312;&#27169;&#22359;&#20316;&#20026;&#8220;main&#8221;&#25991;&#20214;&#26102;&#25165;&#34987;&#35843;&#29992;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode bash"><code class="sourceCode bash">$ <span class="kw">python</span> fibo.py 50
<span class="co">## 1 1 2 3 5 8 13 21 34</span></code></pre></div>
<p>&#22914;&#26524;&#27169;&#22359;&#26159;&#34987;&#23548;&#20837;&#30340;&#65292;&#23558;&#19981;&#20250;&#36816;&#34892;&#36825;&#27573;&#20195;&#30721;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> fibo</code></pre></div>
<h4 id="&#27169;&#22359;&#25628;&#32034;&#36335;&#24452;">6.1.2 &#27169;&#22359;&#25628;&#32034;&#36335;&#24452;</h4>
<p>&#24403;&#23548;&#20837;&#19968;&#20010;&#21517;&#20026;spam&#30340;&#27169;&#22359;&#26102;&#65292;&#35299;&#37322;&#22120;&#39318;&#20808;&#25628;&#32034;&#20855;&#26377;&#25913;&#21517;&#31216;&#30340;&#20869;&#32622;&#27169;&#22359;&#12290;&#22914;&#27809;&#26377;&#25214;&#21040;&#65292;&#23427;&#20250;&#25509;&#30528;&#21040;<code>sys.path</code>&#21464;&#37327;&#32473;&#20986;&#30340;&#30446;&#24405;&#20013;&#26597;&#25214;&#21517;&#20026;<code>spam.py</code>&#30340;&#25991;&#20214;&#12290;<code>sys.path</code>&#21464;&#37327;&#30340;&#21021;&#22987;&#20540;&#26469;&#33258;&#36825;&#20123;&#20301;&#32622;&#65306;</p>
<ul>
<li>&#33050;&#26412;&#25152;&#22312;&#30340;&#30446;&#24405;&#65288;&#22914;&#26410;&#25351;&#26126;&#25991;&#20214;&#65292;&#21017;&#20026;&#24403;&#21069;&#30446;&#24405;&#65289;</li>
<li><code>PYTHONPATH</code>&#65288;&#19968;&#20010;&#21253;&#21547;&#30446;&#24405;&#21517;&#30340;&#21015;&#34920;&#65292;&#19982;shell&#21464;&#37327;PATH&#30340;&#35821;&#27861;&#30456;&#21516;&#65289;</li>
<li>&#19982;&#23433;&#35013;&#30456;&#20851;&#30340;&#40664;&#35748;&#20540;&#12290;</li>
</ul>
<blockquote>
<p>Note: &#22312;&#25903;&#25345;&#31526;&#21495;&#36830;&#25509;&#30340;&#25991;&#20214;&#31995;&#32479;&#20013;&#65292;&#36755;&#20837;&#30340;&#33050;&#26412;&#25152;&#22312;&#30340;&#30446;&#24405;&#26159;&#31526;&#21495;&#36830;&#25509;&#25351;&#21521;&#30340;&#30446;&#24405;&#12290; &#25442;&#21477;&#35805;&#35828;&#20063;&#23601;&#26159;&#21253;&#21547;&#31526;&#21495;&#38142;&#25509;&#30340;&#30446;&#24405;&#19981;&#20250;&#34987;&#21152;&#21040;&#30446;&#24405;&#25628;&#32034;&#36335;&#24452;&#20013;&#12290;</p>
</blockquote>
<p>&#21021;&#22987;&#21270;&#21518;&#65292;Python&#31243;&#24207;&#21487;&#20197;&#20462;&#25913;<code>sys.path</code>&#12290;&#33050;&#26412;&#25152;&#22312;&#30340;&#30446;&#24405;&#34987;&#25918;&#32622;&#22312;&#25628;&#32034;&#36335;&#24452;&#30340;&#26368;&#24320;&#22987;&#65292;&#20063;&#23601;&#26159;&#22312;&#26631;&#20934;&#24211;&#30340;&#36335;&#24452;&#20043;&#21069;&#65292;&#36825;&#24847;&#21619;&#30528;&#23558;&#20250;&#21152;&#36733;&#24403;&#21069;&#30446;&#24405;&#20013;&#30340;&#33050;&#26412;&#65292;&#24211;&#30446;&#24405;&#20013;&#20855;&#26377;&#30456;&#21516;&#21517;&#31216;&#30340;&#27169;&#22359;&#19981;&#20250;&#34987;&#21152;&#36733;&#12290;&#38500;&#38750;&#26377;&#24847;&#26367;&#25442;&#26631;&#20934;&#24211;&#65292;&#21542;&#21017;&#36825;&#24212;&#34987;&#24403;&#20316;&#19968;&#20010;&#38169;&#35823;&#12290;&#26356;&#22810;&#28040;&#24687;&#21442;&#38405;<a href="http://python.usyiyi.cn/python_343/tutorial/modules.html#tut-standardmodules">&#26631;&#20934;&#27169;&#22359;</a>&#23567;&#33410;&#12290;</p>
<h4 id="&#32534;&#35793;&#36807;&#30340;python&#25991;&#20214;">6.1.3 &#8220;&#32534;&#35793;&#36807;&#30340;&#8221;python&#25991;&#20214;</h4>
<p>&#20026;&#20102;&#21152;&#24555;&#21152;&#36733;&#27169;&#22359;&#30340;&#36895;&#24230;&#65292;Python&#20250;&#22312;<code>__pycache__</code>&#30446;&#24405;&#19979;&#20197;<code>module.version.pyc</code>&#21517;&#23383;&#32531;&#23384;&#27599;&#20010;&#27169;&#22359;&#32534;&#35793;&#21518;&#30340;&#29256;&#26412;&#65292;&#36825;&#37324;&#30340;&#29256;&#26412;&#32534;&#21046;&#20102;&#32534;&#35793;&#21518;&#25991;&#20214;&#30340;&#26684;&#24335;&#12290;&#23427;&#36890;&#24120;&#20250;&#21253;&#21547;python&#30340;&#29256;&#26412;&#21495;&#12290;&#20363;&#22914;&#65292;&#22312;CPython3.3&#20013;&#65292;<code>spam.py</code>&#32534;&#35793;&#21518;&#30340;&#29256;&#26412;&#23558;&#32531;&#23384;&#20026;<code>__pycache__/spam.cpython-33.pyc</code>&#12290;&#36825;&#31181;&#21629;&#21517;&#32422;&#23450;&#20801;&#35768;&#30001;&#19981;&#21516;&#21457;&#24067;&#21644;&#19981;&#21516;&#29256;&#26412;&#30340;python&#32534;&#35793;&#30340;&#27169;&#22359;&#21516;&#26102;&#23384;&#22312;&#12290;</p>
<p>Python&#20250;&#26816;&#26597;&#28304;&#25991;&#20214;&#19982;&#32534;&#35793;&#29256;&#30340;&#20462;&#25913;&#26085;&#26399;&#20197;&#30830;&#23450;&#23427;&#26159;&#21542;&#36807;&#26399;&#24182;&#38656;&#35201;&#37325;&#26032;&#32534;&#35793;&#12290;&#36825;&#26159;&#23436;&#20840;&#33258;&#21160;&#21270;&#30340;&#36807;&#31243;&#12290;&#21516;&#26102;&#65292;&#32534;&#35793;&#21518;&#30340;&#27169;&#22359;&#26159;&#36328;&#24179;&#21488;&#30340;&#65292;&#25152;&#20197;&#21516;&#19968;&#20010;&#24211;&#21487;&#20197;&#22312;&#19981;&#21516;&#26550;&#26500;&#30340;&#31995;&#32479;&#20043;&#38388;&#20849;&#20139;&#12290;</p>
<p>Python &#19981;&#26816;&#26597;&#22312;&#20004;&#20010;&#19981;&#21516;&#29615;&#22659;&#20013;&#30340;&#32531;&#23384;&#12290;&#39318;&#20808;&#65292;&#23427;&#24635;&#20250;&#37325;&#26032;&#32534;&#35793;&#24182;&#19988;&#19981;&#20250;&#23384;&#20648;&#20174;&#21629;&#20196;&#34892;&#30452;&#25509;&#21152;&#36733;&#30340;&#27169;&#22359;&#12290;&#20854;&#27425;&#65292;&#22914;&#26524;&#27809;&#26377;&#28304;&#27169;&#22359;&#23427;&#19981;&#20250;&#26816;&#26597;&#32531;&#23384;&#12290;&#33509;&#35201;&#25903;&#25345;&#27809;&#26377;&#28304;&#25991;&#20214;&#65288;&#21482;&#26377;&#32534;&#35793;&#29256;&#65289;&#30340;&#21457;&#24067;&#65292;&#32534;&#35793;&#21518;&#30340;&#27169;&#22359;&#24517;&#39035;&#22312;&#28304;&#30446;&#24405;&#19979;&#65292;&#24182;&#19988;&#24517;&#39035;&#27809;&#26377;&#28304;&#25991;&#20214;&#30340;&#27169;&#22359;&#12290;</p>
<p>&#37096;&#20998;&#39640;&#32423;&#25216;&#24039;&#65306;</p>
<ul>
<li><p>{{s.58}}{{s.59}}{{s.60}}{{s.61}}{{s.62}}</p></li>
<li><p>{{s.63}}{{s.64}}{{s.65}}</p></li>
<li><p>{{s.66}}{{s.67}}</p></li>
<li><p>{{s.68}}{{s.69}}{{s.70}}</p></li>
<li><p>{{s.71}}{{&#26465;&#20363;}}</p></li>
<li><p>{{}} s.73</p></li>
</ul>
<h3 id="&#26631;&#20934;&#27169;&#22359;">6.2 &#26631;&#20934;&#27169;&#22359;</h3>
<p>Python &#24102;&#26377;&#19968;&#20010;&#26631;&#20934;&#27169;&#22359;&#24211;&#65292;&#24182;&#21457;&#24067;&#26377;&#21333;&#29420;&#30340;&#25991;&#26723;&#21483;Python &#24211;&#21442;&#32771;&#25163;&#20876;&#65288;&#20197;&#19979;&#31616;&#31216;&quot;&#24211;&#21442;&#32771;&#25163;&#20876;&quot;&#65289;&#12290;&#26377;&#20123;&#27169;&#22359;&#34987;&#30452;&#25509;&#26500;&#24314;&#22312;&#35299;&#26512;&#22120;&#37324;&#65307;&#36825;&#20123;&#25805;&#20316;&#34429;&#28982;&#19981;&#26159;&#35821;&#35328;&#26680;&#24515;&#30340;&#37096;&#20998;&#65292;&#20294;&#26159;&#20381;&#28982;&#34987;&#20869;&#24314;&#36827;&#26469;&#65292;&#19968;&#26041;&#38754;&#26159;&#25928;&#29575;&#30340;&#21407;&#22240;&#65292;&#21478;&#19968;&#26041;&#38754;&#26159;&#20026;&#20102;&#25552;&#20379;&#35775;&#38382;&#25805;&#20316;&#31995;&#32479;&#21407;&#35821;&#22914;&#31995;&#32479;&#35843;&#29992;&#30340;&#21151;&#33021;&#12290;&#36825;&#20123;&#27169;&#22359;&#26159;&#21487;&#37197;&#32622;&#30340;&#65292;&#20063;&#21462;&#20915;&#20110;&#24213;&#23618;&#30340;&#24179;&#21488;&#12290;&#20363;&#22914;&#65292;<code>winreg</code> &#27169;&#22359;&#21482;&#22312; Windows &#31995;&#32479;&#19978;&#25552;&#20379;&#12290;&#26377;&#19968;&#20010;&#29305;&#21035;&#30340;&#27169;&#22359;&#38656;&#35201;&#27880;&#24847;&#65306; <code>sys</code>&#65292;&#23427;&#20869;&#32622;&#22312;&#27599;&#19968;&#20010; Python &#35299;&#26512;&#22120;&#20013;&#12290;&#21464;&#37327; <code>sys.ps1</code> &#21644; <code>sys.ps2</code> &#23450;&#20041;&#20102;&#20027;&#25552;&#31034;&#31526;&#21644;&#36741;&#21161;&#25552;&#31034;&#31526;&#20351;&#29992;&#30340;&#23383;&#31526;&#20018;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> sys
sys.ps1
<span class="co">## &#39;&gt;&gt;&gt;&#39;</span>
sys.ps2
<span class="co">## &#39;...&#39;</span>
sys.ps1 <span class="op">=</span> <span class="st">&#39;C&gt;&#39;</span>
C<span class="op">&gt;</span> <span class="bu">print</span>(<span class="st">&#39;Yuck!&#39;</span>)
Yuck<span class="op">!</span></code></pre></div>
<p>&#21482;&#26377;&#22312;&#20132;&#20114;&#27169;&#24335;&#20013;&#65292;&#36825;&#20004;&#20010;&#21464;&#37327;&#25165;&#26377;&#23450;&#20041;&#12290;</p>
<p>&#21464;&#37327;<code>sys.path</code>&#26159;&#19968;&#20010;&#23383;&#31526;&#20018;&#21015;&#34920;&#65292;&#23427;&#20915;&#23450;&#20102;&#35299;&#37322;&#22120;&#25628;&#32034;&#27169;&#22359;&#30340;&#36335;&#24452;&#12290;&#23427;&#30340;&#21021;&#22987;&#40664;&#35748;&#36335;&#24452;&#26469;&#33258;&#20110;&#29615;&#22659;&#21464;&#37327;<code>PYTHONPATH</code>&#65292;&#33509;&#24178;&#21464;&#37327;&#26410;&#35774;&#32622;&#21017;&#26469;&#33258;&#20110;&#20869;&#32622;&#30340;&#40664;&#35748;&#20540;&#12290;&#21487;&#20197;&#20351;&#29992;&#26631;&#20934;&#30340;&#21015;&#34920;&#25805;&#20316;&#20462;&#25913;&#23427;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> sys
sys.path.append(<span class="st">&#39;/ufs/guido/lib/python&#39;</span>)</code></pre></div>
<h3 id="dir&#20989;&#25968;">6.3 <code>dir()</code>&#20989;&#25968;</h3>
<p>&#20869;&#32622;&#20989;&#25968;<code>dir()</code>&#29992;&#26469;&#25214;&#20986;&#27169;&#22359;&#20013;&#23450;&#20041;&#20102;&#37027;&#20123;&#21517;&#23383;&#65292;&#23427;&#36820;&#22238;&#19968;&#20010;&#25490;&#24207;&#22909;&#30340;&#23383;&#31526;&#20018;&#21015;&#34920;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> fibo, sys
<span class="bu">dir</span>(fibo)
<span class="co">## [&#39;__name__&#39;, &#39;fib&#39;, &#39;fib2&#39;]</span>
<span class="bu">dir</span>(sys)
<span class="co">## [&#39;__displayhook__&#39;, ......]</span></code></pre></div>
<p>&#22914;&#26524;&#19981;&#24102;&#21442;&#25968;&#65292;<code>dir()</code>&#21015;&#20986;&#24403;&#21069;&#24050;&#23450;&#20041;&#30340;&#21517;&#31216;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">a <span class="op">=</span> [<span class="dv">1</span>, <span class="dv">2</span>, <span class="dv">3</span>, <span class="dv">4</span>, <span class="dv">5</span>]
<span class="im">import</span> fibo
fib<span class="op">=</span>fibo.fib
<span class="bu">dir</span>()
<span class="co">## [&#39;__builtins__&#39;, &#39;__name__&#39;, &#39;a&#39;, &#39;fib&#39;, &#39;fibo&#39;, &#39;sys&#39;]</span></code></pre></div>
<p>&#27880;&#24847;&#65306;&#23427;&#21015;&#20986;&#20102;&#25152;&#26377;&#31867;&#22411;&#30340;&#21517;&#31216;&#65306;&#21464;&#37327;&#12289;&#27169;&#22359;&#12289;&#20989;&#25968;&#31561;&#12290;</p>
<p><code>dir()</code>&#19981;&#20250;&#21015;&#20986;&#20869;&#32622;&#30340;&#20989;&#25968;&#21644;&#21464;&#37327;&#30340;&#21517;&#31216;&#12290;&#22914;&#26524;&#24819;&#35201;&#21015;&#20986;&#36825;&#20123;&#20869;&#23481;&#65292;&#23427;&#20204;&#23450;&#20041;&#22312;&#26631;&#20934;&#27169;&#22359;<code>builtins</code>&#20013;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> builtins
<span class="bu">dir</span>(builtins)</code></pre></div>
<h3 id="&#21253;">6.4 &#21253;</h3>
<p>&#21253;&#26159;&#19968;&#31181;&#31649;&#29702; Python &#27169;&#22359;&#21629;&#21517;&#31354;&#38388;&#30340;&#26041;&#24335;&#65292;&#37319;&#29992;&#8220;&#28857;&#20998;&#27169;&#22359;&#21517;&#31216;&#8221;&#12290;&#20363;&#22914;&#65292;&#27169;&#22359;&#21517; A.B &#34920;&#31034;&#21253;A &#20013;&#19968;&#20010;&#21517;&#20026; B &#30340;&#23376;&#27169;&#22359;&#12290;&#23601;&#20687;&#27169;&#22359;&#30340;&#20351;&#29992;&#35753;&#19981;&#21516;&#27169;&#22359;&#30340;&#20316;&#32773;&#19981;&#29992;&#25285;&#24515;&#30456;&#20114;&#38388;&#30340;&#20840;&#23616;&#21464;&#37327;&#21517;&#31216;&#19968;&#26679;&#65292;&#28857;&#20998;&#27169;&#22359;&#30340;&#20351;&#29992;&#35753;&#21253;&#21547;&#22810;&#20010;&#27169;&#22359;&#30340;&#21253;&#65288;&#20363;&#22914; Numpy &#21644; Python Imaging Library&#65289;&#30340;&#20316;&#32773;&#20063;&#19981;&#29992;&#25285;&#24515;&#30456;&#20114;&#20043;&#38388;&#30340;&#27169;&#22359;&#37325;&#21517;&#12290;</p>
<p>&#20551;&#35774;&#20320;&#24819;&#35201;&#35774;&#35745;&#19968;&#31995;&#21015;&#27169;&#22359;&#65288;&#25110;&#19968;&#20010;&#8220;&#21253;&#8221;&#65289;&#26469;&#32479;&#19968;&#22788;&#29702;&#22768;&#38899;&#25991;&#20214;&#21644;&#22768;&#38899;&#25968;&#25454;&#12290;&#29616;&#23384;&#24456;&#22810;&#31181;&#19981;&#21516;&#30340;&#22768;&#38899;&#25991;&#20214;&#26684;&#24335; &#65288;&#36890;&#24120;&#30001;&#23427;&#20204;&#30340;&#25193;&#23637;&#21517;&#26469;&#35782;&#21035;&#65292;&#20363;&#22914;&#65306; .wav, .aiff, .au&#65289;&#65292;&#22240;&#27492;&#20320;&#21487;&#33021;&#38656;&#35201;&#21019;&#24314;&#21644;&#32500;&#25252;&#19981;&#26029;&#22686;&#38271;&#30340;&#27169;&#22359;&#38598;&#21512;&#26469;&#25903;&#25345;&#21508;&#31181;&#25991;&#20214;&#26684;&#24335;&#20043;&#38388;&#30340;&#36716;&#25442;&#12290;&#20320;&#21487;&#33021;&#36824;&#24819;&#38024;&#23545;&#38899;&#39057;&#25968;&#25454;&#20570;&#24456;&#22810;&#19981;&#21516;&#30340;&#25805;&#20316;&#65288;&#27604;&#22914;&#28151;&#38899;&#65292;&#28155;&#21152;&#22238;&#22768;&#65292;&#22686;&#21152;&#22343;&#34913;&#22120;&#21151;&#33021;&#65292;&#21019;&#24314;&#20154;&#36896;&#31435;&#20307;&#22768;&#25928;&#26524;&#65289;&#65292;&#25152;&#20197;&#20320;&#36824;&#38656;&#35201;&#32534;&#20889;&#19968;&#32452;&#27704;&#36828;&#20889;&#19981;&#23436;&#30340;&#27169;&#22359;&#26469;&#22788;&#29702;&#36825;&#20123;&#25805;&#20316;&#12290;&#20320;&#30340;&#21253;&#21487;&#33021;&#20250;&#26159;&#36825;&#20010;&#32467;&#26500;&#65288;&#29992;&#20998;&#23618;&#30340;&#25991;&#20214;&#31995;&#32479;&#34920;&#31034;&#65289;&#12290;</p>
<pre class="folder"><code>sound/                          Top-level package
      __init__.py               Initialize the sound package
      formats/                  Subpackage for file format conversions
              __init__.py
              wavread.py
              wavwrite.py
              aiffread.py
              aiffwrite.py
              auread.py
              auwrite.py
              ...
      effects/                  Subpackage for sound effects
              __init__.py
              echo.py
              surround.py
              reverse.py
              ...
      filters/                  Subpackage for filters
              __init__.py
              equalizer.py
              vocoder.py
              karaoke.py
              ...</code></pre>
<p>&#23548;&#20837;&#36825;&#20010;&#21253;&#26102;&#65292;Python &#25628;&#32034; <code>sys.path</code> &#20013;&#30340;&#30446;&#24405;&#20197;&#23547;&#25214;&#36825;&#20010;&#21253;&#30340;&#23376;&#30446;&#24405;&#12290;</p>
<p>&#20026;&#20102;&#35753; Python &#23558;&#30446;&#24405;&#24403;&#20570;&#21253;&#65292;&#30446;&#24405;&#19979;&#24517;&#39035;&#21253;&#21547; <code>__init__.py</code> &#25991;&#20214;&#65307;&#36825;&#26679;&#20570;&#26159;&#20026;&#20102;&#38450;&#27490;&#19968;&#20010;&#20855;&#26377;&#24120;&#35265;&#21517;&#23383;&#65288;&#20363;&#22914; string&#65289;&#30340;&#30446;&#24405;&#26080;&#24847;&#20013;&#38544;&#34255;&#30446;&#24405;&#25628;&#32034;&#36335;&#24452;&#20013;&#27491;&#30830;&#30340;&#27169;&#22359;&#12290;&#26368;&#31616;&#21333;&#30340;&#24773;&#20917;&#19979;&#65292;<code>__init__.py</code> &#21487;&#20197;&#21482;&#26159;&#19968;&#20010;&#31354;&#30340;&#25991;&#20214;&#65292;&#20294;&#23427;&#20063;&#21487;&#20197;&#20026;&#21253;&#25191;&#34892;&#21021;&#22987;&#21270;&#20195;&#30721;&#25110;&#35774;&#32622;<code>__all__&#21464;&#37327;</code>&#65288;&#31245;&#21518;&#20250;&#20171;&#32461;&#65289;&#12290;</p>
<p>&#29992;&#25143;&#21487;&#20197;&#20174;&#21253;&#20013;&#23548;&#20837;&#21333;&#29420;&#30340;&#27169;&#22359;&#65292;&#20363;&#22914;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> sound.effects.echo</code></pre></div>
<p>&#36825;&#26679;&#23601;&#21152;&#36733;&#20102;&#23376;&#27169;&#22359;<code>sound.effects.echo</code>&#65292;&#23427;&#24517;&#39035;&#20351;&#29992;&#23436;&#25972;&#30340;&#21517;&#31216;&#26469;&#24341;&#29992;&#20854;&#20013;&#30340;&#20989;&#25968;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> sound.effects.echo.echofilter(<span class="bu">input</span>, output, delay<span class="op">=</span><span class="fl">0.7</span>,atten<span class="op">=</span><span class="dv">4</span>)</code></pre></div>
<p>&#23548;&#20837;&#23376;&#27169;&#22359;&#30340;&#21478;&#19968;&#26041;&#27861;&#26159;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">from</span> sound.effects <span class="im">import</span> echo</code></pre></div>
<p>&#36825;&#26679;&#20063;&#21152;&#36733;&#20102;&#23376;&#27169;&#22359;<code>echo</code>&#65292;&#20294;&#23427;&#21487;&#20197;&#19981;&#21152;&#21069;&#32512;&#35775;&#38382;&#65292;&#22240;&#27492;&#21487;&#20197;&#26356;&#31616;&#21333;&#30340;&#20351;&#29992;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">echo.echofilter(<span class="bu">input</span>, output, delay<span class="op">=</span><span class="fl">0.7</span>, atten<span class="op">=</span><span class="dv">4</span>)</code></pre></div>
<p>&#36824;&#26377;&#19968;&#31181;&#21464;&#21270;&#26041;&#24335;&#26159;&#30452;&#25509;&#23548;&#20837;&#25152;&#38656;&#30340;&#20989;&#25968;&#25110;&#32773;&#21464;&#37327;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">from</span> sound.effects.echo <span class="im">import</span> echofilter</code></pre></div>
<p>&#36825;&#20877;&#27425;&#21152;&#36733;&#20102;&#23376;&#27169;&#22359;echo&#65292;&#20294;&#36825;&#31181;&#26041;&#24335;&#21487;&#20197;&#30452;&#25509;&#20351;&#29992;&#20989;&#25968;echofilter()&#36827;&#34892;&#24341;&#29992;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">echofilter(<span class="bu">input</span>, output, delay<span class="op">=</span><span class="fl">0.7</span>, atten<span class="op">=</span><span class="dv">4</span>)</code></pre></div>
<blockquote>
<p>&#27880;&#24847;: &#20351;&#29992;<code>from package import item</code>&#26102;&#65292;<code>item</code> &#21487;&#20197;&#26159;&#21253;&#30340;&#23376;&#27169;&#22359;&#65288;&#25110;&#23376;&#21253;&#65289;&#65292;&#20063;&#21487;&#20197;&#26159;&#21253;&#20013;&#23450;&#20041;&#30340;&#19968;&#20123;&#20854;&#23427;&#30340;&#21517;&#31216;&#65292;&#27604;&#22914;&#20989;&#25968;&#12289; &#31867;&#25110;&#32773;&#21464;&#37327;&#12290;<code>import</code>&#35821;&#21477;&#39318;&#20808;&#27979;&#35797; <code>item</code> &#22312;&#21253;&#20013;&#26159;&#21542;&#26377;&#23450;&#20041;&#65307;&#22914;&#26524;&#27809;&#26377;&#65292;&#23427;&#20551;&#23450;&#23427;&#26159;&#19968;&#20010;&#27169;&#22359;&#65292;&#24182;&#23581;&#35797;&#21152;&#36733;&#23427;&#12290;&#22914;&#26524;&#26410;&#33021;&#25214;&#21040;&#65292;&#21017;&#24341;&#21457;<code>ImportError</code>&#24322;&#24120;&#12290;</p>
</blockquote>
<blockquote>
<p>&#30456;&#21453;&#65292;&#20351;&#29992;&#31867;&#20284; <code>import item.subitem.subsubitem</code> &#36825;&#26679;&#30340;&#35821;&#27861;&#26102;&#65292;&#38500;&#20102;&#26368;&#21518;&#19968;&#39033;&#20854;&#23427;&#27599;&#39033;&#24517;&#39035;&#26159;&#19968;&#20010;&#21253;&#65307;&#26368;&#21518;&#19968;&#39033;&#21487;&#20197;&#26159;&#19968;&#20010;&#27169;&#22359;&#25110;&#19968;&#20010;&#21253;&#65292;&#20294;&#19981;&#33021;&#26159;&#22312;&#21069;&#19968;&#20010;&#39033;&#30446;&#20013;&#23450;&#20041;&#30340;&#31867;&#12289;&#20989;&#25968;&#25110;&#21464;&#37327;&#12290;</p>
</blockquote>
<h4 id="&#20174;&#21253;&#20013;&#23548;&#20837;">6.4.1 &#20174;&#21253;&#20013;&#23548;&#20837;*</h4>
<p>&#33509;&#20889;&#25104;<code>from sound.effects import *</code>&#65292;&#29702;&#24819;&#24773;&#20917;&#19979;&#26159;&#35201;&#21040;&#25991;&#20214;&#31995;&#32479;&#20013;&#23547;&#25214;&#21253;&#20013;&#26377;&#21738;&#20123;&#23376;&#27169;&#22359;&#24182;&#20840;&#37096;&#23548;&#20837;&#12290;&#20294;&#36825;&#21487;&#33021;&#38656;&#35201;&#24456;&#38271;&#30340;&#26102;&#38388;&#65292;&#19988;&#26131;&#20135;&#29983;&#21103;&#20316;&#29992;&#65292;&#32780;&#36825;&#20123;&#20316;&#29992;&#26412;&#24212;&#24403;&#23376;&#27169;&#22359;&#26159;&#26174;&#24335;&#23548;&#20837;&#26102;&#25165;&#20250;&#21457;&#29983;&#30340;&#12290;</p>
<p>&#21807;&#19968;&#30340;&#35299;&#20915;&#21150;&#27861;&#26159;&#21253;&#30340;&#20316;&#32773;&#20026;&#21253;&#25552;&#20379;&#30340;&#26174;&#24335;&#30340;&#32034;&#24341;&#12290;<code>import</code>&#35821;&#21477;&#20351;&#29992;&#19968;&#19979;&#32422;&#23450;&#65306;&#22914;&#26524;&#21253;&#20013;&#30340;<code>__init__.py</code>&#20195;&#30721;&#23450;&#20041;&#20102;&#19968;&#20010;&#21517;&#20026;<code>__all__</code>&#30340;&#21015;&#34920;&#65292;&#37027;&#20040;&#22312;&#36935;&#21040;<code>from package import *</code>&#35821;&#21477;&#26102;&#24212;&#35813;&#25226;&#36825;&#20010;&#21015;&#34920;&#20013;&#30340;&#25152;&#26377;&#27169;&#22359;&#21517;&#23383;&#23548;&#20837;&#12290;&#24403;&#21253;&#26377;&#26356;&#26032;&#26102;&#65292;&#23601;&#38656;&#35201;&#21253;&#30340;&#20316;&#32773;&#26356;&#26032;&#36825;&#20010;&#21015;&#34920;&#20102;&#12290;&#22914;&#26524;&#21253;&#30340;&#20316;&#32773;&#35748;&#20026;&#19981;&#21487;&#20197;&#29992;<code>import *</code>&#30340;&#26041;&#24335;&#23548;&#20837;&#23427;&#20204;&#30340;&#21253;&#65292;&#20063;&#21487;&#20915;&#23450;&#19981;&#25903;&#25345;&#23427;&#12290;&#20363;&#22914;&#65292;&#25991;&#20214;<code>sound/effects/__init__.py</code>&#21487;&#20197;&#21253;&#21547;&#20197;&#19979;&#20195;&#30721;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">__all__ <span class="op">=</span> [<span class="st">&quot;echo&quot;</span>, <span class="st">&quot;surround&quot;</span>, <span class="st">&quot;reverse&quot;</span>]</code></pre></div>
<p>&#36825;&#24847;&#21619;&#30528; <code>from sound.effects import *</code> &#23558;&#23548;&#20837;<code>sound</code> &#21253;&#30340;&#19977;&#20010;&#23376;&#27169;&#22359;&#12290;</p>
<p>&#22914;&#26524;<code>__all__</code>&#27809;&#26377;&#23450;&#20041;&#65292;<code>from sound.effects import *</code> &#35821;&#21477;&#19981;&#20250;&#20174; <code>sound.effects</code> &#21253;&#20013;&#23548;&#20837;&#25152;&#26377;&#30340;&#23376;&#27169;&#22359;&#21040;&#24403;&#21069;&#21629;&#21517;&#31354;&#38388;&#65307;&#23427;&#21482;&#20445;&#35777; <code>sound.effects</code> &#21253;&#24050;&#32463;&#34987;&#23548;&#20837;&#65288;&#21487;&#33021;&#20250;&#36816;&#34892; <code>__init__.py</code> &#20013;&#30340;&#20219;&#20309;&#21021;&#22987;&#21270;&#20195;&#30721;&#65289;&#65292;&#28982;&#21518;&#23548;&#20837;&#21253;&#20013;&#23450;&#20041;&#30340;&#20219;&#20309;&#21517;&#31216;&#12290;&#36825;&#21253;&#25324;&#30001;<code>__init__.py</code> &#23450;&#20041;&#30340;&#20219;&#20309;&#21517;&#31216;&#65288;&#20197;&#21450;&#23427;&#26174;&#24335;&#21152;&#36733;&#30340;&#23376;&#27169;&#22359;&#65289;&#12290;&#36824;&#21253;&#25324;&#36825;&#20010;&#21253;&#20013;&#24050;&#32463;&#30001;&#21069;&#38754;&#30340;<code>import</code> &#35821;&#21477;&#26174;&#24335;&#21152;&#36733;&#30340;&#23376;&#27169;&#22359;&#12290;&#35831;&#32771;&#34385;&#27492;&#20195;&#30721;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">import</span> sound.effects.echo
<span class="im">import</span> sound.effects.surround
<span class="im">from</span> sound.effects <span class="im">import</span> <span class="op">*</span></code></pre></div>
<p>&#22312;&#36825;&#20010;&#20363;&#23376;&#20013;&#65292;&#25191;&#34892; <code>from...import</code> &#35821;&#21477;&#26102;&#65292;<code>echo</code> &#21644; <code>surround</code> &#27169;&#22359;&#34987;&#23548;&#20837;&#21040;&#24403;&#21069;&#21629;&#21517;&#31354;&#38388;&#26159;&#22240;&#20026;&#23427;&#20204;&#22312;<code>sound.effects</code>&#20013;&#26377;&#23450;&#20041;&#12290;&#65288;&#23450;&#20041;&#20102;<code>__all__</code>&#26102;&#20063;&#20250;&#21516;&#26679;&#24037;&#20316;&#12290;&#65289;</p>
<p>&#26576;&#20123;&#27169;&#22359;&#35774;&#35745;&#25104;&#20351;&#29992; <code>import *</code> &#26102;&#21482;&#23548;&#20986;&#31526;&#21512;&#29305;&#23450;&#27169;&#24335;&#30340;&#21517;&#31216;&#12290;&#21363;&#20415;&#22914;&#27492;&#65292;&#22312;&#20135;&#21697;&#20195;&#30721;&#20013;&#20351;&#29992;&#36825;&#31181;&#20889;&#27861;&#20173;&#28982;&#26159;&#19981;&#22909;&#30340;&#20570;&#27861;&#12290;</p>
<p>&#35760;&#20303;&#65292;&#20351;&#29992; <code>from Package import specific_submodule</code> &#19968;&#28857;&#27809;&#38169; &#65281;&#20107;&#23454;&#19978;&#65292;&#36825;&#26159;&#25512;&#33616;&#30340;&#20889;&#27861;&#65292;&#38500;&#38750;&#23548;&#20837;&#30340;&#27169;&#22359;&#38656;&#35201;&#20351;&#29992;&#20854;&#23427;&#21253;&#20013;&#30340;&#21516;&#21517;&#23376;&#27169;&#22359;&#12290;</p>
<h4 id="&#21253;&#20869;&#24341;&#29992;">6.4.2 &#21253;&#20869;&#24341;&#29992;</h4>
<p>&#22914;&#26524;&#19968;&#20010;&#21253;&#26159;&#23376;&#21253;&#65288;&#27604;&#22914;&#20363;&#23376;&#20013;&#30340; <code>sound</code> &#21253;&#65289;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#32477;&#23545;&#23548;&#20837;&#26469;&#24341;&#29992;&#20804;&#24351;&#21253;&#30340;&#23376;&#27169;&#22359;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#27169;&#22359; <code>sound.filters.vocoder</code> &#38656;&#35201;&#20351;&#29992;<code>sound.effects</code> &#21253;&#20013;&#30340; <code>echo</code> &#27169;&#22359;&#65292;&#23427;&#21487;&#20197;&#20351;&#29992;<code>from sound.effects import echo</code>&#12290;</p>
<p>&#20320;&#36824;&#21487;&#20197;&#29992;<code>from module import name</code>&#24418;&#24335;&#30340;<code>import</code>&#35821;&#21477;&#36827;&#34892;&#30456;&#23545;&#23548;&#20837;&#12290;&#36825;&#20123;&#23548;&#20837;&#20351;&#29992;&#21069;&#23548;&#30340;&#28857;&#21495;&#34920;&#31034;&#30456;&#23545;&#23548;&#20837;&#30340;&#26159;&#20174;&#24403;&#21069;&#21253;&#36824;&#26159;&#19978;&#32423;&#30340;&#21253;&#12290;&#20197; <code>surround</code> &#27169;&#22359;&#20026;&#20363;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="im">from</span> . <span class="im">import</span> echo
<span class="im">from</span> .. <span class="im">import</span> formats
<span class="im">from</span> ..filters <span class="im">import</span> equalizer</code></pre></div>
<blockquote>
<p>&#27880;&#24847;&#65292;&#30456;&#23545;&#23548;&#20837;&#22522;&#20110;&#24403;&#21069;&#27169;&#22359;&#30340;&#21517;&#31216;&#12290;&#22240;&#20026;&#20027;&#27169;&#22359;&#30340;&#21517;&#23383;&#24635;&#26159; &quot;<code>__main__</code>&quot; &#65292;Python &#24212;&#29992;&#31243;&#24207;&#30340;&#20027;&#27169;&#22359;&#24517;&#39035;&#24635;&#26159;&#29992;&#32477;&#23545;&#23548;&#20837;&#12290;</p>
</blockquote>
<h4 id="&#21253;&#21547;&#22810;&#20010;&#30446;&#24405;&#30340;&#21253;">6.4.3 &#21253;&#21547;&#22810;&#20010;&#30446;&#24405;&#30340;&#21253;</h4>
<p>&#21253;&#36824;&#25903;&#25345;&#19968;&#20010;&#29305;&#27530;&#30340;&#23646;&#24615;&#65292;<code>__path__</code>&#12290;&#35813;&#21464;&#37327;&#21021;&#22987;&#21270;&#19968;&#20010;&#21253;&#21547; <code>__init__.py</code> &#25152;&#22312;&#30446;&#24405;&#30340;&#21015;&#34920;&#12290;&#36825;&#20010;&#21464;&#37327;&#21487;&#20197;&#20462;&#25913;&#65307;&#36825;&#26679;&#20570;&#20250;&#24433;&#21709;&#26410;&#26469;&#21253;&#20013;&#21253;&#21547;&#30340;&#27169;&#22359;&#21644;&#23376;&#21253;&#30340;&#25628;&#32034;&#12290;</p>
<p>&#34429;&#28982;&#36890;&#24120;&#19981;&#38656;&#35201;&#27492;&#21151;&#33021;&#65292;&#23427;&#21487;&#20197;&#29992;&#20110;&#25193;&#23637;&#21253;&#20013;&#30340;&#27169;&#22359;&#30340;&#38598;&#21512;&#12290;</p>
<p>&#33050;&#27880;</p>
<div class="footnotes">
<hr />
<ol>
<li id="fn1"><p>In fact function definitions are also &#8216;statements&#8217; that are &#8216;executed&#8217;; the execution of a module-level function definition enters the function name in the module&#8217;s global symbol table.<a href="#fnref1">&#8617;</a></p></li>
</ol>
</div>
</body>
</html>
