<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <style type="text/css">
div.sourceCode { overflow-x: auto; }
table.sourceCode, tr.sourceCode, td.lineNumbers, td.sourceCode {
  margin: 0; padding: 0; vertical-align: baseline; border: none; }
table.sourceCode { width: 100%; line-height: 100%; }
td.lineNumbers { text-align: right; padding-right: 4px; padding-left: 4px; color: #aaaaaa; border-right: 1px solid #aaaaaa; }
td.sourceCode { padding-left: 5px; }
code > span.kw { color: #007020; font-weight: bold; } /* Keyword */
code > span.dt { color: #902000; } /* DataType */
code > span.dv { color: #40a070; } /* DecVal */
code > span.bn { color: #40a070; } /* BaseN */
code > span.fl { color: #40a070; } /* Float */
code > span.ch { color: #4070a0; } /* Char */
code > span.st { color: #4070a0; } /* String */
code > span.co { color: #60a0b0; font-style: italic; } /* Comment */
code > span.ot { color: #007020; } /* Other */
code > span.al { color: #ff0000; font-weight: bold; } /* Alert */
code > span.fu { color: #06287e; } /* Function */
code > span.er { color: #ff0000; font-weight: bold; } /* Error */
code > span.wa { color: #60a0b0; font-weight: bold; font-style: italic; } /* Warning */
code > span.cn { color: #880000; } /* Constant */
code > span.sc { color: #4070a0; } /* SpecialChar */
code > span.vs { color: #4070a0; } /* VerbatimString */
code > span.ss { color: #bb6688; } /* SpecialString */
code > span.im { } /* Import */
code > span.va { color: #19177c; } /* Variable */
code > span.cf { color: #007020; font-weight: bold; } /* ControlFlow */
code > span.op { color: #666666; } /* Operator */
code > span.bu { } /* BuiltIn */
code > span.ex { } /* Extension */
code > span.pp { color: #bc7a00; } /* Preprocessor */
code > span.at { color: #7d9029; } /* Attribute */
code > span.do { color: #ba2121; font-style: italic; } /* Documentation */
code > span.an { color: #60a0b0; font-weight: bold; font-style: italic; } /* Annotation */
code > span.cv { color: #60a0b0; font-weight: bold; font-style: italic; } /* CommentVar */
code > span.in { color: #60a0b0; font-weight: bold; font-style: italic; } /* Information */
  </style>
  <link rel="stylesheet" href="book.css" type="text/css" />
</head>
<body>
<h2 id="&#31867;">9. &#31867;</h2>
<p>&#19982;&#20854;&#20182;&#32534;&#31243;&#35821;&#35328;&#30456;&#27604;&#65292;<code>Python</code> &#30340;&#31867;&#26426;&#21046;&#29992;&#26368;&#23569;&#30340;&#35821;&#27861;&#21644;&#35821;&#20041;&#24341;&#20837;&#20102;&#31867;&#12290;&#23427;&#26159; <code>C++</code> &#21644; <code>Modula-3</code> &#31867;&#26426;&#21046;&#30340;&#28151;&#21512;&#12290;<code>Python</code> &#30340;&#31867;&#25552;&#20379;&#20102;&#38754;&#21521;&#23545;&#35937;&#32534;&#31243;&#30340;&#25152;&#26377;&#26631;&#20934;&#21151;&#33021;&#65306; &#31867;&#32487;&#25215;&#26426;&#21046;&#20801;&#35768;&#26377;&#22810;&#20010;&#22522;&#31867;&#65292;&#32487;&#25215;&#30340;&#31867;&#21487;&#20197;&#35206;&#30422;&#20854;&#22522;&#31867;&#25110;&#31867;&#30340;&#20219;&#20309;&#26041;&#27861;&#65292;&#26041;&#27861;&#33021;&#22815;&#20197;&#30456;&#21516;&#30340;&#21517;&#31216;&#35843;&#29992;&#22522;&#31867;&#20013;&#30340;&#26041;&#27861;&#12290;&#23545;&#35937;&#21487;&#20197;&#21253;&#21547;&#20219;&#24847;&#25968;&#37327;&#21644;&#31181;&#31867;&#30340;&#25968;&#25454;&#12290;&#21644;&#27169;&#22359;&#19968;&#26679;&#65292;&#31867;&#21516;&#26679;&#20855;&#26377; <code>Python</code> &#30340;&#21160;&#24577;&#24615;&#36136;&#65306;&#23427;&#20204;&#22312;&#36816;&#34892;&#26102;&#21019;&#24314;&#65292;&#24182;&#21487;&#20197;&#22312;&#21019;&#24314;&#20043;&#21518;&#36827;&#19968;&#27493;&#20462;&#25913;&#12290;</p>
<p>&#29992; <code>C++</code> &#26415;&#35821;&#26469;&#35762;&#65292;&#36890;&#24120;&#24773;&#20917;&#19979;&#31867;&#25104;&#21592;&#65288;&#21253;&#25324;&#25968;&#25454;&#25104;&#21592;&#65289;&#26159;&#20844;&#26377;&#30340;&#65288;&#20854;&#23427;&#24773;&#20917;&#35265;&#19979;&#25991;&#31169;&#26377;&#21464;&#37327;&#65289;&#65292;&#25152;&#26377;&#30340;&#25104;&#21592;&#20989;&#25968;&#37117;&#26159;&#34394; &#30340;&#12290;&#19982; <code>Modula-3</code> &#19968;&#26679;&#65292;&#22312;&#25104;&#21592;&#26041;&#27861;&#20013;&#27809;&#26377;&#31616;&#20415;&#30340;&#26041;&#24335;&#24341;&#29992;&#23545;&#35937;&#30340;&#25104;&#21592;&#65306;&#26041;&#27861;&#20989;&#25968;&#30340;&#22768;&#26126;&#29992;&#26174;&#24335;&#30340;&#31532;&#19968;&#20010;&#21442;&#25968;&#34920;&#31034;&#23545;&#35937;&#26412;&#36523;&#65292;&#35843;&#29992;&#26102;&#20250;&#38544;&#24335;&#22320;&#24341;&#29992;&#35813;&#23545;&#35937;&#12290;&#19982; <code>Smalltalk</code> &#19968;&#26679;&#65292;&#31867;&#26412;&#36523;&#20063;&#26159;&#23545;&#35937;&#12290;&#36825;&#32473;&#23548;&#20837;&#31867;&#21644;&#37325;&#21629;&#21517;&#31867;&#25552;&#20379;&#20102;&#35821;&#20041;&#19978;&#30340;&#21512;&#29702;&#24615;&#12290;&#19982; <code>C++</code> &#21644; <code>Modula-3</code> &#19981;&#21516;&#65292;&#29992;&#25143;&#21487;&#20197;&#29992;&#20869;&#32622;&#31867;&#22411;&#20316;&#20026;&#22522;&#31867;&#36827;&#34892;&#25193;&#23637;&#12290;&#27492;&#22806;&#65292;&#20687; <code>C++</code> &#19968;&#26679;&#65292;&#31867;&#23454;&#20363;&#21487;&#20197;&#37325;&#23450;&#20041;&#22823;&#22810;&#25968;&#24102;&#26377;&#29305;&#27530;&#35821;&#27861;&#30340;&#20869;&#32622;&#25805;&#20316;&#31526;&#65288;&#31639;&#26415;&#36816;&#31639;&#31526;&#12289; &#19979;&#26631;&#31561;&#65289;&#12290;</p>
<p>&#65288;&#30001;&#20110;&#27809;&#26377;&#32479;&#19968;&#30340;&#36798;&#25104;&#20849;&#35782;&#30340;&#26415;&#35821;&#65292;&#25105;&#20250;&#20598;&#23572;&#20351;&#29992; <code>SmallTalk</code> &#21644; <code>C++</code> &#30340;&#26415;&#35821;&#12290;&#25105;&#27604;&#36739;&#21916;&#27426;&#29992; <code>Modula-3</code> &#30340;&#26415;&#35821;&#65292;&#22240;&#20026;&#27604;&#36215; <code>C++</code>&#65292;<code>Python</code> &#30340;&#38754;&#21521;&#23545;&#35937;&#35821;&#27861;&#26356;&#20687;&#23427;&#65292;&#20294;&#26159;&#25105;&#24819;&#24456;&#23569;&#26377;&#35835;&#32773;&#21548;&#35828;&#36807;&#23427;&#12290;&#65289;</p>
<h3 id="&#21517;&#31216;&#21644;&#23545;&#35937;">9.1 &#21517;&#31216;&#21644;&#23545;&#35937;</h3>
<p>&#23545;&#35937;&#26159;&#29420;&#31435;&#30340;&#65292;&#22810;&#20010;&#21517;&#23383;&#65288;&#22312;&#22810;&#20010;&#20316;&#29992;&#22495;&#20013;&#65289;&#21487;&#20197;&#32465;&#23450;&#21040;&#21516;&#19968;&#20010;&#23545;&#35937;&#12290;&#36825;&#22312;&#20854;&#20182;&#35821;&#35328;&#20013;&#31216;&#20026;&#21035;&#21517;&#12290;&#31532;&#19968;&#27425;&#31895;&#30053;&#27983;&#35272; Python &#26102;&#32463;&#24120;&#19981;&#20250;&#27880;&#24847;&#21040;&#36825;&#20010;&#29305;&#24615;&#65292;&#32780;&#19988;&#22788;&#29702;&#19981;&#21487;&#21464;&#30340;&#22522;&#26412;&#31867;&#22411;&#65288;&#25968;&#23383;&#65292;&#23383;&#31526;&#20018;&#65292;&#20803;&#32452;&#65289;&#26102;&#24573;&#30053;&#36825;&#19968;&#28857;&#20063;&#27809;&#20160;&#20040;&#38382;&#39064;&#12290;&#28982;&#32780;&#65292; &#22312;Python &#20195;&#30721;&#28041;&#21450;&#21487;&#21464;&#23545;&#35937;&#22914;&#21015;&#34920;&#12289; &#23383;&#20856;&#21644;&#22823;&#22810;&#25968;&#20854;&#23427;&#31867;&#22411;&#26102;&#65292;&#21035;&#21517;&#21487;&#33021;&#20855;&#26377;&#24847;&#24819;&#19981;&#21040;&#35821;&#20041;&#25928;&#26524;&#12290;&#36825;&#36890;&#24120;&#26377;&#21161;&#20110;&#20248;&#21270;&#31243;&#24207;&#65292;&#22240;&#20026;&#21035;&#21517;&#30340;&#34892;&#20026;&#22312;&#26576;&#20123;&#26041;&#38754;&#31867;&#20284;&#25351;&#38024;&#12290;&#20363;&#22914;&#65292;&#20256;&#36882;&#19968;&#20010;&#23545;&#35937;&#30340;&#24320;&#38144;&#26159;&#24456;&#23567;&#30340;&#65292;&#22240;&#20026;&#22312;&#23454;&#29616;&#19978;&#21482;&#26159;&#20256;&#36882;&#20102;&#19968;&#20010;&#25351;&#38024;&#65307;&#22914;&#26524;&#20989;&#25968;&#20462;&#25913;&#20102;&#21442;&#25968;&#20256;&#36882;&#30340;&#23545;&#35937;&#65292;&#35843;&#29992;&#32773;&#20063;&#23558;&#30475;&#21040;&#21464;&#21270; &#8212;&#8212; &#36825;&#23601;&#36991;&#20813;&#20102;&#31867;&#20284; <code>Pascal</code> &#20013;&#38656;&#35201;&#20004;&#20010;&#19981;&#21516;&#21442;&#25968;&#30340;&#20256;&#36882;&#26426;&#21046;&#12290;</p>
<h3 id="python-&#20316;&#29992;&#22495;&#21644;&#21629;&#21517;&#31354;&#38388;">9.2 Python &#20316;&#29992;&#22495;&#21644;&#21629;&#21517;&#31354;&#38388;</h3>
<p>&#22312;&#20171;&#32461;&#31867;&#20043;&#21069;&#65292;&#39318;&#20808;&#25105;&#35201;&#21578;&#35785;&#20320;&#19968;&#20123;&#26377;&#20851; Python &#20316;&#29992;&#22495;&#30340;&#30340;&#35268;&#21017;&#12290;&#31867;&#30340;&#23450;&#20041;&#38750;&#24120;&#24039;&#22937;&#30340;&#36816;&#29992;&#20102;&#21629;&#21517;&#31354;&#38388;&#65292;&#35201;&#23436;&#20840;&#29702;&#35299;&#25509;&#19979;&#26469;&#30340;&#30693;&#35782;&#65292;&#38656;&#35201;&#20808;&#29702;&#35299;&#20316;&#29992;&#22495;&#21644;&#21629;&#21517;&#31354;&#38388;&#30340;&#24037;&#20316;&#21407;&#29702;&#12290;&#21478;&#22806;&#65292;&#36825;&#19968;&#20999;&#30340;&#30693;&#35782;&#23545;&#20110;&#20219;&#20309;&#39640;&#32423; Python &#31243;&#24207;&#21592;&#37117;&#38750;&#24120;&#26377;&#29992;&#12290;</p>
<p>&#35753;&#25105;&#20204;&#20174;&#19968;&#20123;&#23450;&#20041;&#24320;&#22987;&#12290;</p>
<p>&#21629;&#21517;&#31354;&#38388;&#26159;&#20174;&#21517;&#31216;&#21040;&#23545;&#35937;&#30340;&#26144;&#23556;&#12290;&#24403;&#21069;&#21629;&#21517;&#31354;&#38388;&#20027;&#35201;&#26159;&#36890;&#36807; Python &#23383;&#20856;&#23454;&#29616;&#30340;&#65292;&#19981;&#36807;&#36890;&#24120;&#19981;&#20250;&#24341;&#36215;&#20219;&#20309;&#20851;&#27880;&#65288;&#38500;&#20102;&#24615;&#33021;&#26041;&#38754;&#65289;&#65292;&#23427;&#20197;&#21518;&#20063;&#26377;&#21487;&#33021;&#20250;&#25913;&#21464;&#12290;&#20197;&#19979;&#26377;&#19968;&#20123;&#21629;&#21517;&#31354;&#38388;&#30340;&#20363;&#23376;&#65306;&#20869;&#32622;&#21517;&#31216;&#38598;&#65288;&#21253;&#25324;&#20989;&#25968;&#21517;&#21015;&#22914;<code>abs()</code>&#21644;&#20869;&#32622;&#24322;&#24120;&#30340;&#21517;&#31216;&#65289;&#65307;&#27169;&#22359;&#20013;&#30340;&#20840;&#23616;&#21517;&#31216;&#65307;&#20989;&#25968;&#35843;&#29992;&#20013;&#30340;&#23616;&#37096;&#21517;&#31216;&#12290;&#22312;&#26576;&#31181;&#24847;&#20041;&#19978;&#30340;&#19968;&#32452;&#23545;&#35937;&#30340;&#23646;&#24615;&#20063;&#24418;&#25104;&#19968;&#20010;&#21629;&#21517;&#31354;&#38388;&#12290;&#20851;&#20110;&#21629;&#21517;&#31354;&#38388;&#38656;&#35201;&#30693;&#36947;&#30340;&#37325;&#35201;&#19968;&#28857;&#26159;&#19981;&#21516;&#21629;&#21517;&#31354;&#38388;&#30340;&#21517;&#31216;&#32477;&#23545;&#27809;&#26377;&#20219;&#20309;&#20851;&#31995;&#65307;&#20363;&#22914;&#65292;&#20004;&#20010;&#19981;&#21516;&#27169;&#22359;&#21487;&#20197;&#37117;&#23450;&#20041;&#20989;&#25968;<code>maximize</code>&#32780;&#19981;&#20250;&#20135;&#29983;&#28151;&#28102; &#8212;&#8212; &#27169;&#22359;&#30340;&#20351;&#29992;&#32773;&#24517;&#39035;&#20197;&#27169;&#22359;&#21517;&#20026;&#21069;&#32512;&#24341;&#29992;&#23427;&#20204;&#12290;</p>
<p>&#39034;&#20415;&#35828;&#19968;&#21477;&#65292;&#25105;&#20351;&#29992;<strong>&#23646;&#24615;</strong>&#36825;&#20010;&#35789;&#31216;&#21628;&#28857;&#21518;&#38754;&#30340;&#20219;&#20309;&#21517;&#31216; &#8212;&#8212; &#20363;&#22914;&#65292;&#22312;&#34920;&#36798;&#24335;<code>z.real</code>&#20013;&#65292;<code>real</code>&#26159;<code>z</code>&#23545;&#35937;&#30340;&#19968;&#20010;&#23646;&#24615;&#12290;&#20005;&#26684;&#22320;&#35828;&#65292;&#23545;&#27169;&#22359;&#20013;&#30340;&#21517;&#31216;&#30340;&#24341;&#29992;&#26159;&#23646;&#24615;&#24341;&#29992;&#65306;&#22312;&#34920;&#36798;&#24335;<code>modname.funcname</code>&#20013;&#65292; <code>modname</code>&#26159;&#19968;&#20010;&#27169;&#22359;&#23545;&#35937;&#65292;<code>funcname</code>&#26159;&#23427;&#30340;&#19968;&#20010;&#23646;&#24615;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#27169;&#22359;&#30340;&#23646;&#24615;&#21644;&#27169;&#22359;&#20013;&#23450;&#20041;&#30340;&#20840;&#23616;&#21517;&#31216;&#20043;&#38388;&#30896;&#24039;&#26159;&#30452;&#25509;&#30340;&#26144;&#23556;&#65306;&#23427;&#20204;&#20849;&#20139;&#21516;&#19968;&#21629;&#21517;&#31354;&#38388; &#65281;<a href="#fn1" class="footnoteRef" id="fnref1"><sup>1</sup></a></p>
<p>&#23646;&#24615;&#21487;&#20197;&#26159;&#21482;&#35835;&#30340;&#20063;&#21487;&#20197;&#26159;&#21487;&#20889;&#30340;&#12290;&#22312;&#21518;&#19968;&#31181;&#24773;&#20917;&#19979;&#65292;&#21487;&#20197;&#23545;&#23646;&#24615;&#36171;&#20540;&#12290;&#27169;&#22359;&#30340;&#23646;&#24615;&#37117;&#26159;&#21487;&#20889;&#30340;&#65306;&#20320;&#21487;&#20197;&#36825;&#26679;&#20889;<code>modname.the_answer = 42</code>&#12290;&#21487;&#20889;&#30340;&#23646;&#24615;&#20063;&#21487;&#20197;&#29992;<code>del</code>&#35821;&#21477;&#21024;&#38500;&#12290;&#20363;&#22914;&#65292;<code>del modname.the_answer</code>&#23558;&#20250;&#21024;&#38500;&#23545;&#35937;<code>modname</code>&#20013;&#30340;<code>the_answer</code>&#23646;&#24615;&#12290;</p>
<p>&#21508;&#20010;&#21629;&#21517;&#31354;&#38388;&#21019;&#24314;&#30340;&#26102;&#21051;&#26159;&#19981;&#19968;&#26679;&#30340;&#65292;&#19988;&#26377;&#30528;&#19981;&#21516;&#30340;&#29983;&#21629;&#21608;&#26399;&#12290;&#21253;&#21547;&#20869;&#32622;&#21517;&#31216;&#30340;&#21629;&#21517;&#31354;&#38388;&#22312; Python &#35299;&#37322;&#22120;&#21551;&#21160;&#26102;&#21019;&#24314;&#65292;&#27704;&#36828;&#19981;&#20250;&#34987;&#21024;&#38500;&#12290;&#27169;&#22359;&#30340;&#20840;&#23616;&#21629;&#21517;&#31354;&#38388;&#22312;&#35835;&#20837;&#27169;&#22359;&#23450;&#20041;&#26102;&#21019;&#24314;&#65307;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#27169;&#22359;&#21629;&#21517;&#31354;&#38388;&#20063;&#20250;&#19968;&#30452;&#20445;&#23384;&#21040;&#35299;&#37322;&#22120;&#36864;&#20986;&#12290;&#22312;&#35299;&#37322;&#22120;&#26368;&#22806;&#23618;&#35843;&#29992;&#25191;&#34892;&#30340;&#35821;&#21477;&#65292;&#19981;&#31649;&#26159;&#20174;&#33050;&#26412;&#25991;&#20214;&#20013;&#35835;&#20837;&#36824;&#26159;&#26469;&#33258;&#20132;&#20114;&#24335;&#36755;&#20837;&#65292;&#37117;&#34987;&#24403;&#20316;&#27169;&#22359;__main__&#30340;&#19968;&#37096;&#20998;&#65292;&#25152;&#20197;&#23427;&#20204;&#26377;&#23427;&#20204;&#33258;&#24049;&#30340;&#20840;&#23616;&#21629;&#21517;&#31354;&#38388;&#12290;&#65288;&#20869;&#32622;&#21517;&#31216;&#23454;&#38469;&#19978;&#20063;&#23384;&#22312;&#20110;&#19968;&#20010;&#27169;&#22359;&#20013;&#65292;&#36825;&#20010;&#27169;&#22359;&#21483;builtins&#12290;&#65289;</p>
<p>&#20989;&#25968;&#30340;&#23616;&#37096;&#21629;&#21517;&#31354;&#38388;&#22312;&#20989;&#25968;&#35843;&#29992;&#26102;&#21019;&#24314;&#65292;&#22312;&#20989;&#25968;&#36820;&#22238;&#25110;&#32773;&#24341;&#21457;&#20102;&#19968;&#20010;&#20989;&#25968;&#20869;&#37096;&#27809;&#26377;&#22788;&#29702;&#30340;&#24322;&#24120;&#26102;&#21024;&#38500;&#12290;&#65288;&#23454;&#38469;&#19978;&#65292;&#29992;&#36951;&#24536;&#26469;&#24418;&#23481;&#21040;&#24213;&#21457;&#29983;&#20102;&#20160;&#20040;&#26356;&#20026;&#36148;&#20999;&#12290;)&#24403;&#28982;&#65292;&#27599;&#20010;&#36882;&#24402;&#35843;&#29992;&#26377;&#23427;&#20204;&#33258;&#24049;&#30340;&#23616;&#37096;&#21629;&#21517;&#31354;&#38388;&#12290;</p>
<p><strong>&#20316;&#29992;&#22495;</strong>&#26159; Python &#31243;&#24207;&#20013;&#21487;&#20197;&#30452;&#25509;&#35775;&#38382;&#19968;&#20010;&#21629;&#21517;&#31354;&#38388;&#30340;&#20195;&#30721;&#21306;&#22495;&#12290;&#36825;&#37324;&#30340;&#8220;&#30452;&#25509;&#35775;&#38382;&#8221;&#30340;&#24847;&#24605;&#26159;&#29992;&#27809;&#26377;&#21069;&#32512;&#30340;&#24341;&#29992;&#22312;&#21629;&#21517;&#31354;&#38388;&#20013;&#25214;&#21040;&#30340;&#30456;&#24212;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#34429;&#28982;&#20316;&#29992;&#22495;&#30340;&#30830;&#23450;&#26159;&#38745;&#24577;&#22320;&#65292;&#20294;&#23427;&#20204;&#30340;&#20351;&#29992;&#26159;&#21160;&#24577;&#22320;&#12290;&#31243;&#24207;&#25191;&#34892;&#36807;&#31243;&#20013;&#30340;&#20219;&#20309;&#26102;&#20505;&#65292;&#33267;&#23569;&#26377;&#19977;&#20010;&#23884;&#22871;&#30340;&#20316;&#29992;&#22495;&#65292;&#23427;&#20204;&#30340;&#21629;&#21517;&#31354;&#38388;&#26159;&#21487;&#20197;&#30452;&#25509;&#35775;&#38382;&#30340;&#65306;</p>
<ul>
<li>&#39318;&#20808;&#25628;&#32034;&#26368;&#37324;&#38754;&#21253;&#21547;&#23616;&#37096;&#21629;&#21517;&#30340;&#20316;&#29992;&#22495;</li>
<li>&#20854;&#27425;&#20174;&#37324;&#21521;&#22806;&#25628;&#32034;&#25152;&#26377;&#29238;&#20989;&#25968;&#30340;&#20316;&#29992;&#22495;&#65292;&#20854;&#20013;&#30340;&#21629;&#21517;&#26082;&#38750;&#23616;&#37096;&#20063;&#38750;&#20840;&#23616;</li>
<li>&#20498;&#25968;&#31532;&#20108;&#20010;&#25628;&#32034;&#30340;&#20316;&#29992;&#22495;&#26159;&#21253;&#21547;&#24403;&#21069;&#27169;&#22359;&#20840;&#23616;&#21629;&#21517;&#30340;&#20316;&#29992;&#22495;</li>
<li>&#26368;&#21518;&#25628;&#32034;&#30340;&#20316;&#29992;&#22495;&#26159;&#26368;&#22806;&#38754;&#21253;&#21547;&#20869;&#32622;&#21629;&#21517;&#30340;&#21629;&#21517;&#31354;&#38388;</li>
</ul>
<p>&#22914;&#26524;&#19968;&#20010;&#21629;&#21517;&#22768;&#26126;&#20026;&#20840;&#23616;&#30340;&#65292;&#37027;&#20040;&#23545;&#23427;&#30340;&#25152;&#26377;&#24341;&#29992;&#21644;&#36171;&#20540;&#20250;&#30452;&#25509;&#25628;&#32034;&#21253;&#21547;&#36825;&#20010;&#27169;&#22359;&#20840;&#23616;&#21629;&#21517;&#30340;&#20316;&#29992;&#22495;&#12290;&#22914;&#26524;&#35201;&#37325;&#26032;&#32465;&#23450;&#26368;&#37324;&#23618;&#20316;&#29992;&#22495;&#20043;&#22806;&#30340;&#21464;&#37327;&#65292;&#21487;&#20197;&#20351;&#29992;<code>nonlocal</code>&#35821;&#21477;&#65307;&#22914;&#26524;&#19981;&#22768;&#26126;&#20026;<code>nonlocal</code>&#65292;&#36825;&#20123;&#21464;&#37327;&#23558;&#26159;&#21482;&#35835;&#30340;&#65288;&#23545;&#36825;&#26679;&#30340;&#21464;&#37327;&#36171;&#20540;&#20250;&#22312;&#26368;&#37324;&#38754;&#30340;&#20316;&#29992;&#22495;&#21019;&#24314;&#19968;&#20010;&#26032; &#30340;&#23616;&#37096;&#21464;&#37327;&#65292;&#22806;&#37096;&#20855;&#26377;&#30456;&#21516;&#21629;&#21517;&#30340;&#37027;&#20010;&#21464;&#37327;&#19981;&#20250;&#25913;&#21464;&#65289;&#12290;</p>
<p>&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#23616;&#37096;&#20316;&#29992;&#22495;&#24341;&#29992;&#24403;&#21069;&#20989;&#25968;&#30340;&#26412;&#22320;&#21629;&#21517;&#12290;&#20989;&#25968;&#20043;&#22806;&#65292;&#23616;&#37096;&#20316;&#29992;&#22495;&#24341;&#29992;&#30340;&#21629;&#21517;&#31354;&#38388;&#19982;&#20840;&#23616;&#20316;&#29992;&#22495;&#30456;&#21516;&#65306;&#27169;&#22359;&#30340;&#21629;&#21517;&#31354;&#38388;&#12290;&#31867;&#23450;&#20041;&#22312;&#23616;&#37096;&#21629;&#21517;&#31354;&#38388;&#20013;&#21019;&#24314;&#20102;&#21478;&#19968;&#20010;&#21629;&#21517;&#31354;&#38388;&#12290;</p>
<p>&#35748;&#35782;&#21040;&#20316;&#29992;&#22495;&#26159;&#30001;&#20195;&#30721;&#30830;&#23450;&#30340;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#65306;&#20989;&#25968;&#30340;&#20840;&#23616;&#20316;&#29992;&#22495;&#26159;&#20989;&#25968;&#30340;&#23450;&#20041;&#25152;&#22312;&#30340;&#27169;&#22359;&#30340;&#21629;&#21517;&#31354;&#38388;&#65292;&#19982;&#20989;&#25968;&#35843;&#29992;&#30340;&#20301;&#32622;&#25110;&#32773;&#21035;&#21517;&#26080;&#20851;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;&#21629;&#21517;&#30340;&#23454;&#38469;&#25628;&#32034;&#36807;&#31243;&#26159;&#21160;&#24577;&#30340;&#65292;&#22312;&#36816;&#34892;&#26102;&#30830;&#23450;&#30340;&#8212;&#8212;&#28982;&#32780;&#65292;Python &#35821;&#35328;&#20063;&#22312;&#19981;&#26029;&#21457;&#23637;&#65292;&#20197;&#21518;&#26377;&#21487;&#33021;&#20250;&#25104;&#20026;&#38745;&#24577;&#30340;&#8220;&#32534;&#35793;&#8221;&#26102;&#30830;&#23450;&#65292;&#25152;&#20197;&#19981;&#35201;&#20381;&#36182;&#21160;&#24577;&#35299;&#26512;&#65281;&#65288;&#20107;&#23454;&#19978;&#65292;&#26412;&#22320;&#21464;&#37327;&#26159;&#24050;&#32463;&#30830;&#23450;&#38745;&#24577;&#12290;&#65289;</p>
<p>Python&#30340;&#19968;&#20010;&#29305;&#21035;&#20043;&#22788;&#22312;&#20110;&#8212;&#8212;&#22914;&#26524;&#27809;&#26377;&#20351;&#29992;<code>global</code>&#35821;&#27861;&#8212;&#8212;&#20854;&#36171;&#20540;&#25805;&#20316;&#24635;&#26159;&#22312;&#26368;&#37324;&#23618;&#30340;&#20316;&#29992;&#22495;&#12290;&#36171;&#20540;&#19981;&#20250;&#22797;&#21046;&#25968;&#25454;&#8212;&#8212;&#21482;&#26159;&#23558;&#21629;&#21517;&#32465;&#23450;&#21040;&#23545;&#35937;&#12290;&#21024;&#38500;&#20063;&#26159;&#22914;&#27492;&#65306;<code>del x</code>&#21482;&#26159;&#20174;&#23616;&#37096;&#20316;&#29992;&#22495;&#30340;&#21629;&#21517;&#31354;&#38388;&#20013;&#21024;&#38500;&#21629;&#21517;<code>x</code>&#12290;&#20107;&#23454;&#19978;&#65292;&#25152;&#26377;&#24341;&#20837;&#26032;&#21629;&#21517;&#30340;&#25805;&#20316;&#37117;&#20316;&#29992;&#20110;&#23616;&#37096;&#20316;&#29992;&#22495;&#65306; &#29305;&#21035;&#26159;<code>import</code>&#35821;&#21477;&#21644;&#20989;&#25968;&#23450;&#23558;&#27169;&#22359;&#21517;&#25110;&#20989;&#25968;&#32465;&#23450;&#20110;&#23616;&#37096;&#20316;&#29992;&#22495;&#12290;(&#21487;&#20197;&#20351;&#29992; <a href="http://python.usyiyi.cn/python_343/reference/simple_stmts.html#global"><code>Global</code></a>&#35821;&#21477;&#23558;&#21464;&#37327;&#24341;&#20837;&#21040;&#20840;&#23616;&#20316;&#29992;&#22495;&#12290;)</p>
<p><code>global</code>&#35821;&#21477;&#21487;&#20197;&#29992;&#26469;&#25351;&#26126;&#26576;&#20010;&#29305;&#23450;&#30340;&#34920;&#26126;&#20301;&#20110;&#20840;&#23616;&#20316;&#29992;&#22495;&#24182;&#19988;&#24212;&#35813;&#22312;&#37027;&#37324;&#37325;&#26032;&#32465;&#23450;&#65307;nonlocal&#35821;&#21477;&#34920;&#31034;&#29305;&#23450;&#30340;&#21464;&#37327;&#20301;&#20110;&#19968;&#20010;&#23553;&#38381;&#30340;&#20316;&#29992;&#22495;&#24182;&#19988;&#24212;&#35813;&#22312;&#37027;&#37324;&#37325;&#26032;&#32465;&#23450;&#12290;</p>
<h4 id="&#20316;&#29992;&#22495;&#21644;&#21629;&#21517;&#31354;&#38388;&#31034;&#20363;">9.2.1 &#20316;&#29992;&#22495;&#21644;&#21629;&#21517;&#31354;&#38388;&#31034;&#20363;</h4>
<p>&#19979;&#38754;&#36825;&#20010;&#31034;&#20363;&#28436;&#31034;&#22914;&#20309;&#35775;&#38382;&#19981;&#21516;&#20316;&#29992;&#22495;&#21644;&#21629;&#21517;&#31354;&#38388;&#65292;&#20197;&#21450;<code>global</code> &#21644; <code>nonlocal</code> &#22914;&#20309;&#24433;&#21709;&#21464;&#37327;&#30340;&#32465;&#23450;:</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">def</span> scope_test():
    <span class="kw">def</span> do_local():
        spam <span class="op">=</span> <span class="st">&quot;local spam&quot;</span>
    <span class="kw">def</span> do_nonlocal():
        <span class="kw">nonlocal</span> spam
        spam <span class="op">=</span> <span class="st">&quot;nonlocal spam&quot;</span>
    <span class="kw">def</span> do_global():
        <span class="kw">global</span> spam
        spam <span class="op">=</span> <span class="st">&quot;global spam&quot;</span>
    spam <span class="op">=</span> <span class="st">&quot;test spam&quot;</span>
    do_local()
    <span class="bu">print</span>(<span class="st">&quot;After local assignment:&quot;</span>, spam)
    do_nonlocal()
    <span class="bu">print</span>(<span class="st">&quot;After nonlocal assignment:&quot;</span>, spam)
    do_global()
    <span class="bu">print</span>(<span class="st">&quot;After global assignment:&quot;</span>, spam)

scope_test()
<span class="bu">print</span>(<span class="st">&quot;In global scope:&quot;</span>, spam)</code></pre></div>
<p>&#31034;&#20363;&#20195;&#30721;&#30340;&#36755;&#20986;&#20026;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">After local assignment: test spam
After <span class="kw">nonlocal</span> assignment: <span class="kw">nonlocal</span> spam
After <span class="kw">global</span> assignment: <span class="kw">nonlocal</span> spams.
In <span class="kw">global</span> scope: <span class="kw">global</span> spam</code></pre></div>
<blockquote>
<p>&#27880;&#24847;&#65292;local&#36171;&#20540;&#65288;&#40664;&#35748;&#34892;&#20026;&#65289;&#27809;&#26377;&#25913;&#21464;scope_testspam&#30340;&#32465;&#23450;&#12290;nonlocal&#36171;&#20540;&#25913;&#21464;&#20102;scope_test&#23545;spam &#30340;&#32465;&#23450;&#65292;global&#36171;&#20540;&#25913;&#21464;&#20102;&#27169;&#22359;&#32423;&#21035;&#30340;&#32465;&#23450;&#12290;</p>
</blockquote>
<p>&#20320;&#20063;&#21487;&#20197;&#30475;&#21040;&#22312;global&#35821;&#21477;&#20043;&#21069;&#27809;&#26377;&#23545;spam&#30340;&#32465;&#23450;&#12290;</p>
<h3 id="&#21021;&#35782;&#31867;">9.3. &#21021;&#35782;&#31867;</h3>
<p>&#31867;&#24341;&#20837;&#20102;&#23569;&#37327;&#30340;&#26032;&#35821;&#27861;&#12289;&#19977;&#31181;&#26032;&#23545;&#35937;&#31867;&#22411;&#21644;&#19968;&#20123;&#26032;&#35821;&#20041;&#12290;</p>
<h4 id="&#31867;&#23450;&#20041;&#35821;&#27861;">9.3.1 &#31867;&#23450;&#20041;&#35821;&#27861;</h4>
<p>&#31867;&#23450;&#20041;&#30340;&#26368;&#31616;&#21333;&#24418;&#24335;&#22914;&#19979;&#25152;&#31034;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> ClassName:
    <span class="op">&lt;</span>statement<span class="dv">-1</span><span class="op">&gt;</span>
    .
    .
    .
    <span class="op">&lt;</span>statement<span class="op">-</span>N<span class="op">&gt;</span></code></pre></div>
<p>&#31867;&#30340;&#23450;&#20041;&#23601;&#20687;&#20989;&#25968;&#23450;&#20041;&#65288;<code>def</code>&#35821;&#21477;&#65289;&#65292;&#35201;&#20808;&#25191;&#34892;&#25165;&#33021;&#29983;&#25928;&#12290;(&#20320;&#24403;&#28982;&#21487;&#20197;&#25226;&#23427;&#25918;&#36827;<code>if</code>&#35821;&#21477;&#30340;&#26576;&#19968;&#20998;&#25903;&#65292;&#25110;&#32773;&#19968;&#20010;&#20989;&#25968;&#30340;&#20869;&#37096;&#12290;)</p>
<p>&#23454;&#38469;&#24212;&#29992;&#20013;&#65292;&#31867;&#23450;&#20041;&#21253;&#21547;&#30340;&#35821;&#21477;&#36890;&#24120;&#26159;&#20989;&#25968;&#23450;&#20041;&#65292;&#19981;&#36807;&#20854;&#23427;&#35821;&#21477;&#20063;&#26159;&#21487;&#20197;&#30340;&#32780;&#19988;&#26377;&#26102;&#36824;&#20250;&#24456;&#26377;&#29992;&#8212;&#8212;&#21518;&#38754;&#25105;&#20204;&#20250;&#20877;&#22238;&#26469;&#35752;&#35770;&#12290;&#31867;&#20013;&#30340;&#20989;&#25968;&#23450;&#20041;&#36890;&#24120;&#26377;&#19968;&#20010;&#29305;&#27530;&#24418;&#24335;&#30340;&#21442;&#25968;&#21015;&#34920;&#65292;&#36825;&#26159;&#30001;&#26041;&#27861;&#35843;&#29992;&#30340;&#21327;&#35758;&#20915;&#23450;&#30340;&#8212;&#8212;&#21516;&#26679;&#21518;&#38754;&#20250;&#35299;&#37322;&#36825;&#20123;&#12290;</p>
<p>&#36827;&#20837;&#31867;&#23450;&#20041;&#37096;&#20998;&#21518;&#65292;&#20250;&#21019;&#24314;&#20986;&#19968;&#20010;&#26032;&#30340;&#21629;&#21517;&#31354;&#38388;&#65292;&#20316;&#20026;&#23616;&#37096;&#20316;&#29992;&#22495;&#8212;&#8212;&#22240;&#27492;&#65292;&#25152;&#26377;&#30340;&#36171;&#20540;&#25104;&#20026;&#36825;&#20010;&#26032;&#21629;&#21517;&#31354;&#38388;&#30340;&#23616;&#37096;&#21464;&#37327;&#12290;&#29305;&#21035;&#26159;&#36825;&#37324;&#30340;&#20989;&#25968;&#23450;&#20041;&#20250;&#32465;&#23450;&#26032;&#20989;&#25968;&#30340;&#21517;&#23383;&#12290;</p>
<p>&#31867;&#23450;&#20041;&#27491;&#24120;&#36864;&#20986;&#26102;&#65292;&#19968;&#20010;&#31867;&#23545;&#35937;&#20063;&#23601;&#21019;&#24314;&#20102;&#12290;&#22522;&#26412;&#19978;&#23427;&#26159;&#23545;&#31867;&#23450;&#20041;&#21019;&#24314;&#30340;&#21629;&#21517;&#31354;&#38388;&#36827;&#34892;&#20102;&#19968;&#20010;&#21253;&#35013;&#65307;&#25105;&#20204;&#22312;&#19979;&#19968;&#33410;&#23558;&#36827;&#19968;&#27493;&#23398;&#20064;&#31867;&#23545;&#35937;&#30340;&#30693;&#35782;&#12290;&#21407;&#22987;&#30340;&#23616;&#37096;&#20316;&#29992;&#22495;&#65288;&#31867;&#23450;&#20041;&#24341;&#20837;&#20043;&#21069;&#29983;&#25928;&#30340;&#37027;&#20010;&#65289;&#24471;&#21040;&#24674;&#22797;&#65292;&#31867;&#23545;&#35937;&#22312;&#36825;&#37324;&#32465;&#23450;&#21040;&#31867;&#23450;&#20041;&#22836;&#37096;&#30340;&#31867;&#21517;&#65288;&#20363;&#23376;&#20013;&#26159;<code>ClassName</code>&#65289;&#12290;</p>
<h4 id="&#31867;&#23545;&#35937;">9.3.2 &#31867;&#23545;&#35937;</h4>
<p>&#31867;&#23545;&#35937;&#25903;&#25345;&#20004;&#31181;&#25805;&#20316;&#65306;<strong>&#23646;&#24615;&#24341;&#29992;</strong>&#21644;<strong>&#23454;&#20363;&#21270;</strong>&#12290;</p>
<p><strong>&#23646;&#24615;&#24341;&#29992;</strong>&#20351;&#29992;&#30340;&#25152;&#26377;&#23646;&#24615;&#24341;&#29992;&#22312; Python &#20013;&#20351;&#29992;&#30340;&#26631;&#20934;&#35821;&#27861;&#65306;<code>obj.name</code>&#12290;&#26377;&#25928;&#30340;&#23646;&#24615;&#21517;&#31216;&#26159;&#22312;&#35813;&#31867;&#30340;&#21629;&#21517;&#31354;&#38388;&#20013;&#30340;&#31867;&#23545;&#35937;&#34987;&#21019;&#24314;&#26102;&#30340;&#25152;&#26377;&#21517;&#31216;&#12290;&#22240;&#27492;&#65292;&#22914;&#26524;&#31867;&#23450;&#20041;&#30475;&#36215;&#26469;&#20687;&#36825;&#26679;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> MyClass:
    <span class="co">&quot;&quot;&quot;A simple example class&quot;&quot;&quot;</span>
    i <span class="op">=</span> <span class="dv">12345</span>
    <span class="kw">def</span> f(<span class="va">self</span>):
        <span class="cf">return</span> <span class="st">&#39;hello world&#39;</span></code></pre></div>
<p>&#37027;&#20040; <code>MyClass.i</code> &#21644; <code>MyClass.f</code> &#26159;&#26377;&#25928;&#30340;&#23646;&#24615;&#24341;&#29992;&#65292;&#20998;&#21035;&#36820;&#22238;&#19968;&#20010;&#25972;&#25968;&#21644;&#19968;&#20010;&#26041;&#27861;&#23545;&#35937;&#12290;&#20063;&#21487;&#20197;&#23545;&#31867;&#23646;&#24615;&#36171;&#20540;&#65292;&#20320;&#21487;&#20197;&#36890;&#36807;&#32473; <code>MyClass.i</code> &#36171;&#20540;&#26469;&#20462;&#25913;&#23427;&#12290;<code>__doc__</code> &#20063;&#26159;&#19968;&#20010;&#26377;&#25928;&#30340;&#23646;&#24615;&#65292;&#36820;&#22238;&#31867;&#30340;&#25991;&#26723;&#23383;&#31526;&#20018;&#65306; <code>&quot;A simple example class&quot;</code>&#12290;</p>
<p><strong>&#31867;&#30340;&#23454;&#20363;&#21270;</strong> &#20351;&#29992;&#20989;&#25968;&#30340;&#31526;&#21495;&#12290;&#21487;&#20197;&#20551;&#35774;&#31867;&#23545;&#35937;&#26159;&#19968;&#20010;&#19981;&#24102;&#21442;&#25968;&#30340;&#20989;&#25968;&#65292;&#35813;&#20989;&#25968;&#36820;&#22238;&#36825;&#20010;&#31867;&#30340;&#19968;&#20010;&#26032;&#30340;&#23454;&#20363;&#12290;&#20363;&#22914;&#65288;&#20551;&#35774;&#27839;&#29992;&#19978;&#38754;&#30340;&#31867;&#65289;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">x <span class="op">=</span> MyClass()</code></pre></div>
<p>&#21019;&#24314;&#36825;&#20010;&#31867;&#30340;&#19968;&#20010;&#26032;&#23454;&#20363;&#65292;&#24182;&#23558;&#35813;&#23545;&#35937;&#36171;&#32473;&#23616;&#37096;&#21464;&#37327;x&#12290;</p>
<p>&#23454;&#20363;&#21270;&#25805;&#20316;&#65288;&#8220;&#35843;&#29992;&#8221;&#19968;&#20010;&#31867;&#23545;&#35937;&#65289;&#23558;&#21019;&#24314;&#19968;&#20010;&#31354;&#23545;&#35937;&#12290;&#24456;&#22810;&#31867;&#24076;&#26395;&#21019;&#24314;&#30340;&#23545;&#35937;&#21487;&#20197;&#33258;&#23450;&#20041;&#19968;&#20010;&#21021;&#22987;&#29366;&#24577;&#12290;&#22240;&#27492;&#31867;&#21487;&#20197;&#23450;&#20041;&#19968;&#20010;&#21517;&#20026;<code>__init__()</code>&#30340;&#29305;&#27530;&#26041;&#27861;&#65292;&#20687;&#19979;&#38754;&#36825;&#26679;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">def</span> <span class="fu">__init__</span>(<span class="va">self</span>):
    <span class="va">self</span>.data <span class="op">=</span> []</code></pre></div>
<p>&#24403;&#31867;&#23450;&#20041;&#20102;<code>__init__()</code>&#26041;&#27861;&#65292;&#31867;&#30340;&#23454;&#20363;&#21270;&#20250;&#20026;&#26032;&#21019;&#24314;&#30340;&#31867;&#23454;&#20363;&#33258;&#21160;&#35843;&#29992;<code>__init__()</code>&#12290;&#25152;&#20197;&#22312;&#19979;&#38754;&#30340;&#31034;&#20363;&#20013;&#65292;&#21487;&#20197;&#33719;&#24471;&#19968;&#20010;&#26032;&#30340;&#12289;&#24050;&#21021;&#22987;&#21270;&#30340;&#23454;&#20363;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">x <span class="op">=</span> MyClass()</code></pre></div>
<p>&#24403;&#28982;&#65292;<code>__init__()</code>&#26041;&#27861;&#21487;&#20197;&#24102;&#26377;&#21442;&#25968;&#65292;&#36825;&#23558;&#24102;&#26469;&#26356;&#22823;&#30340;&#28789;&#27963;&#24615;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#31867;&#23454;&#20363;&#21270;&#25805;&#20316;&#30340;&#21442;&#25968;&#23558;&#20256;&#36882;&#32473;<code>__init__()</code>&#12290;&#20363;&#22914;&#65292;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> Complex:
    <span class="kw">def</span> <span class="fu">__init__</span>(<span class="va">self</span>, realpart, imagpart):
        <span class="va">self</span>.r <span class="op">=</span> realpart
        <span class="va">self</span>.i <span class="op">=</span> imagpart

x <span class="op">=</span> Complex(<span class="fl">3.0</span>, <span class="op">-</span><span class="fl">4.5</span>)
x.r, x.i
<span class="co">## (3.0, -4.5)</span></code></pre></div>
<h4 id="&#23454;&#20363;&#23545;&#35937;">9.3.3 &#23454;&#20363;&#23545;&#35937;</h4>
<p>&#29616;&#22312;&#25105;&#20204;&#21487;&#20197;&#29992;&#23454;&#20363;&#23545;&#35937;&#20570;&#20160;&#20040;&#65311;&#23454;&#20363;&#23545;&#35937;&#21807;&#19968;&#21487;&#29992;&#30340;&#25805;&#20316;&#23601;&#26159;&#23646;&#24615;&#24341;&#29992;&#12290;&#26377;&#20004;&#31181;&#26377;&#25928;&#30340;&#23646;&#24615;&#21517;&#65306;&#25968;&#25454;&#23646;&#24615;&#21644;&#26041;&#27861;&#12290;</p>
<p>&#25968;&#25454;&#23646;&#24615;&#30456;&#24403;&#20110; <code>Smalltalk</code> &#20013;&#30340;&quot;&#23454;&#20363;&#21464;&#37327;&quot;&#25110; C++ &#20013;&#30340;&quot;&#25968;&#25454;&#25104;&#21592;&quot;&#12290;&#25968;&#25454;&#23646;&#24615;&#19981;&#38656;&#35201;&#22768;&#26126;&#65307;&#21644;&#23616;&#37096;&#21464;&#37327;&#19968;&#26679;&#65292;&#23427;&#20204;&#20250;&#22312;&#31532;&#19968;&#27425;&#32473;&#23427;&#20204;&#36171;&#20540;&#26102;&#29983;&#25104;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;<code>x</code>&#26159;&#19978;&#38754;&#21019;&#24314;&#30340;<code>MyClass</code>&#30340;&#23454;&#20363;&#65292;&#19979;&#38754;&#30340;&#20195;&#30721;&#27573;&#23558;&#25171;&#21360;&#20986;&#20540;16&#32780;&#19981;&#20250;&#20986;&#29616;&#38169;&#35823;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">x.counter <span class="op">=</span> <span class="dv">1</span>
<span class="cf">while</span> x.counter <span class="op">&lt;</span> <span class="dv">10</span>:
    x.counter <span class="op">=</span> x.counter <span class="op">*</span> <span class="dv">2</span>
<span class="bu">print</span>(x.counter)
<span class="kw">del</span> x.counter</code></pre></div>
<p>&#23454;&#20363;&#23646;&#24615;&#24341;&#29992;&#30340;&#21478;&#19968;&#31181;&#31867;&#22411;&#26159;&#26041;&#27861;&#12290;&#26041;&#27861;&#26159;&quot;&#23646;&#20110;&quot;&#19968;&#20010;&#23545;&#35937;&#30340;&#20989;&#25968;&#12290;&#65288;&#22312; Python&#65292;&#26041;&#27861;&#36825;&#20010;&#26415;&#35821;&#19981;&#21482;&#38024;&#23545;&#31867;&#23454;&#20363;&#65306;&#20854;&#20182;&#23545;&#35937;&#31867;&#22411;&#20063;&#21487;&#20197;&#20855;&#26377;&#26041;&#27861;&#12290;&#20363;&#22914;&#65292;&#21015;&#34920;&#23545;&#35937;&#26377; <code>append</code>&#12289;<code>insert</code>&#12289;<code>remove</code>&#12289;<code>sort</code> &#26041;&#27861;&#31561;&#31561;&#12290;&#20294;&#26159;&#22312;&#21518;&#38754;&#30340;&#35752;&#35770;&#20013;&#65292;&#38500;&#38750;&#26126;&#30830;&#35828;&#26126;&#65292;&#25105;&#20204;&#25552;&#21040;&#30340;&#26041;&#27861;&#29305;&#25351;&#31867;&#23454;&#20363;&#23545;&#35937;&#30340;&#26041;&#27861;&#12290;)</p>
<p>&#23454;&#20363;&#23545;&#35937;&#30340;&#26041;&#27861;&#30340;&#26377;&#25928;&#21517;&#31216;&#20381;&#36182;&#20110;&#23427;&#30340;&#31867;&#12290;&#26681;&#25454;&#23450;&#20041;&#65292;&#31867;&#20013;&#25152;&#26377;&#20989;&#25968;&#23545;&#35937;&#30340;&#23646;&#24615;&#23450;&#20041;&#20102;&#20854;&#23454;&#20363;&#20013;&#30456;&#24212;&#30340;&#26041;&#27861;&#12290;&#25152;&#20197;&#22312;&#25105;&#20204;&#30340;&#31034;&#20363;&#20013;&#65292; <code>x.f</code>&#26159;&#19968;&#20010;&#26377;&#25928;&#30340;&#26041;&#27861;&#30340;&#24341;&#29992;&#65292;&#22240;&#20026;<code>MyClass.f</code>&#26159;&#19968;&#20010;&#20989;&#25968;&#65292;&#20294;<code>x.i</code>&#19981;&#26159;&#65292;&#22240;&#20026;<code>MyClass.i</code>&#19981;&#26159;&#19968;&#20010;&#20989;&#25968;&#12290;&#20294;<code>x.f</code>&#19982;<code>MyClass.f</code>&#20063;&#19981;&#26159;&#19968;&#22238;&#20107; &#8212;&#8212; &#23427;&#26159;&#19968;&#20010;&#26041;&#27861;&#23545;&#35937;&#65292;&#19981;&#26159;&#19968;&#20010;&#20989;&#25968;&#23545;&#35937;&#12290;</p>
<h4 id="&#26041;&#27861;&#23545;&#35937;">9.3.4 &#26041;&#27861;&#23545;&#35937;</h4>
<p>&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;&#26041;&#27861;&#22312;&#32465;&#23450;&#20043;&#21518;&#34987;&#30452;&#25509;&#35843;&#29992;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">x.f()</code></pre></div>
<p>&#22312;<code>MyClass</code>&#30340;&#31034;&#20363;&#20013;&#65292;&#36825;&#23558;&#36820;&#22238;&#23383;&#31526;&#20018;<code>'hello world'</code>&#12290;&#28982;&#32780;&#65292;&#20063;&#19981;&#26159;&#19968;&#23450;&#35201;&#30452;&#25509;&#35843;&#29992;&#26041;&#27861;&#65306;<code>x.f</code>&#26159;&#19968;&#20010;&#26041;&#27861;&#23545;&#35937;&#65292;&#21487;&#20197;&#23384;&#20648;&#36215;&#26469;&#20197;&#21518;&#35843;&#29992;&#12290;&#20363;&#22914;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">xf <span class="op">=</span> x.f
<span class="cf">while</span> <span class="va">True</span>:
    <span class="bu">print</span>(xf())</code></pre></div>
<p>&#20250;&#19981;&#26029;&#22320;&#25171;&#21360;hello world&#12290;</p>
<p>&#35843;&#29992;&#26041;&#27861;&#26102;&#21040;&#24213;&#21457;&#29983;&#20102;&#20160;&#20040;&#65311;&#20320;&#21487;&#33021;&#24050;&#32463;&#27880;&#24847;&#21040;&#65292;&#19978;&#38754;<code>x.f()</code>&#30340;&#35843;&#29992;&#27809;&#26377;&#21442;&#25968;&#65292;&#21363;&#20351;<code>f ()</code>&#20989;&#25968;&#30340;&#23450;&#20041;&#25351;&#23450;&#20102;&#19968;&#20010;&#21442;&#25968;&#12290;&#35813;&#21442;&#25968;&#21457;&#29983;&#20102;&#20160;&#20040;&#38382;&#39064;&#65311;&#24403;&#28982;&#22914;&#26524;&#20989;&#25968;&#35843;&#29992;&#20013;&#32570;&#23569;&#21442;&#25968; Python &#20250;&#25243;&#20986;&#24322;&#24120;&#8212;&#8212;&#21363;&#20351;&#36825;&#20010;&#21442;&#25968;&#23454;&#38469;&#19978;&#27809;&#26377;&#20351;&#29992;&#8230;&#8230;</p>
<p>&#23454;&#38469;&#19978;&#65292;&#20320;&#21487;&#33021;&#24050;&#32463;&#29468;&#21040;&#20102;&#31572;&#26696;&#65306;&#26041;&#27861;&#30340;&#29305;&#21035;&#20043;&#22788;&#22312;&#20110;&#23454;&#20363;&#23545;&#35937;&#34987;&#20316;&#20026;&#20989;&#25968;&#30340;&#31532;&#19968;&#20010;&#21442;&#25968;&#20256;&#32473;&#20102;&#20989;&#25968;&#12290;&#22312;&#25105;&#20204;&#30340;&#31034;&#20363;&#20013;&#65292;&#35843;&#29992;<code>x.f()</code>&#23436;&#20840;&#31561;&#21516;&#20110;<code>MyClass.f(x)</code>&#12290;&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#20197;n &#20010;&#21442;&#25968;&#30340;&#21015;&#34920;&#35843;&#29992;&#19968;&#20010;&#26041;&#27861;&#23601;&#30456;&#24403;&#20110;&#23558;&#26041;&#27861;&#25152;&#23646;&#30340;&#23545;&#35937;&#25554;&#20837;&#21040;&#21015;&#34920;&#30340;&#31532;&#19968;&#20010;&#21442;&#25968;&#30340;&#21069;&#38754;&#65292;&#28982;&#21518;&#20197;&#26032;&#30340;&#21015;&#34920;&#35843;&#29992;&#30456;&#24212;&#30340;&#20989;&#25968;&#12290;</p>
<p>&#22914;&#26524;&#20320;&#36824;&#26159;&#19981;&#26126;&#30333;&#26041;&#27861;&#30340;&#24037;&#20316;&#21407;&#29702;&#65292;&#20102;&#35299;&#19968;&#19979;&#23427;&#30340;&#23454;&#29616;&#25110;&#35768;&#26377;&#24110;&#21161;&#12290;&#24341;&#29992;&#38750;&#25968;&#25454;&#23646;&#24615;&#30340;&#23454;&#20363;&#23646;&#24615;&#26102;&#65292;&#20250;&#25628;&#32034;&#23427;&#30340;&#31867;&#12290;&#22914;&#26524;&#36825;&#20010;&#21629;&#21517;&#30830;&#35748;&#20026;&#19968;&#20010;&#26377;&#25928;&#30340;&#20989;&#25968;&#23545;&#35937;&#31867;&#23646;&#24615;&#65292;&#23601;&#20250;&#23558;&#23454;&#20363;&#23545;&#35937;&#21644;&#20989;&#25968;&#23545;&#35937;&#23553;&#35013;&#36827;&#19968;&#20010;&#25277;&#35937;&#23545;&#35937;&#65306;&#36825;&#23601;&#26159;&#26041;&#27861;&#23545;&#35937;&#12290;&#20197;&#19968;&#20010;&#21442;&#25968;&#21015;&#34920;&#35843;&#29992;&#26041;&#27861;&#23545;&#35937;&#26102;&#65292;&#23427;&#34987;&#37325;&#26032;&#25286;&#23553;&#65292;&#29992;&#23454;&#20363;&#23545;&#35937;&#21644;&#21407;&#22987;&#30340;&#21442;&#25968;&#21015;&#34920;&#26500;&#36896;&#19968;&#20010;&#26032;&#30340;&#21442;&#25968;&#21015;&#34920;&#65292;&#28982;&#21518;&#20989;&#25968;&#23545;&#35937;&#35843;&#29992;&#36825;&#20010;&#26032;&#30340;&#21442;&#25968;&#21015;&#34920;&#12290; #### 9.3.5 &#31867;&#21644;&#23454;&#20363;&#21464;&#37327;</p>
<p>&#19968;&#33324;&#26469;&#35828;&#65292;&#23454;&#20363;&#21464;&#37327;&#29992;&#20110;&#23545;&#27599;&#19968;&#20010;&#23454;&#20363;&#37117;&#26159;&#21807;&#19968;&#30340;&#25968;&#25454;&#65292;&#31867;&#21464;&#37327;&#29992;&#20110;&#31867;&#30340;&#25152;&#26377;&#23454;&#20363;&#20849;&#20139;&#30340;&#23646;&#24615;&#21644;&#26041;&#27861;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> Dog:
    kind <span class="op">=</span> <span class="st">&#39;canine&#39;</span>         <span class="co"># class variable shared by all instances</span>
    <span class="kw">def</span> <span class="fu">__init__</span>(<span class="va">self</span>, name):
        <span class="va">self</span>.name <span class="op">=</span> name    <span class="co"># instance variable unique to each instance</span>

d <span class="op">=</span> Dog(<span class="st">&#39;Fido&#39;</span>)
e <span class="op">=</span> Dog(<span class="st">&#39;Buddy&#39;</span>)
d.kind                  <span class="co"># shared by all dogs</span>
<span class="co">## &#39;canine&#39;</span>
e.kind                  <span class="co"># shared by all dogs</span>
<span class="co">## &#39;canine&#39;</span>
d.name                  <span class="co"># unique to d</span>
<span class="co">## &#39;Fido&#39;</span>
e.name                  <span class="co"># unique to e</span>
<span class="co">## &#39;Buddy&#39;</span></code></pre></div>
<p>&#27491;&#22914;&#22312;&#21517;&#31216;&#21644;&#23545;&#35937;&#35752;&#35770;&#30340;&#65292;&#21487;&#21464;&#23545;&#35937;(&#20363;&#22914;&#21015;&#34920;&#21644;&#23383;&#20856;)&#30340;&#20849;&#20139;&#25968;&#25454;&#21487;&#33021;&#24102;&#26469;&#24847;&#22806;&#30340;&#25928;&#26524;&#12290;&#20363;&#22914;&#65292;&#19979;&#38754;&#20195;&#30721;&#20013;&#30340;<code>tricks</code>&#21015;&#34920;&#19981;&#24212;&#35813;&#29992;&#20316;&#31867;&#21464;&#37327;&#65292;&#22240;&#20026;&#25152;&#26377;&#30340;<code>Dog</code>&#23454;&#20363;&#23558;&#20849;&#20139;&#21516;&#19968;&#20010;&#21015;&#34920;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> Dog:
    tricks <span class="op">=</span> []             <span class="co"># mistaken use of a class variable</span>
    <span class="kw">def</span> <span class="fu">__init__</span>(<span class="va">self</span>, name):
        <span class="va">self</span>.name <span class="op">=</span> name
    <span class="kw">def</span> add_trick(<span class="va">self</span>, trick):
        <span class="va">self</span>.tricks.append(trick)

d <span class="op">=</span> Dog(<span class="st">&#39;Fido&#39;</span>)
e <span class="op">=</span> Dog(<span class="st">&#39;Buddy&#39;</span>)
d.add_trick(<span class="st">&#39;roll over&#39;</span>)
e.add_trick(<span class="st">&#39;play dead&#39;</span>)
d.tricks                <span class="co"># unexpectedly shared by all dogs</span>
<span class="co">## [&#39;roll over&#39;, &#39;play dead&#39;]</span></code></pre></div>
<p>&#36825;&#20010;&#31867;&#30340;&#27491;&#30830;&#35774;&#35745;&#24212;&#35813;&#20351;&#29992;&#19968;&#20010;&#23454;&#20363;&#21464;&#37327;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> Dog:
    <span class="kw">def</span> <span class="fu">__init__</span>(<span class="va">self</span>, name):
        <span class="va">self</span>.name <span class="op">=</span> name
        <span class="va">self</span>.tricks <span class="op">=</span> []    <span class="co"># creates a new empty list for each dog</span>
    <span class="kw">def</span> add_trick(<span class="va">self</span>, trick):
        <span class="va">self</span>.tricks.append(trick)

d <span class="op">=</span> Dog(<span class="st">&#39;Fido&#39;</span>)
e <span class="op">=</span> Dog(<span class="st">&#39;Buddy&#39;</span>)
d.add_trick(<span class="st">&#39;roll over&#39;</span>)
e.add_trick(<span class="st">&#39;play dead&#39;</span>)
d.tricks
<span class="co">## [&#39;roll over&#39;]</span>
e.tricks
<span class="co">## [&#39;play dead&#39;]</span></code></pre></div>
<h3 id="&#34917;&#20805;&#35828;&#26126;">9.4 &#34917;&#20805;&#35828;&#26126;</h3>
<p>&#25968;&#25454;&#23646;&#24615;&#20250;&#35206;&#30422;&#21516;&#21517;&#30340;&#26041;&#27861;&#23646;&#24615;&#65307;&#20026;&#20102;&#36991;&#20813;&#24847;&#22806;&#30340;&#21629;&#21517;&#20914;&#31361;&#65292;&#36825;&#22312;&#22823;&#22411;&#31243;&#24207;&#20013;&#21487;&#33021;&#24102;&#26469;&#26497;&#38590;&#21457;&#29616;&#30340; <code>bug</code>&#65292;&#20351;&#29992;&#19968;&#20123;&#32422;&#23450;&#26469;&#20943;&#23569;&#20914;&#31361;&#30340;&#26426;&#20250;&#26159;&#26126;&#26234;&#30340;&#12290;&#21487;&#33021;&#30340;&#32422;&#23450;&#21253;&#25324;&#22823;&#20889;&#26041;&#27861;&#21517;&#31216;&#30340;&#39318;&#23383;&#27597;&#65292;&#20351;&#29992;&#19968;&#20010;&#21807;&#19968;&#30340;&#23567;&#20889;&#30340;&#23383;&#31526;&#20018;&#65288;&#20063;&#35768;&#21482;&#26159;&#19968;&#20010;&#19979;&#21010;&#32447;&#65289;&#20316;&#20026;&#25968;&#25454;&#23646;&#24615;&#21517;&#31216;&#30340;&#21069;&#32512;&#65292;&#25110;&#32773;&#26041;&#27861;&#20351;&#29992;&#21160;&#35789;&#32780;&#25968;&#25454;&#23646;&#24615;&#20351;&#29992;&#21517;&#35789;&#12290;</p>
<p>&#25968;&#25454;&#23646;&#24615;&#21487;&#20197;&#34987;&#26041;&#27861;&#24341;&#29992;&#65292;&#20063;&#21487;&#20197;&#30001;&#19968;&#20010;&#23545;&#35937;&#30340;&#26222;&#36890;&#29992;&#25143;&#65288;&#8220;&#23458;&#25143;&#31471;&#8221;&#65289;&#20351;&#29992;&#12290;&#25442;&#21477;&#35805;&#35828;&#65292;&#31867;&#26159;&#19981;&#33021;&#29992;&#26469;&#23454;&#29616;&#32431;&#25277;&#35937;&#25968;&#25454;&#31867;&#22411;&#12290;&#20107;&#23454;&#19978;&#65292;Python &#20013;&#19981;&#21487;&#33021;&#24378;&#21046;&#38544;&#34255;&#25968;&#25454;&#8212;&#8212;&#19968;&#20999;&#22522;&#20110;&#32422;&#23450;&#12290;&#65288;&#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#38656;&#35201;&#65292;&#20351;&#29992; C &#32534;&#20889;&#30340; Python &#23454;&#29616;&#21487;&#20197;&#23436;&#20840;&#38544;&#34255;&#23454;&#29616;&#32454;&#33410;&#24182;&#25511;&#21046;&#23545;&#35937;&#30340;&#35775;&#38382;&#65307;&#36825;&#21487;&#20197;&#29992;&#26469;&#36890;&#36807; C &#35821;&#35328;&#25193;&#23637; Python&#12290;&#65289;</p>
<p>&#23458;&#25143;&#24212;&#35813;&#35880;&#24910;&#30340;&#20351;&#29992;&#25968;&#25454;&#23646;&#24615;&#8212;&#8212;&#23458;&#25143;&#21487;&#33021;&#36890;&#36807;&#36341;&#36367;&#20182;&#20204;&#30340;&#25968;&#25454;&#23646;&#24615;&#32780;&#20351;&#37027;&#20123;&#30001;&#26041;&#27861;&#32500;&#25252;&#30340;&#24120;&#37327;&#21464;&#24471;&#28151;&#20081;&#12290;&#27880;&#24847;&#65306;&#21482;&#35201;&#33021;&#36991;&#20813;&#20914;&#31361;&#65292;&#23458;&#25143;&#21487;&#20197;&#21521;&#19968;&#20010;&#23454;&#20363;&#23545;&#35937;&#28155;&#21152;&#20182;&#20204;&#33258;&#24049;&#30340;&#25968;&#25454;&#23646;&#24615;&#65292;&#32780;&#19981;&#20250;&#24433;&#21709;&#26041;&#27861;&#30340;&#27491;&#30830;&#24615;&#8212;&#8212;&#20877;&#27425;&#24378;&#35843;&#65292;&#21629;&#21517;&#32422;&#23450;&#21487;&#20197;&#36991;&#20813;&#24456;&#22810;&#40635;&#28902;&#12290;</p>
<p>&#20174;&#26041;&#27861;&#20869;&#37096;&#24341;&#29992;&#25968;&#25454;&#23646;&#24615;&#65288;&#25110;&#20854;&#20182;&#26041;&#27861;&#65289;&#24182;&#27809;&#26377;&#24555;&#25463;&#26041;&#24335;&#12290;&#25105;&#35273;&#24471;&#36825;&#23454;&#38469;&#19978;&#22686;&#21152;&#20102;&#26041;&#27861;&#30340;&#21487;&#35835;&#24615;&#65306;&#24403;&#27983;&#35272;&#19968;&#20010;&#26041;&#27861;&#26102;&#65292;&#22312;&#23616;&#37096;&#21464;&#37327;&#21644;&#23454;&#20363;&#21464;&#37327;&#20043;&#38388;&#19981;&#20250;&#20986;&#29616;&#20196;&#20154;&#36153;&#35299;&#30340;&#24773;&#20917;&#12290;</p>
<p>&#36890;&#24120;&#65292;&#26041;&#27861;&#30340;&#31532;&#19968;&#20010;&#21442;&#25968;&#31216;&#20026;<code>self</code>&#12290;&#36825;&#20165;&#20165;&#26159;&#19968;&#20010;&#32422;&#23450;&#65306;&#21517;&#23383;<code>self</code>&#23545; Python &#32780;&#35328;&#32477;&#23545;&#27809;&#26377;&#20219;&#20309;&#29305;&#27530;&#21547;&#20041;&#12290;&#20294;&#26159;&#35831;&#27880;&#24847;&#65306;&#22914;&#26524;&#19981;&#36981;&#24490;&#36825;&#20010;&#32422;&#23450;&#65292;&#23545;&#20854;&#20182;&#30340; Python &#31243;&#24207;&#21592;&#32780;&#35328;&#20320;&#30340;&#20195;&#30721;&#21487;&#35835;&#24615;&#23601;&#20250;&#21464;&#24046;&#65292;&#32780;&#19988;&#26377;&#20123;&#31867;<code>&#26597;&#30475;&#22120;</code>&#31243;&#24207;&#20063;&#21487;&#33021;&#26159;&#36981;&#24490;&#27492;&#32422;&#23450;&#32534;&#20889;&#30340;&#12290;</p>
<p>&#31867;&#23646;&#24615;&#30340;&#20219;&#20309;&#20989;&#25968;&#23545;&#35937;&#37117;&#20026;&#37027;&#20010;&#31867;&#30340;&#23454;&#20363;&#23450;&#20041;&#20102;&#19968;&#20010;&#26041;&#27861;&#12290;&#20989;&#25968;&#23450;&#20041;&#20195;&#30721;&#19981;&#19968;&#23450;&#38750;&#24471;&#23450;&#20041;&#22312;&#31867;&#20013;&#65306;&#20063;&#21487;&#20197;&#23558;&#19968;&#20010;&#20989;&#25968;&#23545;&#35937;&#36171;&#20540;&#32473;&#31867;&#20013;&#30340;&#19968;&#20010;&#23616;&#37096;&#21464;&#37327;&#12290;&#20363;&#22914;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="co"># Function defined outside the class</span>
<span class="kw">def</span> f1(<span class="va">self</span>, x, y):
    <span class="cf">return</span> <span class="bu">min</span>(x, x<span class="op">+</span>y)

<span class="kw">class</span> C:
    f <span class="op">=</span> f1
    <span class="kw">def</span> g(<span class="va">self</span>):
        <span class="cf">return</span> <span class="st">&#39;hello world&#39;</span>
    h <span class="op">=</span> g</code></pre></div>
<p>&#29616;&#22312;<code>f</code>&#12289; <code>g</code>&#21644;<code>h</code>&#37117;&#26159;<code>&#31867;C</code>&#20013;&#24341;&#29992;&#20989;&#25968;&#23545;&#35937;&#30340;&#23646;&#24615;&#65292;&#22240;&#27492;&#23427;&#20204;&#37117;&#26159;c&#30340;&#23454;&#20363;&#30340;&#26041;&#27861; &#8212;&#8212; <code>h</code>&#23436;&#20840;&#31561;&#21516;&#20110;<code>g</code>&#12290;&#35831;&#27880;&#24847;&#65292;&#36825;&#31181;&#20570;&#27861;&#36890;&#24120;&#21482;&#20250;&#28151;&#28102;&#31243;&#24207;&#30340;&#35835;&#32773;&#12290;</p>
<p>&#36890;&#36807;&#20351;&#29992;<code>self</code>&#21033;&#29992;&#21442;&#25968;&#30340;&#26041;&#27861;&#23646;&#24615;&#65292;&#21487;&#20197;&#35843;&#29992;&#20854;&#20182;&#26041;&#27861;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> Bag:
    <span class="kw">def</span> <span class="fu">__init__</span>(<span class="va">self</span>):
        <span class="va">self</span>.data <span class="op">=</span> []
    <span class="kw">def</span> add(<span class="va">self</span>, x):
        <span class="va">self</span>.data.append(x)
    <span class="kw">def</span> addtwice(<span class="va">self</span>, x):
        <span class="va">self</span>.add(x)
        <span class="va">self</span>.add(x)</code></pre></div>
<p>&#26041;&#27861;&#21487;&#20197;&#20687;&#26222;&#36890;&#20989;&#25968;&#37027;&#26679;&#24341;&#29992;&#20840;&#23616;&#21629;&#21517;&#12290;&#19982;&#26041;&#27861;&#20851;&#32852;&#30340;&#20840;&#23616;&#20316;&#29992;&#22495;&#26159;&#21253;&#21547;&#31867;&#23450;&#20041;&#30340;&#27169;&#22359;&#12290;&#65288;&#31867;&#26412;&#36523;&#27704;&#36828;&#19981;&#20250;&#20570;&#20026;&#20840;&#23616;&#20316;&#29992;&#22495;&#20351;&#29992;&#12290;&#65289;&#23613;&#31649;&#24456;&#23569;&#26377;&#22909;&#30340;&#29702;&#30001;&#22312;&#26041;&#27861;&#20013;&#20351;&#29992;&#20840;&#23616;&#25968;&#25454;&#65292;&#20840;&#23616;&#20316;&#29992;&#22495;&#30830;&#26377;&#24456;&#22810;&#21512;&#27861;&#30340;&#29992;&#36884;&#65306;&#20854;&#19968;&#26159;&#26041;&#27861;&#21487;&#20197;&#35843;&#29992;&#23548;&#20837;&#20840;&#23616;&#20316;&#29992;&#22495;&#30340;&#20989;&#25968;&#21644;&#26041;&#27861;&#65292;&#20063;&#21487;&#20197;&#35843;&#29992;&#23450;&#20041;&#22312;&#20854;&#20013;&#30340;&#31867;&#21644;&#20989;&#25968;&#12290;&#36890;&#24120;&#65292;&#21253;&#21547;&#27492;&#26041;&#27861;&#30340;&#31867;&#20063;&#20250;&#23450;&#20041;&#22312;&#36825;&#20010;&#20840;&#23616;&#20316;&#29992;&#22495;&#65292;&#22312;&#19979;&#19968;&#33410;&#25105;&#20204;&#20250;&#20102;&#35299;&#20026;&#20309;&#19968;&#20010;&#26041;&#27861;&#35201;&#24341;&#29992;&#33258;&#24049;&#30340;&#31867;&#12290;</p>
<p>&#27599;&#20010;&#20540;&#26159;&#37117;&#19968;&#20010;&#23545;&#35937;&#65292;&#22240;&#27492;&#27599;&#20010;&#20540;&#37117;&#26377;&#19968;&#20010;&#31867;&#65288;&#20063;&#31216;&#23427;&#30340;&#31867;&#22411;&#65289;&#12290;&#23427;&#23384;&#20648;&#20026;<code>object.__class__</code>&#12290;</p>
<h3 id="&#32487;&#25215;">9.5 &#32487;&#25215;</h3>
<p>&#24403;&#28982;&#65292;&#19968;&#20010;&#35821;&#35328;&#29305;&#24615;&#19981;&#25903;&#25345;&#32487;&#25215;&#26159;&#37197;&#19981;&#19978;&#8220;&#31867;&#8221;&#36825;&#20010;&#21517;&#23383;&#30340;&#12290;&#27966;&#29983;&#31867;&#23450;&#20041;&#30340;&#35821;&#27861;&#22914;&#19979;&#25152;&#31034;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> DerivedClassName(BaseClassName):
    <span class="op">&lt;</span>statement<span class="dv">-1</span><span class="op">&gt;</span>
    .
    .
    .
    <span class="op">&lt;</span>statement<span class="op">-</span>N<span class="op">&gt;</span></code></pre></div>
<p><code>BaseClassName</code>&#24517;&#39035;&#19982;&#27966;&#29983;&#31867;&#23450;&#20041;&#22312;&#19968;&#20010;&#20316;&#29992;&#22495;&#20869;&#12290;&#29992;&#20854;&#20182;&#20219;&#24847;&#34920;&#36798;&#24335;&#20195;&#26367;&#22522;&#31867;&#30340;&#21517;&#31216;&#20063;&#26159;&#20801;&#35768;&#30340;&#12290;&#36825;&#21487;&#20197;&#26159;&#26377;&#29992;&#30340;&#65292;&#20363;&#22914;&#65292;&#24403;&#22522;&#31867;&#23450;&#20041;&#22312;&#21478;&#19968;&#20010;&#27169;&#22359;&#20013;&#26102;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> DerivedClassName(modname.BaseClassName):</code></pre></div>
<p>&#27966;&#29983;&#31867;&#23450;&#20041;&#30340;&#25191;&#34892;&#36807;&#31243;&#21644;&#22522;&#31867;&#26159;&#30456;&#21516;&#30340;&#12290;&#31867;&#23545;&#35937;&#21019;&#24314;&#21518;&#65292;&#22522;&#31867;&#20250;&#34987;&#20445;&#23384;&#12290;&#36825;&#29992;&#20110;&#35299;&#26512;&#23646;&#24615;&#30340;&#24341;&#29992;&#65306;&#22914;&#26524;&#22312;&#31867;&#20013;&#25214;&#19981;&#21040;&#35831;&#27714;&#30340;&#23646;&#24615;&#65292;&#25628;&#32034;&#20250;&#22312;&#22522;&#31867;&#20013;&#32487;&#32493;&#12290;&#22914;&#26524;&#22522;&#31867;&#26412;&#36523;&#26159;&#30001;&#21035;&#30340;&#31867;&#27966;&#29983;&#32780;&#26469;&#65292;&#36825;&#20010;&#35268;&#21017;&#20250;&#36882;&#24402;&#24212;&#29992;&#12290;</p>
<p>&#27966;&#29983;&#31867;&#30340;&#23454;&#20363;&#21270;&#27809;&#26377;&#20160;&#20040;&#29305;&#27530;&#20043;&#22788;&#65306;<code>DerivedClassName()</code>&#21019;&#24314;&#31867;&#30340;&#19968;&#20010;&#26032;&#30340;&#23454;&#20363;&#12290;&#26041;&#27861;&#30340;&#24341;&#29992;&#25353;&#22914;&#19979;&#35268;&#21017;&#35299;&#26512;&#65306; &#25628;&#32034;&#23545;&#24212;&#30340;&#31867;&#30340;&#23646;&#24615;&#65292;&#24517;&#35201;&#26102;&#27839;&#22522;&#31867;&#38142;&#36880;&#32423;&#25628;&#32034;&#65292;&#22914;&#26524;&#25214;&#21040;&#20102;&#20989;&#25968;&#23545;&#35937;&#36825;&#20010;&#26041;&#27861;&#24341;&#29992;&#23601;&#26159;&#21512;&#27861;&#30340;&#12290;</p>
<p>&#27966;&#29983;&#30340;&#31867;&#21487;&#33021;&#37325;&#20889;&#20854;&#22522;&#31867;&#30340;&#26041;&#27861;&#12290;&#22240;&#20026;&#26041;&#27861;&#35843;&#29992;&#21516;&#19968;&#20010;&#23545;&#35937;&#20013;&#30340;&#20854;&#23427;&#26041;&#27861;&#26102;&#27809;&#26377;&#29305;&#26435;&#65292;&#22522;&#31867;&#30340;&#26041;&#27861;&#35843;&#29992;&#21516;&#19968;&#20010;&#22522;&#31867;&#30340;&#26041;&#27861;&#26102;&#65292;&#21487;&#33021;&#23454;&#38469;&#19978;&#26368;&#32456;&#35843;&#29992;&#20102;&#27966;&#29983;&#31867;&#20013;&#30340;&#35206;&#30422;&#26041;&#27861;&#12290;&#65288;&#23545;&#20110; C++ &#31243;&#24207;&#21592;&#65306;Python &#20013;&#30340;&#25152;&#26377;&#26041;&#27861;&#23454;&#38469;&#19978;&#37117;&#26159;&#34394;&#30340;&#12290;)</p>
<p>&#27966;&#29983;&#31867;&#20013;&#30340;&#35206;&#30422;&#26041;&#27861;&#21487;&#33021;&#26159;&#24819;&#35201;&#25193;&#20805;&#32780;&#19981;&#26159;&#31616;&#21333;&#30340;&#26367;&#20195;&#22522;&#31867;&#20013;&#30340;&#37325;&#21517;&#26041;&#27861;&#12290;&#26377;&#19968;&#20010;&#31616;&#21333;&#30340;&#26041;&#27861;&#21487;&#20197;&#30452;&#25509;&#35843;&#29992;&#22522;&#31867;&#26041;&#27861;&#65306;&#21482;&#35201;&#35843;&#29992;<code>BaseClassName.methodname(self, arguments)</code>&#12290;&#26377;&#26102;&#36825;&#23545;&#20110;&#23458;&#25143;&#31471;&#20063;&#24456;&#26377;&#29992;&#12290;&#65288;&#35201;&#27880;&#24847;&#21482;&#26377;<code>BaseClassName</code>&#22312;&#21516;&#19968;&#20840;&#23616;&#20316;&#29992;&#22495;&#23450;&#20041;&#25110;&#23548;&#20837;&#26102;&#25165;&#33021;&#36825;&#26679;&#29992;&#12290;&#65289;</p>
<p>Python &#26377;&#20004;&#20010;&#29992;&#20110;&#32487;&#25215;&#30340;&#20989;&#25968;&#65306;</p>
<ul>
<li>&#20351;&#29992;<code>isinstance()</code>&#26469;&#26816;&#26597;&#23454;&#20363;&#31867;&#22411;&#65306;<code>isinstance(obj, int)</code>&#21482;&#26377;<code>obj.__class__</code>&#26159;<code>int</code>&#25110;&#32773;&#26159;&#20174;<code>int</code>&#27966;&#29983;&#30340;&#31867;&#26102;&#25165;&#20026;<code>True</code>&#12290;</li>
<li>&#20351;&#29992;<code>issubclass()</code>&#26469;&#26816;&#26597;&#31867;&#30340;&#32487;&#25215;: <code>issubclas(bool&#65292;int)</code>&#26159;<code>True</code>&#22240;&#20026;<code>bool</code>&#26159;<code>int</code>&#30340;&#23376;&#31867;&#12290;&#28982;&#32780;&#65292;<code>issubclass(float, int)</code>&#20026;<code>False</code>&#65292;&#22240;&#20026;<code>float</code>&#19981;&#26159;<code>int</code>&#30340;&#23376;&#31867;&#12290;</li>
</ul>
<h4 id="&#22810;&#32487;&#25215;">9.5.1 &#22810;&#32487;&#25215;</h4>
<p>Python &#20063;&#25903;&#25345;&#19968;&#31181;&#24418;&#24335;&#30340;&#22810;&#32487;&#25215;&#12290;&#20855;&#26377;&#22810;&#20010;&#22522;&#31867;&#30340;&#31867;&#23450;&#20041;&#22914;&#19979;&#25152;&#31034;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> DerivedClassName(Base1, Base2, Base3):
    <span class="op">&lt;</span>statement<span class="dv">-1</span><span class="op">&gt;</span>
    .
    .
    .
    <span class="op">&lt;</span>statement<span class="op">-</span>N<span class="op">&gt;</span></code></pre></div>
<p>&#23545;&#20110;&#22823;&#22810;&#25968;&#29992;&#36884;&#65292;&#22312;&#26368;&#31616;&#21333;&#30340;&#24773;&#20917;&#19979;&#65292;&#20320;&#21487;&#20197;&#35748;&#20026;&#32487;&#25215;&#33258;&#29238;&#31867;&#30340;&#23646;&#24615;&#25628;&#32034;&#26159;&#20174;&#24038;&#21040;&#21491;&#30340;&#28145;&#24230;&#20248;&#20808;&#25628;&#32034;&#65292;&#19981;&#20250;&#22312;&#21516;&#19968;&#20010;&#31867;&#20013;&#25628;&#32034;&#20004;&#27425;&#65292;&#21363;&#20351;&#23618;&#27425;&#20250;&#26377;&#37325;&#21472;&#12290;&#22240;&#27492;&#65292;&#22914;&#26524;&#22312;<code>DerivedClassName</code>&#20013;&#25214;&#19981;&#21040;&#23646;&#24615;&#65292;&#23427;&#25628;&#32034;<code>Base1</code>&#65292;&#28982;&#21518;&#65288;&#36882;&#24402;&#65289;&#22522;&#31867;&#20013;&#30340;<code>Base1</code>&#65292;&#22914;&#26524;&#27809;&#26377;&#25214;&#21040;&#65292;&#23427;&#20250;&#25628;&#32034;<code>base2</code>&#65292;&#20381;&#27492;&#31867;&#25512;&#12290;</p>
<p>&#20107;&#23454;&#35201;&#31245;&#24494;&#22797;&#26434;&#19968;&#20123;&#65307;&#20026;&#20102;&#25903;&#25345;&#21512;&#20316;&#35843;&#29992;<code>super()</code>&#65292;&#26041;&#27861;&#35299;&#26512;&#30340;&#39034;&#24207;&#20250;&#21160;&#24577;&#25913;&#21464;&#12290;&#36825;&#31181;&#26041;&#27861;&#22312;&#26576;&#20123;&#20854;&#23427;&#22810;&#32487;&#25215;&#30340;&#35821;&#35328;&#20013;&#20063;&#26377;&#24182;&#21483;&#20570;<code>call-next-method</code>&#65292;&#23427;&#27604;&#21333;&#32487;&#25215;&#35821;&#35328;&#20013;&#30340;<code>super</code>&#35843;&#29992;&#26356;&#24378;&#22823;&#12290;</p>
<p>&#21160;&#24577;&#35843;&#25972;&#39034;&#24207;&#26159;&#24517;&#35201;&#30340;&#65292;&#22240;&#20026;&#25152;&#26377;&#30340;&#22810;&#32487;&#25215;&#37117;&#20250;&#26377;&#19968;&#20010;&#25110;&#22810;&#20010;&#33777;&#24418;&#20851;&#31995;(&#20174;&#26368;&#24213;&#37096;&#30340;&#31867;&#21521;&#19978;&#65292;&#33267;&#23569;&#20250;&#26377;&#19968;&#20010;&#29238;&#31867;&#21487;&#20197;&#36890;&#36807;&#22810;&#26465;&#36335;&#24452;&#35775;&#38382;&#21040;&#65289;&#12290;&#20363;&#22914;&#65292;&#25152;&#26377;&#30340;&#31867;&#37117;&#32487;&#25215;&#33258;<code>object</code>&#65292;&#25152;&#20197;&#20219;&#20309;&#22810;&#32487;&#25215;&#37117;&#20250;&#26377;&#22810;&#26465;&#36335;&#24452;&#21040;&#36798;<code>object</code>&#12290;&#20026;&#20102;&#38450;&#27490;&#22522;&#31867;&#34987;&#37325;&#22797;&#35775;&#38382;&#65292;&#21160;&#24577;&#31639;&#27861;&#32447;&#24615;&#21270;&#25628;&#32034;&#39034;&#24207;&#65292;&#27599;&#20010;&#31867;&#37117;&#25353;&#20174;&#24038;&#21040;&#21491;&#30340;&#39034;&#24207;&#29305;&#21035;&#25351;&#23450;&#20102;&#39034;&#24207;&#65292;&#27599;&#20010;&#29238;&#31867;&#21482;&#35843;&#29992;&#19968;&#27425;&#65292;&#36825;&#26159;&#21333;&#35843;&#30340;&#65288;&#20063;&#23601;&#26159;&#35828;&#19968;&#20010;&#31867;&#34987;&#32487;&#25215;&#26102;&#19981;&#20250;&#24433;&#21709;&#23427;&#31062;&#20808;&#30340;&#27425;&#24207;&#65289;&#12290;&#25152;&#26377;&#36825;&#20123;&#29305;&#24615;&#20351;&#24471;&#35774;&#35745;&#21487;&#38752;&#24182;&#19988;&#21487;&#25193;&#23637;&#30340;&#22810;&#32487;&#25215;&#31867;&#25104;&#20026;&#21487;&#33021;&#12290;&#26377;&#20851;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;https://www.python.org/download/releases/2.3/mro/&#12290;</p>
<h3 id="&#31169;&#26377;&#21464;&#37327;">9.6 &#31169;&#26377;&#21464;&#37327;</h3>
<p>&#22312; Python &#20013;&#19981;&#23384;&#22312;&#21482;&#33021;&#20174;&#23545;&#35937;&#20869;&#37096;&#35775;&#38382;&#30340;&#8220;&#31169;&#26377;&#8221;&#23454;&#20363;&#21464;&#37327;&#12290;&#28982;&#32780;&#65292;&#26377;&#19968;&#39033;&#22823;&#22810;&#25968; Python &#20195;&#30721;&#37117;&#36981;&#24490;&#30340;&#20844;&#32422;&#65306;&#24102;&#26377;&#19979;&#21010;&#32447;&#65288;&#20363;&#22914;<code>_spam</code>&#65289;&#21069;&#32512;&#30340;&#21517;&#31216;&#24212;&#34987;&#35270;&#20026;&#38750;&#20844;&#24320;&#30340; API &#30340;&#19968;&#37096;&#20998;&#65288;&#26080;&#35770;&#26159;&#20989;&#25968;&#12289; &#26041;&#27861;&#36824;&#26159;&#25968;&#25454;&#25104;&#21592;&#65289;&#12290;&#23427;&#24212;&#35813;&#34987;&#24403;&#20570;&#19968;&#20010;&#23454;&#29616;&#32454;&#33410;&#65292;&#23558;&#26469;&#22914;&#26524;&#26377;&#21464;&#21270;&#24661;&#19981;&#21478;&#34892;&#36890;&#30693;&#12290;</p>
<p>&#22240;&#20026;&#26377;&#19968;&#20010;&#21512;&#29702;&#30340;&#31867;&#31169;&#26377;&#25104;&#21592;&#30340;&#20351;&#29992;&#22330;&#26223;&#65288;&#21363;&#20026;&#20102;&#36991;&#20813;&#21517;&#31216;&#19982;&#23376;&#31867;&#23450;&#20041;&#30340;&#21517;&#31216;&#20914;&#31361;&#65289;&#65292;Python &#23545;&#36825;&#31181;&#26426;&#21046;&#26377;&#31616;&#21333;&#30340;&#25903;&#25345;&#65292;&#21483;&#20570;<code>name mangling</code>&#12290;<code>__spam</code> &#24418;&#24335;&#30340;&#20219;&#20309;&#26631;&#35782;&#31526;(&#21069;&#38754;&#33267;&#23569;&#20004;&#20010;&#19979;&#21010;&#32447;&#65292;&#21518;&#38754;&#33267;&#22810;&#19968;&#20010;&#19979;&#21010;&#32447;&#65289;&#23558;&#34987;&#26367;&#25442;&#20026;<code>_classname__spam</code>&#65292;<code>classname</code>&#26159;&#24403;&#21069;&#31867;&#30340;&#21517;&#23383;&#12290;&#27492;&#37325;&#25972;&#26159;&#20570;&#32780;&#19981;&#32771;&#34385;&#35813;&#26631;&#35782;&#31526;&#30340;&#21477;&#27861;&#20301;&#32622;&#65292;&#21482;&#35201;&#23427;&#20986;&#29616;&#22312;&#31867;&#30340;&#23450;&#20041;&#30340;&#33539;&#22260;&#20869;&#12290;</p>
<p><code>Name mangling</code> &#26377;&#21033;&#20110;&#23376;&#31867;&#37325;&#20889;&#29238;&#31867;&#30340;&#26041;&#27861;&#32780;&#19981;&#20250;&#30772;&#22351;&#31867;&#20869;&#37096;&#30340;&#26041;&#27861;&#35843;&#29992;&#12290;&#20363;&#22914;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> Mapping:
    <span class="kw">def</span> <span class="fu">__init__</span>(<span class="va">self</span>, iterable):
        <span class="va">self</span>.items_list <span class="op">=</span> []
        <span class="va">self</span>.__update(iterable)

    <span class="kw">def</span> update(<span class="va">self</span>, iterable):
        <span class="cf">for</span> item <span class="op">in</span> iterable:
            <span class="va">self</span>.items_list.append(item)

    __update <span class="op">=</span> update   <span class="co"># private copy of original update() method</span>

<span class="kw">class</span> MappingSubclass(Mapping):

    <span class="kw">def</span> update(<span class="va">self</span>, keys, values):
        <span class="co"># provides new signature for update()</span>
        <span class="co"># but does not break __init__()</span>
        <span class="cf">for</span> item <span class="op">in</span> <span class="bu">zip</span>(keys, values):
            <span class="va">self</span>.items_list.append(item)</code></pre></div>
<p>&#35831;&#27880;&#24847;&#21517;&#31216;&#25913;&#32534;&#30340;&#30446;&#30340;&#20027;&#35201;&#26159;&#36991;&#20813;&#21457;&#29983;&#24847;&#22806;&#65307;&#35775;&#38382;&#25110;&#32773;&#20462;&#25913;&#31169;&#26377;&#21464;&#37327;&#20173;&#28982;&#26159;&#21487;&#33021;&#30340;&#12290;&#36825;&#22312;&#29305;&#27530;&#24773;&#20917;&#19979;&#65292;&#20363;&#22914;&#35843;&#35797;&#30340;&#26102;&#20505;&#65292;&#36824;&#26159;&#26377;&#29992;&#30340;&#12290;</p>
<p>&#27880;&#24847;&#20256;&#36882;&#32473;<code>exec</code>&#25110;<code>eval()</code>&#30340;&#20195;&#30721;&#27809;&#26377;&#32771;&#34385;&#35201;&#23558;&#35843;&#29992;&#31867;&#30340;&#31867;&#21517;&#24403;&#20316;&#24403;&#21069;&#31867;&#65307;&#36825;&#31867;&#20284;&#20110;<code>global</code>&#35821;&#21477;&#30340;&#25928;&#26524;&#65292;&#24433;&#21709;&#21482;&#38480;&#20110;&#19968;&#36215;&#36827;&#34892;&#23383;&#33410;&#32534;&#35793;&#30340;&#20195;&#30721;&#12290;&#30456;&#21516;&#30340;&#38480;&#21046;&#36866;&#29992;&#20110;<code>getattr()</code>&#12289; <code>setattr()</code>&#21644;<code>delattr()</code>&#65292;&#20197;&#21450;&#30452;&#25509;&#24341;&#29992;<code>__dict__</code>&#26102;&#12290;</p>
<h3 id="&#38646;&#30862;&#30340;&#35828;&#26126;">9.7 &#38646;&#30862;&#30340;&#35828;&#26126;</h3>
<p>&#26377;&#26102;&#20505;&#31867;&#20284;&#20110;Pascal &#30340;<code>&quot;record&quot;</code> &#25110; C &#30340;<code>&quot;struct&quot;</code>&#30340;&#25968;&#25454;&#31867;&#22411;&#24456;&#26377;&#29992;&#65292;&#23427;&#20204;&#25226;&#20960;&#20010;&#24050;&#21629;&#21517;&#30340;&#25968;&#25454;&#39033;&#30446;&#32465;&#23450;&#22312;&#19968;&#36215;&#12290;&#19968;&#20010;&#31354;&#30340;&#31867;&#23450;&#20041;&#21487;&#20197;&#24456;&#22909;&#22320;&#20570;&#21040;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> Employee:
    <span class="cf">pass</span>

john <span class="op">=</span> Employee() <span class="co"># Create an empty employee record</span>

<span class="co"># Fill the fields of the record</span>
john.name <span class="op">=</span> <span class="st">&#39;John Doe&#39;</span>
john.dept <span class="op">=</span> <span class="st">&#39;computer lab&#39;</span>
john.salary <span class="op">=</span> <span class="dv">1000</span></code></pre></div>
<p>&#26576;&#19968;&#27573; Python &#20195;&#30721;&#38656;&#35201;&#19968;&#20010;&#29305;&#27530;&#30340;&#25277;&#35937;&#25968;&#25454;&#32467;&#26500;&#30340;&#35805;&#65292;&#36890;&#24120;&#21487;&#20197;&#20256;&#20837;&#19968;&#20010;&#31867;&#26469;&#27169;&#25311;&#35813;&#25968;&#25454;&#31867;&#22411;&#30340;&#26041;&#27861;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20320;&#26377;&#19968;&#20010;&#29992;&#20110;&#20174;&#25991;&#20214;&#23545;&#35937;&#20013;&#26684;&#24335;&#21270;&#25968;&#25454;&#30340;&#20989;&#25968;&#65292;&#20320;&#21487;&#20197;&#23450;&#20041;&#19968;&#20010;&#24102;&#26377;<code>read ()</code>&#21644;<code>readline ()</code> &#26041;&#27861;&#30340;&#31867;&#65292;&#20197;&#27492;&#20174;&#23383;&#31526;&#20018;&#32531;&#20914;&#35835;&#21462;&#25968;&#25454;&#65292;&#28982;&#21518;&#23558;&#35813;&#31867;&#30340;&#23545;&#35937;&#20316;&#20026;&#21442;&#25968;&#20256;&#20837;&#21069;&#36848;&#30340;&#20989;&#25968;&#12290;</p>
<p>&#23454;&#20363;&#30340;&#26041;&#27861;&#23545;&#35937;&#20063;&#26377;&#23646;&#24615;&#65306;<code>m.__self__</code>&#26159;&#20855;&#26377;&#26041;&#27861;<code>m()</code>&#30340;&#23454;&#20363;&#23545;&#35937;&#65292;<code>m.__func__</code>&#26159;&#26041;&#27861;&#30340;&#20989;&#25968;&#23545;&#35937;&#12290;</p>
<h2 id="&#24322;&#24120;&#20063;&#26159;&#31867;">9.8 &#24322;&#24120;&#20063;&#26159;&#31867;</h2>
<p>&#29992;&#25143;&#23450;&#20041;&#30340;&#24322;&#24120;&#31867;&#20063;&#30001;&#31867;&#26631;&#35782;&#12290;&#21033;&#29992;&#36825;&#20010;&#26426;&#21046;&#21487;&#20197;&#21019;&#24314;&#21487;&#25193;&#23637;&#30340;&#24322;&#24120;&#23618;&#27425;&#12290;</p>
<p><code>raise</code>&#35821;&#21477;&#26377;&#20004;&#31181;&#26032;&#30340;&#26377;&#25928;&#30340;&#65288;&#35821;&#20041;&#19978;&#30340;&#65289;&#24418;&#24335;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="cf">raise</span> Class

<span class="cf">raise</span> Instance</code></pre></div>
<p>&#31532;&#19968;&#31181;&#24418;&#24335;&#20013;&#65292;<code>Class</code> &#24517;&#39035;&#26159;<code>type</code>&#25110;&#32773;&#23427;&#30340;&#23376;&#31867;&#30340;&#19968;&#20010;&#23454;&#20363;&#12290;&#31532;&#19968;&#31181;&#24418;&#24335;&#26159;&#19968;&#31181;&#31616;&#20889;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="cf">raise</span> Class()</code></pre></div>
<p><code>except</code>&#23376;&#21477;&#20013;&#30340;&#31867;&#22914;&#26524;&#19982;&#24322;&#24120;&#26159;&#21516;&#19968;&#20010;&#31867;&#25110;&#32773;&#26159;&#20854;&#22522;&#31867;&#65292;&#37027;&#20040;&#23427;&#20204;&#23601;&#26159;&#30456;&#23481;&#30340;&#65288;&#20294;&#26159;&#21453;&#36807;&#26469;&#26159;&#19981;&#34892;&#30340;&#8212;&#8212;<code>except</code>&#23376;&#21477;&#21015;&#20986;&#30340;&#23376;&#31867;&#19982;&#22522;&#31867;&#26159;&#19981;&#30456;&#23481;&#30340;&#65289;&#12290;&#20363;&#22914;&#65292;&#19979;&#38754;&#30340;&#20195;&#30721;&#23558;&#25353;&#35813;&#39034;&#24207;&#25171;&#21360; <code>B&#12289; C&#12289; D</code>&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> B(<span class="pp">Exception</span>):
    <span class="cf">pass</span>
<span class="kw">class</span> C(B):
    <span class="cf">pass</span>
<span class="kw">class</span> D(C):
    <span class="cf">pass</span>

<span class="cf">for</span> cls <span class="op">in</span> [B, C, D]:
    <span class="cf">try</span>:
        <span class="cf">raise</span> cls()
    <span class="cf">except</span> D:
        <span class="bu">print</span>(<span class="st">&quot;D&quot;</span>)
    <span class="cf">except</span> C:
        <span class="bu">print</span>(<span class="st">&quot;C&quot;</span>)
    <span class="cf">except</span> B:
        <span class="bu">print</span>(<span class="st">&quot;B&quot;</span>)</code></pre></div>
<p>&#35831;&#27880;&#24847;&#65292;&#22914;&#26524;<code>except</code> &#23376;&#21477;&#30340;&#39034;&#24207;&#20498;&#36807;&#26469; (<code>excpet B</code>&#22312;&#26368;&#21069;&#38754;&#65289;&#65292;&#23427;&#23601;&#20250;&#25171;&#21360;<code>B&#65292;B&#65292;B</code> &#8212;&#8212; &#31532;&#19968;&#20010;&#21305;&#37197;&#30340;&#24322;&#24120;&#34987;&#35302;&#21457;&#12290;</p>
<p>&#25171;&#21360;&#19968;&#20010;&#24322;&#24120;&#31867;&#30340;&#38169;&#35823;&#20449;&#24687;&#26102;&#65292;&#20808;&#25171;&#21360;&#31867;&#21517;&#65292;&#28982;&#21518;&#26159;&#19968;&#20010;&#31354;&#26684;&#12289;&#19968;&#20010;&#20882;&#21495;&#65292;&#28982;&#21518;&#26159;&#29992;&#20869;&#32622;&#20989;&#25968;<code>str()</code>&#23558;&#31867;&#36716;&#25442;&#24471;&#21040;&#30340;&#23436;&#25972;&#23383;&#31526;&#20018;&#12290;</p>
<h3 id="&#36845;&#20195;&#22120;">9.9. &#36845;&#20195;&#22120;</h3>
<p>&#29616;&#22312;&#20320;&#21487;&#33021;&#27880;&#24847;&#21040;&#22823;&#22810;&#25968;&#23481;&#22120;&#23545;&#35937;&#37117;&#21487;&#20197;&#29992;<code>for</code>&#36941;&#21382;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="cf">for</span> element <span class="op">in</span> [<span class="dv">1</span>, <span class="dv">2</span>, <span class="dv">3</span>]:
    <span class="bu">print</span>(element)
<span class="cf">for</span> element <span class="op">in</span> (<span class="dv">1</span>, <span class="dv">2</span>, <span class="dv">3</span>):
    <span class="bu">print</span>(element)
<span class="cf">for</span> key <span class="op">in</span> {<span class="st">&#39;one&#39;</span>:<span class="dv">1</span>, <span class="st">&#39;two&#39;</span>:<span class="dv">2</span>}:
    <span class="bu">print</span>(key)
<span class="cf">for</span> char <span class="op">in</span> <span class="st">&quot;123&quot;</span>:
    <span class="bu">print</span>(char)
<span class="cf">for</span> line <span class="op">in</span> <span class="bu">open</span>(<span class="st">&quot;myfile.txt&quot;</span>):
    <span class="bu">print</span>(line, end<span class="op">=</span><span class="st">&#39;&#39;</span>)</code></pre></div>
<p>&#36825;&#31181;&#35775;&#38382;&#39118;&#26684;&#28165;&#26224;&#12289; &#31616;&#27905;&#21448;&#26041;&#20415;&#12290;&#36845;&#20195;&#22120;&#30340;&#29992;&#27861;&#22312; Python &#20013;&#26222;&#36941;&#32780;&#19988;&#32479;&#19968;&#12290;&#22312;&#21518;&#21488;&#65292; <code>for</code>&#35821;&#21477;&#35843;&#29992;&#20256;&#20837;&#20102;&#23481;&#22120;&#23545;&#35937;&#30340;<code>iter()</code> &#12290;&#35813;&#20989;&#25968;&#36820;&#22238;&#19968;&#20010;&#23450;&#20041;&#20102;<code>__next__()</code>&#26041;&#27861;&#30340;&#36845;&#20195;&#22120;&#23545;&#35937;&#65292;&#23427;&#22312;&#23481;&#22120;&#20013;&#36880;&#19968;&#35775;&#38382;&#20803;&#32032;&#12290;&#27809;&#26377;&#21518;&#32493;&#30340;&#20803;&#32032;&#26102;&#65292;<code>__next__()</code>&#20250;&#24341;&#21457;<code>StopIteration</code>&#24322;&#24120;&#65292;&#21578;&#35785;<code>for</code>&#24490;&#29615;&#32456;&#27490;&#12290;&#20320;&#21487;&#20197;&#20351;&#29992;&#20869;&#24314;&#30340;<code>next()</code>&#20989;&#25968;&#35843;&#29992;<code>__next__()</code>&#26041;&#27861;&#65307;&#27492;&#31034;&#20363;&#26174;&#31034;&#23427;&#26159;&#22914;&#20309;&#24037;&#20316;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python">s <span class="op">=</span> <span class="st">&#39;abc&#39;</span>
it <span class="op">=</span> <span class="bu">iter</span>(s)
it
<span class="co">## &lt;iterator object at 0x00A1DB50&gt;</span>
<span class="bu">next</span>(it)
<span class="co">## &#39;a&#39;</span>
<span class="bu">next</span>(it)
<span class="co">## &#39;b&#39;</span>
<span class="bu">next</span>(it)
<span class="co">## &#39;c&#39;</span>
<span class="bu">next</span>(it)

Traceback (most recent call last):
  File <span class="st">&quot;&lt;stdin&gt;&quot;</span>, line <span class="dv">1</span>, <span class="op">in</span> ?
    <span class="bu">next</span>(it)
<span class="pp">StopIteration</span></code></pre></div>
<p>&#30475;&#36807;&#36845;&#20195;&#22120;&#21327;&#35758;&#32972;&#21518;&#30340;&#26426;&#21046;&#21518;&#65292;&#23558;&#24456;&#23481;&#26131;&#23558;&#36845;&#20195;&#22120;&#30340;&#34892;&#20026;&#28155;&#21152;&#21040;&#20320;&#30340;&#31867;&#20013;&#12290;&#23450;&#20041;&#19968;&#20010;<code>__iter__()</code>&#26041;&#27861;&#65292;&#23427;&#20351;&#29992;<code>__next__()</code>&#26041;&#27861;&#36820;&#22238;&#19968;&#20010;&#23545;&#35937;&#12290;&#22914;&#26524;&#31867;&#23450;&#20041;&#20102;<code>__next__()</code>&#65292;<code>__iter__()</code>&#21487;&#20197;&#21482;&#36820;&#22238;<code>self</code>&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">class</span> Reverse:
    <span class="co">&quot;&quot;&quot;Iterator for looping over a sequence backwards.&quot;&quot;&quot;</span>
    <span class="kw">def</span> <span class="fu">__init__</span>(<span class="va">self</span>, data):
        <span class="va">self</span>.data <span class="op">=</span> data
        <span class="va">self</span>.index <span class="op">=</span> <span class="bu">len</span>(data)
    <span class="kw">def</span> <span class="fu">__iter__</span>(<span class="va">self</span>):
        <span class="cf">return</span> <span class="va">self</span>
    <span class="kw">def</span> <span class="fu">__next__</span>(<span class="va">self</span>):
        <span class="cf">if</span> <span class="va">self</span>.index <span class="op">==</span> <span class="dv">0</span>:
            <span class="cf">raise</span> <span class="pp">StopIteration</span>
        <span class="va">self</span>.index <span class="op">=</span> <span class="va">self</span>.index <span class="op">-</span> <span class="dv">1</span>
        <span class="cf">return</span> <span class="va">self</span>.data[<span class="va">self</span>.index]

rev <span class="op">=</span> Reverse(<span class="st">&#39;spam&#39;</span>)
<span class="bu">iter</span>(rev)
<span class="op">&lt;</span>__main__.Reverse <span class="bu">object</span> at <span class="bn">0x00A1DB50</span><span class="op">&gt;</span>

<span class="cf">for</span> char <span class="op">in</span> rev:
        <span class="bu">print</span>(char)
<span class="co">## output</span>
m
a
p
s</code></pre></div>
<h2 id="&#29983;&#25104;&#22120;">9.10 &#29983;&#25104;&#22120;</h2>
<p>&#29983;&#25104;&#22120;&#26159;&#31616;&#21333;&#19988;&#21151;&#33021;&#24378;&#22823;&#30340;&#24037;&#20855;&#65292;&#29992;&#20110;&#21019;&#24314;&#36845;&#20195;&#22120;&#12290;&#23427;&#20204;&#20889;&#36215;&#26469;&#23601;&#20687;&#26159;&#27491;&#35268;&#30340;&#20989;&#25968;&#65292;&#38656;&#35201;&#36820;&#22238;&#25968;&#25454;&#30340;&#26102;&#20505;&#20351;&#29992;<code>yield&#35821;&#21477;</code>&#12290;&#27599;&#27425;&#22312;&#23427;&#19978;&#38754;&#35843;&#29992;<code>next()</code>&#26102;&#65292;&#29983;&#25104;&#22120;&#24674;&#22797;&#23427;&#33073;&#31163;&#30340;&#20301;&#32622;&#65288;&#23427;&#35760;&#24518;&#35821;&#21477;&#26368;&#21518;&#19968;&#27425;&#25191;&#34892;&#30340;&#20301;&#32622;&#21644;&#25152;&#26377;&#30340;&#25968;&#25454;&#20540;&#65289;&#12290;&#20197;&#19979;&#31034;&#20363;&#28436;&#31034;&#20102;&#29983;&#25104;&#22120;&#21487;&#20197;&#38750;&#24120;&#31616;&#21333;&#22320;&#21019;&#24314;&#20986;&#26469;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="kw">def</span> reverse(data):
    <span class="cf">for</span> index <span class="op">in</span> <span class="bu">range</span>(<span class="bu">len</span>(data)<span class="op">-</span><span class="dv">1</span>, <span class="op">-</span><span class="dv">1</span>, <span class="op">-</span><span class="dv">1</span>):
        <span class="cf">yield</span> data[index]

<span class="cf">for</span> char <span class="op">in</span> reverse(<span class="st">&#39;golf&#39;</span>):
     <span class="bu">print</span>(char)
<span class="co">##</span>
f
l
o
g</code></pre></div>
<p>&#29983;&#25104;&#22120;&#33021;&#20570;&#21040;&#30340;&#20160;&#20040;&#20107;&#65292;&#21069;&#19968;&#33410;&#25152;&#36848;&#30340;&#22522;&#20110;&#31867;&#30340;&#36845;&#20195;&#22120;&#20063;&#33021;&#20570;&#21040;&#12290;&#29983;&#25104;&#22120;&#36825;&#20040;&#31616;&#27905;&#26159;&#22240;&#20026;<code>__iter__()</code>&#21644;<code>__next__()</code>&#26041;&#27861;&#26159;&#33258;&#21160;&#21019;&#24314;&#30340;&#12290;</p>
<p>&#21478;&#19968;&#20010;&#20851;&#38190;&#29305;&#24449;&#26159;&#22312;&#35843;&#29992;&#20013;&#26412;&#22320;&#21464;&#37327;&#21644;&#25191;&#34892;&#29366;&#24577;&#20250;&#33258;&#21160;&#20445;&#23384;&#65292;&#36825;&#20351;&#24471;&#35813;&#20989;&#25968;&#26356;&#23481;&#26131;&#20889;&#65292;&#20063;&#27604;&#20351;&#29992;&#23454;&#20363;&#21464;&#37327;&#30340;&#26041;&#27861;&#65292;&#22914;<code>self.index</code>&#21644;<code>self.data</code>&#26356;&#28165;&#26224;&#12290;</p>
<p>&#38500;&#20102;&#33258;&#21160;&#21019;&#24314;&#26041;&#27861;&#21644;&#20445;&#23384;&#31243;&#24207;&#30340;&#29366;&#24577;&#65292;&#24403;&#29983;&#25104;&#22120;&#32456;&#27490;&#26102;&#65292;&#23427;&#20204;&#20250;&#33258;&#21160;&#24341;&#21457;<code>StopIteration</code>&#12290;&#32467;&#21512;&#36825;&#20123;&#29305;&#28857;&#65292;&#21019;&#24314;&#36845;&#20195;&#22120;&#23601;&#21644;&#20889;&#19968;&#20010;&#26222;&#36890;&#20989;&#25968;&#19968;&#26679;&#31616;&#21333;</p>
<h2 id="&#29983;&#25104;&#22120;&#34920;&#36798;&#24335;">9.11 &#29983;&#25104;&#22120;&#34920;&#36798;&#24335;</h2>
<p>&#19968;&#20123;&#31616;&#21333;&#30340;&#29983;&#25104;&#22120;&#21487;&#20197;&#31616;&#27905;&#22320;&#20351;&#29992;&#34920;&#36798;&#24335;&#65292;&#35821;&#27861;&#31867;&#20284;&#20110;&#21015;&#34920;&#26684;&#24335;&#65292;&#20294;&#29992;&#22278;&#25324;&#21495;<code>()</code>&#32780;&#19981;&#26159;&#26041;&#25324;&#21495;<code>[]</code>&#12290;&#36825;&#20123;&#34920;&#36798;&#24335;&#29992;&#20110;&#38381;&#21253;&#20989;&#25968;&#39532;&#19978;&#20351;&#29992;&#29983;&#25104;&#22120;&#30340;&#24773;&#20917;&#12290;&#29983;&#25104;&#22120;&#34920;&#36798;&#24335;&#26356;&#32039;&#20945;&#20294;&#27604;&#23436;&#25972;&#29983;&#25104;&#22120;&#23450;&#20041;&#36739;&#19981;&#36890;&#29992;&#65292;&#20542;&#21521;&#20110;&#26356;&#22810;&#30340;&#20869;&#23384;&#21451;&#22909;&#27604;&#31561;&#25928;&#21015;&#34920;&#20013;&#20307;&#20250;&#12290;</p>
<p>&#20363;&#23376;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="bu">sum</span>(i<span class="op">*</span>i <span class="cf">for</span> i <span class="op">in</span> <span class="bu">range</span>(<span class="dv">10</span>))                 <span class="co"># sum of squares</span>
<span class="co">## 285</span>

xvec <span class="op">=</span> [<span class="dv">10</span>, <span class="dv">20</span>, <span class="dv">30</span>]
yvec <span class="op">=</span> [<span class="dv">7</span>, <span class="dv">5</span>, <span class="dv">3</span>]
<span class="bu">sum</span>(x<span class="op">*</span>y <span class="cf">for</span> x,y <span class="op">in</span> <span class="bu">zip</span>(xvec, yvec))         <span class="co"># dot product</span>
<span class="co">## 260</span>

<span class="im">from</span> math <span class="im">import</span> pi, sin
sine_table <span class="op">=</span> {x: sin(x<span class="op">*</span>pi<span class="op">/</span><span class="dv">180</span>) <span class="cf">for</span> x <span class="op">in</span> <span class="bu">range</span>(<span class="dv">0</span>, <span class="dv">91</span>)}
unique_words <span class="op">=</span> <span class="bu">set</span>(word  <span class="cf">for</span> line <span class="op">in</span> page  <span class="cf">for</span> word <span class="op">in</span> line.split())

valedictorian <span class="op">=</span> <span class="bu">max</span>((student.gpa, student.name) <span class="cf">for</span> student <span class="op">in</span> graduates)

data <span class="op">=</span> <span class="st">&#39;golf&#39;</span>
<span class="bu">list</span>(data[i] <span class="cf">for</span> i <span class="op">in</span> <span class="bu">range</span>(<span class="bu">len</span>(data)<span class="op">-</span><span class="dv">1</span>, <span class="op">-</span><span class="dv">1</span>, <span class="op">-</span><span class="dv">1</span>))
<span class="co">## [&#39;f&#39;, &#39;l&#39;, &#39;o&#39;, &#39;g&#39;]</span></code></pre></div>
<p>&#33050;&#27880;</p>
<div class="footnotes">
<hr />
<ol>
<li id="fn1"><p>Except for one thing. Module objects have a secret read-only attribute called <code>__dict__</code> which returns the dictionary used to implement the module&#8217;s namespace; the name <code>__dict__</code> is an attribute but not a global name. Obviously, using this violates the abstraction of namespace implementation, and should be restricted to things like post-mortem debuggers.<a href="#fnref1">&#8617;</a></p></li>
</ol>
</div>
</body>
</html>
