<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <link rel="stylesheet" href="book.css" type="text/css" />
</head>
<body>
<h2 id="&#29616;&#22312;&#24590;&#20040;&#21150;">12. &#29616;&#22312;&#24590;&#20040;&#21150;?</h2>
<p>&#38405;&#35835;&#26412;&#25945;&#31243;&#21487;&#33021;&#35753;&#20320;&#23545;&#20351;&#29992; Python &#26356;&#24863;&#20852;&#36259;&#20102;&#8212;&#8212;&#20320;&#24212;&#35813;&#20250;&#28212;&#26395;&#23558; Python &#24212;&#29992;&#20110;&#35299;&#20915;&#23454;&#38469;&#38382;&#39064;&#12290;&#20320;&#24212;&#35813;&#21040;&#21738;&#37324;&#21435;&#20102;&#35299;&#26356;&#22810; Python &#30340;&#20869;&#23481;&#21602;&#65311;</p>
<p>&#26412;&#25945;&#31243;&#26159; Python &#25991;&#26723;&#38598;&#30340;&#19968;&#37096;&#20998;&#12290;&#25991;&#26723;&#38598;&#20013;&#30340;&#19968;&#20123;&#20854;&#23427;&#25991;&#20214;&#26377;&#65306;</p>
<ul>
<li><p><a href="http://python.usyiyi.cn/python_343/library/index.html#library-index">Python &#26631;&#20934;&#24211;</a>:<br />
 &#20320;&#24212;&#35813;&#27983;&#35272;&#26412;&#25163;&#20876;&#65292;&#23427;&#32473;&#20986;&#20102;&#26631;&#20934;&#24211;&#20013;&#20851;&#20110;&#31867;&#22411;&#12289; &#20989;&#25968;&#21644;&#27169;&#22359;&#30340;&#23436;&#25972;&#65288;&#34429;&#28982;&#31616;&#27905;&#65289;&#30340;&#21442;&#32771;&#36164;&#26009;&#12290;&#26631;&#20934;&#30340; Python &#21457;&#24067;&#21253;&#21547;&#22823;&#37327; &#30340;&#38468;&#21152;&#27169;&#22359;&#12290;&#20854;&#20013;&#26377;&#35835;&#21462; Unix &#37038;&#31665;&#12289;&#25910;&#21462;HTTP &#25991;&#26723;&#12289;&#29983;&#25104;&#38543;&#26426;&#25968;&#12289;&#35299;&#26512;&#21629;&#20196;&#34892;&#36873;&#39033;&#12289;&#32534;&#20889; CGI &#31243;&#24207;&#12289;&#21387;&#32553;&#25968;&#25454;&#20197;&#21450;&#24456;&#22810;&#20854;&#23427;&#20219;&#21153;&#30340;&#27169;&#22359;&#12290;&#27983;&#35272;&#19968;&#19979;&#36825;&#20010;&#24211;&#21442;&#32771;&#25163;&#20876;&#20250;&#35753;&#20320;&#30693;&#36947;&#26377;&#20160;&#20040;&#26159;&#29616;&#25104;&#21487;&#29992;&#30340;&#12290;</p></li>
<li><p><a href="http://python.usyiyi.cn/python_343/install/index.html#install-index">&#23433;&#35013; Python &#27169;&#22359;</a>: &#35299;&#37322;&#22914;&#20309;&#23433;&#35013;&#30001;&#20854;&#20182; Python &#29992;&#25143;&#32534;&#20889;&#30340;&#22806;&#37096;&#27169;&#22359;&#12290;</p></li>
<li><p><a href="http://python.usyiyi.cn/python_343/reference/index.html#reference-index">Python &#35821;&#35328;&#21442;&#32771;</a>: &#35814;&#32454;&#22320;&#35762;&#36848;&#20102; Python &#30340;&#35821;&#27861;&#21644;&#35821;&#20041;&#12290;&#23427;&#35835;&#36215;&#26469;&#24456;&#38590;&#65292;&#20294;&#26159;&#20316;&#20026;&#35821;&#35328;&#26412;&#36523;&#30340;&#23436;&#25972;&#25351;&#21335;&#38750;&#24120;&#26377;&#29992;&#12290;</p></li>
</ul>
<p>&#26356;&#22810;&#30340; Python &#36164;&#28304;&#65306;</p>
<ul>
<li>https://www.python.org&#65306;&#20027;&#35201;&#30340; Python Web &#31449;&#28857;&#12290;&#23427;&#21253;&#21547;&#20195;&#30721;&#12289;&#25991;&#26723;&#21644;&#32593;&#19978; Python &#30456;&#20851;&#39029;&#38754;&#30340;&#38142;&#25509;&#12290;&#35813;&#32593;&#31449;&#22312;&#19990;&#30028;&#21508;&#22320;&#37117;&#26377;&#38236;&#20687;&#65292;&#22914;&#27431;&#27954;&#12289; &#26085;&#26412;&#21644;&#28595;&#22823;&#21033;&#20122;&#65307;&#38236;&#20687;&#21487;&#33021;&#20250;&#27604;&#20027;&#31449;&#24555;&#65292;&#36825;&#21462;&#20915;&#20110;&#20320;&#30340;&#22320;&#29702;&#20301;&#32622;&#12290;</li>
<li>https://docs.python.org&#65306;&#24555;&#36895;&#35775;&#38382; Python &#30340;&#25991;&#26723;&#12290;</li>
<li>https://pypi.python.org/pypi&#65306; Python &#21253;&#32034;&#24341;&#65292;&#20197;&#21069;&#30340;&#32496;&#21495;&#21483;&#22902;&#37226;&#24215;&#65292;&#26159;&#29992;&#25143;&#21019;&#24314;&#30340; Python &#27169;&#22359;&#30340;&#32034;&#24341;&#65292;&#36825;&#20123;&#27169;&#22359;&#21487;&#20379;&#19979;&#36733;&#12290;&#19968;&#26086;&#20320;&#24320;&#22987;&#21457;&#24067;&#20195;&#30721;&#65292;&#20320;&#21487;&#20197;&#22312;&#36825;&#37324;&#27880;&#20876;&#20320;&#30340;&#20195;&#30721;&#36825;&#26679;&#20854;&#20182;&#20154;&#21487;&#20197;&#25214;&#21040;&#23427;&#12290;</li>
<li>http://code.activestate.com/recipes/langs/python/: &#36825;&#26412; Python &#39135;&#35889;&#25910;&#38598;&#20102;&#30456;&#24403;&#22810;&#30340;&#20195;&#30721;&#31034;&#20363;&#12289;&#22823;&#22411;&#30340;&#27169;&#22359;&#65292;&#20197;&#21450;&#26377;&#29992;&#30340;&#33050;&#26412;&#12290;&#20854;&#20013;&#23588;&#20854;&#26174;&#33879;&#30340;&#36129;&#29486;&#34987;&#25910;&#38598;&#25104;&#19968;&#20070;&#65292;&#36825;&#26412;&#20070;&#20063;&#21483;&#20570; Python Cookbook (O'Reilly &amp; Associates, ISBN 0-596-00797-3)&#12290;</li>
<li>http://scipy.org&#65306;The Scientific Python &#39033;&#30446;&#21253;&#25324;&#25968;&#32452;&#24555;&#36895;&#35745;&#31639;&#21644;&#22788;&#29702;&#27169;&#22359;&#65292;&#21644;&#22823;&#37327;&#32447;&#24615;&#20195;&#25968;&#12289;&#20613;&#37324;&#21494;&#21464;&#25442;&#12289;&#38750;&#32447;&#24615;solvers&#12289;&#38543;&#26426;&#25968;&#20998;&#24067;&#65292;&#32479;&#35745;&#20998;&#26512;&#20197;&#21450;&#31867;&#20284;&#30340;&#21253;&#12290;</li>
</ul>
<p>Python &#30456;&#20851;&#30340;&#38382;&#39064;&#21644;&#38382;&#39064;&#25253;&#21578;&#65292;&#20320;&#21487;&#20197;&#21457;&#24067;&#21040;&#26032;&#38395;&#32452;<code>comp.lang.python</code>&#65292;&#25110;&#23558;&#23427;&#20204;&#21457;&#36865;&#21040;&#37038;&#20214;&#21015;&#34920;<code>python-list@python.org</code>&#12290;&#26032;&#38395;&#32452;&#21644;&#37038;&#20214;&#21015;&#34920;&#26159;&#20114;&#36890;&#30340;&#65292;&#22240;&#27492;&#21457;&#24067;&#21040;&#20854;&#20013;&#30340;&#19968;&#20010;&#28040;&#24687;&#23558;&#33258;&#21160;&#36716;&#21457;&#32473;&#21478;&#22806;&#19968;&#20010;&#12290;&#19968;&#22825;&#22823;&#32422;&#26377; 120 &#20010;&#24086;&#23376;&#65288;&#26368;&#39640;&#23792;&#21040;&#22909;&#20960;&#30334;)&#65292;&#21253;&#25324;&#35810;&#38382;&#65288;&#21644;&#22238;&#31572;&#65289;&#38382;&#39064;&#65292;&#24314;&#35758;&#26032;&#30340;&#21151;&#33021;&#21644;&#23459;&#24067;&#26032;&#30340;&#27169;&#22359;&#12290;&#22312;&#21457;&#24086;&#20043;&#21069;&#65292;&#19968;&#23450;&#35201;&#26816;&#26597;&#24120;&#35265;&#38382;&#39064;&#65288;&#20063;&#31216;&#20026; FAQ&#65289;&#30340;&#21015;&#34920;&#12290;&#21487;&#22312;https://mail.python.org/pipermail/&#26597;&#30475;&#37038;&#20214;&#21015;&#34920;&#30340;&#24402;&#26723;&#12290;FAQ &#22238;&#31572;&#20102;&#24456;&#22810;&#32463;&#24120;&#20986;&#29616;&#30340;&#38382;&#39064;&#65292;&#21487;&#33021;&#24050;&#32463;&#21253;&#21547;&#20320;&#30340;&#38382;&#39064;&#30340;&#35299;&#20915;&#26041;&#27861;&#12290;</p>
</body>
</html>
