<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <meta http-equiv="Content-Style-Type" content="text/css" />
  <meta name="generator" content="pandoc" />
  <title></title>
  <style type="text/css">code{white-space: pre;}</style>
  <style type="text/css">
div.sourceCode { overflow-x: auto; }
table.sourceCode, tr.sourceCode, td.lineNumbers, td.sourceCode {
  margin: 0; padding: 0; vertical-align: baseline; border: none; }
table.sourceCode { width: 100%; line-height: 100%; }
td.lineNumbers { text-align: right; padding-right: 4px; padding-left: 4px; color: #aaaaaa; border-right: 1px solid #aaaaaa; }
td.sourceCode { padding-left: 5px; }
code > span.kw { color: #007020; font-weight: bold; } /* Keyword */
code > span.dt { color: #902000; } /* DataType */
code > span.dv { color: #40a070; } /* DecVal */
code > span.bn { color: #40a070; } /* BaseN */
code > span.fl { color: #40a070; } /* Float */
code > span.ch { color: #4070a0; } /* Char */
code > span.st { color: #4070a0; } /* String */
code > span.co { color: #60a0b0; font-style: italic; } /* Comment */
code > span.ot { color: #007020; } /* Other */
code > span.al { color: #ff0000; font-weight: bold; } /* Alert */
code > span.fu { color: #06287e; } /* Function */
code > span.er { color: #ff0000; font-weight: bold; } /* Error */
code > span.wa { color: #60a0b0; font-weight: bold; font-style: italic; } /* Warning */
code > span.cn { color: #880000; } /* Constant */
code > span.sc { color: #4070a0; } /* SpecialChar */
code > span.vs { color: #4070a0; } /* VerbatimString */
code > span.ss { color: #bb6688; } /* SpecialString */
code > span.im { } /* Import */
code > span.va { color: #19177c; } /* Variable */
code > span.cf { color: #007020; font-weight: bold; } /* ControlFlow */
code > span.op { color: #666666; } /* Operator */
code > span.bu { } /* BuiltIn */
code > span.ex { } /* Extension */
code > span.pp { color: #bc7a00; } /* Preprocessor */
code > span.at { color: #7d9029; } /* Attribute */
code > span.do { color: #ba2121; font-style: italic; } /* Documentation */
code > span.an { color: #60a0b0; font-weight: bold; font-style: italic; } /* Annotation */
code > span.cv { color: #60a0b0; font-weight: bold; font-style: italic; } /* CommentVar */
code > span.in { color: #60a0b0; font-weight: bold; font-style: italic; } /* Information */
  </style>
  <link rel="stylesheet" href="book.css" type="text/css" />
</head>
<body>
<h2 id="&#28014;&#28857;&#25968;&#36816;&#31639;&#38382;&#39064;&#21644;&#23616;&#38480;">14. &#28014;&#28857;&#25968;&#36816;&#31639;&#65306;&#38382;&#39064;&#21644;&#23616;&#38480;</h2>
<p>&#28014;&#28857;&#25968;&#22312;&#35745;&#31639;&#26426;&#30828;&#20214;&#20013;&#34920;&#31034;&#20026;&#20197; 2 &#20026;&#24213;&#65288;&#20108;&#36827;&#21046;&#65289;&#30340;&#23567;&#25968;&#12290;&#20363;&#22914;&#65292;&#21313;&#36827;&#21046;&#23567;&#25968; <code>0.125</code> &#26159; <code>1/10 + 2/100 + 5/1000</code> &#30340;&#20540;&#65292;&#21516;&#26679;&#20108;&#36827;&#21046;&#23567;&#25968; <code>0.001</code>&#26159; <code>0/2 + 0/4 + 1/8</code>&#30340;&#20540;&#12290;&#36825;&#20004;&#20010;&#23567;&#25968;&#20855;&#26377;&#30456;&#21516;&#30340;&#20540;&#65292;&#21807;&#19968;&#30495;&#27491;&#30340;&#21306;&#21035;&#26159;&#65292;&#31532;&#19968;&#20010;&#23567;&#25968;&#26159;&#21313;&#36827;&#21046;&#34920;&#31034;&#27861;&#65292;&#31532;&#20108;&#20010;&#26159;&#20108;&#36827;&#21046;&#34920;&#31034;&#27861;&#12290;</p>
<p>&#19981;&#24184;&#30340;&#26159;&#65292;&#22823;&#22810;&#25968;&#21313;&#36827;&#21046;&#23567;&#25968;&#19981;&#33021;&#23436;&#20840;&#29992;&#20108;&#36827;&#21046;&#23567;&#25968;&#34920;&#31034;&#12290;&#32467;&#26524;&#26159;&#65292;&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#20320;&#36755;&#20837;&#30340;&#21313;&#36827;&#21046;&#28014;&#28857;&#25968;&#20165;&#30001;&#23454;&#38469;&#23384;&#20648;&#22312;&#35745;&#31639;&#26426;&#20013;&#30340;&#36817;&#20284;&#30340;&#20108;&#36827;&#21046;&#28014;&#28857;&#25968;&#34920;&#31034;&#12290;</p>
<p>&#36825;&#20010;&#38382;&#39064;&#22312;&#21313;&#36827;&#21046;&#24773;&#20917;&#19979;&#24456;&#23481;&#26131;&#29702;&#35299;&#12290;&#32771;&#34385;&#20998;&#25968; 1/3&#65292;&#20320;&#21487;&#20197;&#29992;&#21313;&#36827;&#21046;&#23567;&#25968;&#36817;&#20284;&#23427;&#65306;<code>0.3</code>, &#25110;&#32773;&#26356;&#25509;&#36817;&#30340; <code>0.33</code>&#25110;&#32773;&#20877;&#25509;&#36817;&#19968;&#28857;&#30340; <code>0.333</code> &#31561;&#31561;&#12290;&#26080;&#35770;&#20320;&#24895;&#24847;&#20889;&#22810;&#23569;&#20301;&#25968;&#23383;&#65292;&#32467;&#26524;&#27704;&#36828;&#19981;&#20250;&#26159;&#31934;&#30830;&#30340; <code>1/3</code>&#65292;&#20294;&#23558;&#20250;&#36234;&#26469;&#36234;&#22909;&#22320;&#36924;&#36817; <code>1/3</code>&#12290;</p>
<p>&#21516;&#26679;&#22320;&#65292;&#26080;&#35770;&#20320;&#20351;&#29992;&#22810;&#23569;&#20301;&#30340;&#20108;&#36827;&#21046;&#25968;&#65292;&#37117;&#26080;&#27861;&#30830;&#20999;&#22320;&#34920;&#31034;&#21313;&#36827;&#21046;&#20540; <code>0.1</code>&#12290;<code>1/10</code> &#29992;&#20108;&#36827;&#21046;&#34920;&#31034;&#26159;&#19968;&#20010;&#26080;&#38480;&#24490;&#29615;&#30340;&#23567;&#25968;: <code>0.0001100110011001100110011001100110011001100110011...</code>.</p>
<p>&#22312;&#20219;&#20309;&#26377;&#38480;&#25968;&#37327;&#30340;&#20301;&#20572;&#19979;&#26469;&#65292;&#20320;&#24471;&#21040;&#30340;&#37117;&#26159;&#36817;&#20284;&#20540;&#12290;&#20170;&#22825;&#22312;&#22823;&#22810;&#25968;&#26426;&#22120;&#19978;&#65292;&#28014;&#28857;&#25968;&#30340;&#36817;&#20284;&#20351;&#29992;&#30340;&#23567;&#25968;&#20197;&#26368;&#39640;&#30340;53&#20301;&#20026;&#20998;&#23376;&#65292;2&#30340;&#24130;&#20026;&#20998;&#27597;&#12290;&#33267;&#20110;<code>1/10</code>&#36825;&#31181;&#24773;&#20917;&#65292;&#20854;&#20108;&#36827;&#21046;&#23567;&#25968;&#26159;<code>3602879701896397 / 2 ** 55</code>&#65292;&#23427;&#38750;&#24120;&#25509;&#36817;&#20294;&#19981;&#23436;&#20840;&#31561;&#20110;<code>1/10</code>&#30495;&#23454;&#30340;&#20540;&#12290;</p>
<p>&#30001;&#20110;&#26174;&#31034;&#26041;&#24335;&#30340;&#21407;&#22240;&#65292;&#35768;&#22810;&#20351;&#29992;&#32773;&#24847;&#35782;&#19981;&#21040;&#26159;&#36817;&#20284;&#20540;&#12290;Python &#21482;&#25171;&#21360;&#26426;&#22120;&#20013;&#23384;&#20648;&#30340;&#20108;&#36827;&#21046;&#20540;&#30340;&#21313;&#36827;&#21046;&#36817;&#20284;&#20540;&#12290;&#22312;&#22823;&#22810;&#25968;&#26426;&#22120;&#19978;&#65292;&#22914;&#26524; Python &#35201;&#25171;&#21360; <code>0.1</code> &#23384;&#20648;&#30340;&#20108;&#36827;&#21046;&#30340;&#30495;&#27491;&#36817;&#20284;&#20540;&#65292;&#23558;&#20250;&#26174;&#31034;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> <span class="fl">0.1</span>
<span class="fl">0.1000000000000000055511151231257827021181583404541015625</span></code></pre></div>
<p>&#36825;&#20040;&#22810;&#20301;&#30340;&#25968;&#23383;&#23545;&#22823;&#22810;&#25968;&#20154;&#26159;&#27809;&#26377;&#29992;&#30340;&#65292;&#25152;&#20197; Python &#26174;&#31034;&#19968;&#20010;&#33293;&#20837;&#30340;&#20540;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> <span class="dv">1</span> <span class="op">/</span> <span class="dv">10</span>
<span class="fl">0.1</span></code></pre></div>
<p>&#21482;&#35201;&#35760;&#20303;&#21363;&#20351;&#25171;&#21360;&#30340;&#32467;&#26524;&#30475;&#19978;&#21435;&#26159;&#31934;&#30830;&#30340;<code>1/10</code>&#65292;&#30495;&#27491;&#23384;&#20648;&#30340;&#20540;&#26159;&#26368;&#36817;&#20284;&#30340;&#20108;&#36827;&#21046;&#23567;&#25968;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#25968;&#23383;<code>0.1</code>&#12289;<code>0.10000000000000001</code> &#21644; <code>0.1000000000000000055511151231257827021181583404541015625</code> &#37117;&#20197;<code>3602879701896397 / 2 ** 55</code>&#20026;&#36817;&#20284;&#20540;&#12290;&#22240;&#20026;&#25152;&#26377;&#36825;&#20123;&#21313;&#36827;&#21046;&#25968;&#20849;&#20139;&#30456;&#21516;&#30340;&#36817;&#20284;&#20540;&#65292;&#22312;&#20445;&#25345;&#24658;&#31561;&#24335;<code>eval(repr(x)) == x</code>&#30340;&#21516;&#26102;&#65292;&#26174;&#31034;&#30340;&#21487;&#33021;&#26159;&#23427;&#20204;&#20013;&#30340;&#20219;&#20309;&#19968;&#20010;&#12290;</p>
<p>&#29616;&#22312;&#20174;Python 3.1 &#24320;&#22987;&#65292;Python&#65288;&#22312;&#22823;&#22810;&#25968;&#31995;&#32479;&#19978;&#65289;&#33021;&#22815;&#20174;&#36825;&#20123;&#25968;&#23383;&#24403;&#20013;&#36873;&#25321;&#26368;&#30701;&#30340;&#19968;&#20010;&#24182;&#31616;&#21333;&#22320;&#26174;&#31034;0.1&#12290;</p>
<p>&#27880;&#24847;&#65292;&#36825;&#26159;&#20108;&#36827;&#21046;&#28014;&#28857;&#25968;&#30340;&#33258;&#28982;&#24615;&#36136;&#65306;&#23427;&#19981;&#26159; Python &#20013;&#30340;&#19968;&#20010; bug &#65292;&#20063;&#19981;&#26159;&#20320;&#30340;&#20195;&#30721;&#20013;&#30340; bug&#12290;&#20320;&#20250;&#30475;&#21040;&#25152;&#26377;&#25903;&#25345;&#30828;&#20214;&#28014;&#28857;&#25968;&#31639;&#27861;&#30340;&#35821;&#35328;&#37117;&#20250;&#26377;&#36825;&#20010;&#29616;&#35937;&#65288;&#23613;&#31649;&#26377;&#20123;&#35821;&#35328;&#40664;&#35748;&#24773;&#20917;&#19979;&#25110;&#32773;&#22312;&#25152;&#26377;&#36755;&#20986;&#27169;&#24335;&#19979;&#21487;&#33021;&#19981;&#20250;&#26174;&#31034; &#20986;&#24046;&#24322;&#65289;&#12290;</p>
<p>&#20026;&#20102;&#36755;&#20986;&#26356;&#22909;&#30475;&#65292;&#20320;&#21487;&#33021;&#24819;&#29992;&#23383;&#31526;&#20018;&#26684;&#24335;&#21270;&#26469;&#29983;&#25104;&#22266;&#23450;&#20301;&#25968;&#30340;&#26377;&#25928;&#25968;&#23383;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> <span class="bu">format</span>(math.pi, <span class="st">&#39;.12g&#39;</span>)  <span class="co"># give 12 significant digits</span>
<span class="co">&#39;3.14159265359&#39;</span>

<span class="op">&gt;&gt;&gt;</span> <span class="bu">format</span>(math.pi, <span class="st">&#39;.2f&#39;</span>)   <span class="co"># give 2 digits after the point</span>
<span class="co">&#39;3.14&#39;</span>

<span class="op">&gt;&gt;&gt;</span> <span class="bu">repr</span>(math.pi)
<span class="co">&#39;3.141592653589793&#39;</span></code></pre></div>
<p>&#35748;&#35782;&#21040;&#36825;&#65292;&#22312;&#30495;&#27491;&#24847;&#20041;&#19978;&#65292;&#26159;&#19968;&#31181;&#38169;&#35273;&#26159;&#24456;&#37325;&#35201;&#30340;&#65306;&#20320;&#22312;&#31616;&#21333;&#22320;&#33293;&#20837;&#30495;&#23454;&#26426;&#22120;&#20540;&#30340;&#26174;&#31034;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#26082;&#28982;0.1&#19981;&#26159;&#31934;&#30830;&#30340;1/10&#65292;3&#20010;0.1&#30340;&#20540;&#30456;&#21152;&#21487;&#33021;&#20063;&#19981;&#20250;&#24471;&#21040;&#31934;&#30830;&#30340;0.3&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> .<span class="dv">1</span> <span class="op">+</span> .<span class="dv">1</span> <span class="op">+</span> .<span class="dv">1</span> <span class="op">==</span> .<span class="dv">3</span>
<span class="va">False</span></code></pre></div>
<p>&#21478;&#22806;&#65292;&#26082;&#28982;0.1&#19981;&#33021;&#26356;&#25509;&#36817;1/10&#30340;&#31934;&#30830;&#20540;&#32780;&#19988;0.3&#19981;&#33021;&#26356;&#25509;&#36817;3/10&#30340;&#31934;&#30830;&#20540;&#65292;&#20351;&#29992;<code>round()</code>&#20989;&#25968;&#25552;&#21069;&#33293;&#20837;&#20063;&#27809;&#26377;&#24110;&#21161;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> <span class="bu">round</span>(.<span class="dv">1</span>, <span class="dv">1</span>) <span class="op">+</span> <span class="bu">round</span>(.<span class="dv">1</span>, <span class="dv">1</span>) <span class="op">+</span> <span class="bu">round</span>(.<span class="dv">1</span>, <span class="dv">1</span>) <span class="op">==</span> <span class="bu">round</span>(.<span class="dv">3</span>, <span class="dv">1</span>)
<span class="va">False</span></code></pre></div>
<p>&#34429;&#28982;&#36825;&#20123;&#25968;&#23383;&#19981;&#21487;&#33021;&#20877;&#26356;&#25509;&#36817;&#23427;&#20204;&#24819;&#35201;&#30340;&#31934;&#30830;&#20540;&#65292;<code>round()</code>&#20989;&#25968;&#21487;&#20197;&#29992;&#20110;&#22312;&#35745;&#31639;&#20043;&#21518;&#36827;&#34892;&#33293;&#20837;&#65292;&#36825;&#26679;&#30340;&#35805;&#19981;&#31934;&#30830;&#30340;&#32467;&#26524;&#23601;&#21487;&#20197;&#21644;&#21478;&#22806;&#19968;&#20010;&#30456;&#27604;&#36739;&#20102;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> <span class="bu">round</span>(.<span class="dv">1</span> <span class="op">+</span> .<span class="dv">1</span> <span class="op">+</span> .<span class="dv">1</span>, <span class="dv">10</span>) <span class="op">==</span> <span class="bu">round</span>(.<span class="dv">3</span>, <span class="dv">10</span>)
<span class="va">True</span></code></pre></div>
<p>&#20108;&#36827;&#21046;&#28014;&#28857;&#25968;&#35745;&#31639;&#26377;&#24456;&#22810;&#36825;&#26679;&#24847;&#24819;&#19981;&#21040;&#30340;&#32467;&#26524;&#12290;&#8220;0.1&#8221;&#30340;&#38382;&#39064;&#22312;&#19979;&#38754;&quot;&#35823;&#24046;&#30340;&#34920;&#31034;&quot;&#19968;&#33410;&#20013;&#26377;&#20934;&#30830;&#35814;&#32454;&#30340;&#35299;&#37322;&#12290;&#26356;&#23436;&#25972;&#30340;&#24120;&#35265;&#24618;&#24322;&#29616;&#35937;&#35831;&#21442;&#35265;&#28014;&#28857;&#25968;&#30340;&#21361;&#38505;&#12290;</p>
<p>&#26368;&#21518;&#25105;&#35201;&#35828;&#65292;&#8220;&#27809;&#26377;&#31616;&#21333;&#30340;&#31572;&#26696;&#8221;&#12290;&#20063;&#19981;&#35201;&#36807;&#20998;&#23567;&#24515;&#28014;&#28857;&#25968;&#65281;Python &#28014;&#28857;&#25968;&#35745;&#31639;&#20013;&#30340;&#35823;&#24046;&#28304;&#20043;&#20110;&#28014;&#28857;&#25968;&#30828;&#20214;&#65292;&#22823;&#22810;&#25968;&#26426;&#22120;&#19978;&#27599;&#27425;&#35745;&#31639;&#35823;&#24046;&#19981;&#36229;&#36807; <code>2**53</code> &#20998;&#20043;&#19968;&#12290;&#23545;&#20110;&#22823;&#22810;&#25968;&#20219;&#21153;&#36825;&#24050;&#32463;&#36275;&#22815;&#20102;&#65292;&#20294;&#26159;&#20320;&#35201;&#22312;&#24515;&#20013;&#35760;&#20303;&#36825;&#19981;&#26159;&#21313;&#36827;&#21046;&#31639;&#27861;&#65292;&#27599;&#20010;&#28014;&#28857;&#25968;&#35745;&#31639;&#21487;&#33021;&#20250;&#24102;&#26469;&#19968;&#20010;&#26032;&#30340;&#33293;&#20837;&#38169;&#35823;&#12290;</p>
<p>&#34429;&#28982;&#30830;&#23454;&#26377;&#38382;&#39064;&#23384;&#22312;&#65292;&#23545;&#20110;&#22823;&#22810;&#25968;&#24179;&#24120;&#30340;&#28014;&#28857;&#25968;&#36816;&#31639;&#65292;&#20320;&#21482;&#35201;&#31616;&#21333;&#22320;&#23558;&#26368;&#32456;&#26174;&#31034;&#30340;&#32467;&#26524;&#33293;&#20837;&#21040;&#20320;&#26399;&#26395;&#30340;&#21313;&#36827;&#21046;&#20301;&#25968;&#65292;&#20320;&#23601;&#20250;&#24471;&#21040;&#20320;&#26399;&#26395;&#30340;&#26368;&#32456;&#32467;&#26524;&#12290;<code>str()</code>&#36890;&#24120;&#24050;&#32463;&#36275;&#22815;&#29992;&#20102;&#65292;&#23545;&#20110;&#26356;&#22909;&#30340;&#25511;&#21046;&#21487;&#20197;&#21442;&#38405;&#26684;&#24335;&#21270;&#23383;&#31526;&#20018;&#35821;&#27861;&#20013;<code>str.format()</code>&#26041;&#27861;&#30340;&#26684;&#24335;&#35828;&#26126;&#31526;&#12290;</p>
<p>&#23545;&#20110;&#38656;&#35201;&#31934;&#30830;&#21313;&#36827;&#21046;&#34920;&#31034;&#30340;&#24773;&#20917;&#65292;&#21487;&#20197;&#23581;&#35797;&#20351;&#29992;<code>decimal</code>&#27169;&#22359;&#65292;&#23427;&#23454;&#29616;&#30340;&#21313;&#36827;&#21046;&#36816;&#31639;&#36866;&#21512;&#20250;&#35745;&#26041;&#38754;&#30340;&#24212;&#29992;&#21644;&#39640;&#31934;&#24230;&#35201;&#27714;&#30340;&#24212;&#29992;&#12290;</p>
<p><code>fractions</code>&#27169;&#22359;&#25903;&#25345;&#21478;&#22806;&#19968;&#31181;&#24418;&#24335;&#30340;&#36816;&#31639;&#65292;&#23427;&#23454;&#29616;&#30340;&#36816;&#31639;&#22522;&#20110;&#26377;&#29702;&#25968;&#65288;&#22240;&#27492;&#20687;1/3&#36825;&#26679;&#30340;&#25968;&#23383;&#21487;&#20197;&#31934;&#30830;&#22320;&#34920;&#31034;&#65289;&#12290;</p>
<p>&#22914;&#26524;&#20320;&#26159;&#28014;&#28857;&#25968;&#25805;&#20316;&#30340;&#37325;&#24230;&#20351;&#29992;&#32773;&#65292;&#20320;&#24212;&#35813;&#30475;&#19968;&#19979;&#30001;<code>SciPy</code>&#39033;&#30446;&#25552;&#20379;&#30340;<code>Numerical Python</code>&#21253;&#21644;&#20854;&#23427;&#29992;&#20110;&#25968;&#23398;&#21644;&#32479;&#35745;&#23398;&#30340;&#21253;&#12290;&#21442;&#30475;<a href="http://scipy.org" class="uri">http://scipy.org</a>&#12290;</p>
<p>&#24403;&#20320;&#30495;&#30340;&#30495;&#24819;&#35201;&#30693;&#36947;&#28014;&#28857;&#25968;&#31934;&#30830;&#20540;&#30340;&#26102;&#20505;&#65292;Python &#25552;&#20379;&#36825;&#26679;&#30340;&#24037;&#20855;&#21487;&#20197;&#24110;&#21161;&#20320;&#12290;float.as_integer_ratio()&#26041;&#27861;&#20197;&#20998;&#25968;&#30340;&#24418;&#24335;&#34920;&#31034;&#19968;&#20010;&#28014;&#28857;&#25968;&#30340;&#20540;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> x <span class="op">=</span> <span class="fl">3.14159</span>
<span class="op">&gt;&gt;&gt;</span> x.as_integer_ratio()
(<span class="dv">3537115888337719</span>, <span class="dv">1125899906842624</span>)</code></pre></div>
<p>&#22240;&#20026;&#27604;&#20540;&#26159;&#31934;&#30830;&#30340;&#65292;&#23427;&#21487;&#20197;&#29992;&#26469;&#26080;&#25439;&#22320;&#37325;&#26032;&#29983;&#25104;&#21021;&#22987;&#20540;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> x <span class="op">==</span> <span class="dv">3537115888337719</span> <span class="op">/</span> <span class="dv">1125899906842624</span>
<span class="va">True</span></code></pre></div>
<p><code>float.hex()</code>&#26041;&#27861;&#20197;&#21313;&#20845;&#36827;&#21046;&#34920;&#31034;&#28014;&#28857;&#25968;&#65292;&#32473;&#20986;&#30340;&#21516;&#26679;&#26159;&#35745;&#31639;&#26426;&#23384;&#20648;&#30340;&#31934;&#30830;&#20540;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> x.<span class="bu">hex</span>()
<span class="co">&#39;0x1.921f9f01b866ep+1&#39;</span></code></pre></div>
<p>&#31934;&#30830;&#30340;&#21313;&#20845;&#36827;&#21046;&#34920;&#31034;&#21487;&#20197;&#29992;&#26469;&#20934;&#30830;&#22320;&#37325;&#26032;&#26500;&#24314;&#28014;&#28857;&#25968;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> x <span class="op">==</span> <span class="bu">float</span>.fromhex(<span class="st">&#39;0x1.921f9f01b866ep+1&#39;</span>)
<span class="va">True</span></code></pre></div>
<p>&#22240;&#20026;&#21487;&#20197;&#31934;&#30830;&#34920;&#31034;&#65292;&#25152;&#20197;&#21487;&#20197;&#29992;&#22312;&#19981;&#21516;&#29256;&#26412;&#30340;Python&#65288;&#19982;&#24179;&#21488;&#30456;&#20851;&#65289;&#20043;&#38388;&#21487;&#38752;&#22320;&#31227;&#26893;&#25968;&#25454;&#20197;&#21450;&#19982;&#25903;&#25345;&#21516;&#26679;&#26684;&#24335;&#30340;&#20854;&#23427;&#35821;&#35328;&#65288;&#20363;&#22914;Java&#21644;C99&#65289;&#20132;&#25442;&#25968;&#25454;&#12290;</p>
<p>&#21478;&#22806;&#19968;&#20010;&#26377;&#29992;&#30340;&#24037;&#20855;&#26159;<code>math.fsum()</code>&#20989;&#25968;&#65292;&#23427;&#24110;&#21161;&#27714;&#21644;&#36807;&#31243;&#20013;&#20943;&#23569;&#31934;&#24230;&#30340;&#25439;&#22833;&#12290;&#24403;&#25968;&#20540;&#22312;&#19981;&#20572;&#22320;&#30456;&#21152;&#30340;&#26102;&#20505;&#65292;&#23427;&#20250;&#36319;&#36394;&#8220;&#20002;&#24323;&#30340;&#25968;&#23383;&#8221;&#12290;&#36825;&#21487;&#20197;&#32473;&#24635;&#20307;&#30340;&#20934;&#30830;&#24230;&#24102;&#26469;&#19981;&#21516;&#65292;&#20197;&#33267;&#20110;&#38169;&#35823;&#19981;&#20250;&#32047;&#31215;&#21040;&#24433;&#21709;&#26368;&#32456;&#32467;&#26524;&#30340;&#28857;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> <span class="bu">sum</span>([<span class="fl">0.1</span>] <span class="op">*</span> <span class="dv">10</span>) <span class="op">==</span> <span class="fl">1.0</span>
<span class="va">False</span>
<span class="op">&gt;&gt;&gt;</span> math.fsum([<span class="fl">0.1</span>] <span class="op">*</span> <span class="dv">10</span>) <span class="op">==</span> <span class="fl">1.0</span>
<span class="va">True</span></code></pre></div>
<h3 id="&#20108;&#36827;&#21046;&#34920;&#31034;&#30340;&#35823;&#24046;">14.1. &#20108;&#36827;&#21046;&#34920;&#31034;&#30340;&#35823;&#24046;</h3>
<p>&#36825;&#19968;&#33410;&#23558;&#35814;&#32454;&#35299;&#37322;&#8220;0.1&#8221;&#37027;&#20010;&#31034;&#20363;&#65292;&#24182;&#21521;&#20320;&#28436;&#31034;&#23545;&#20110;&#31867;&#20284;&#30340;&#24773;&#20917;&#33258;&#24050;&#22914;&#20309;&#20570;&#19968;&#20010;&#31934;&#30830;&#30340;&#20998;&#26512;&#12290;&#20551;&#35774;&#20320;&#24050;&#32463;&#22522;&#26412;&#20102;&#35299;&#28014;&#28857;&#25968;&#30340;&#20108;&#36827;&#21046;&#34920;&#31034;&#12290;</p>
<p>&#20108;&#36827;&#21046;&#34920;&#31034;&#30340;&#35823;&#24046; &#25351;&#30340;&#26159;&#36825;&#19968;&#20107;&#23454;&#65292;&#19968;&#20123;&#65288;&#23454;&#38469;&#19978;&#26159;&#22823;&#22810;&#25968;) &#21313;&#36827;&#21046;&#23567;&#25968;&#19981;&#33021;&#31934;&#30830;&#22320;&#29992;&#20108;&#36827;&#21046;&#23567;&#25968;&#34920;&#31034;&#12290;&#36825;&#26159;&#20026;&#20160;&#20040; Python&#65288;&#25110;&#32773; Perl&#12289; C&#12289; C++&#12289; Java&#12289; Fortran&#21644;&#20854;&#20182;&#35768;&#22810;&#35821;&#35328;&#65289;&#36890;&#24120;&#19981;&#20250;&#26174;&#31034;&#20320;&#26399;&#26395;&#30340;&#31934;&#30830;&#30340;&#21313;&#36827;&#21046;&#25968;&#30340;&#20027;&#35201;&#21407;&#22240;&#12290;</p>
<p>&#36825;&#26159;&#20026;&#20160;&#20040;&#65311;1/10 &#21644; 2/10 &#19981;&#33021;&#29992;&#20108;&#36827;&#21046;&#23567;&#25968;&#31934;&#30830;&#34920;&#31034;&#12290;&#20170;&#22825;&#65288;2010 &#24180; 7 &#26376;&#65289;&#20960;&#20046;&#25152;&#26377;&#30340;&#26426;&#22120;&#37117;&#20351;&#29992; <code>IEEE-754</code> &#28014;&#28857;&#25968;&#31639;&#27861;&#65292;&#20960;&#20046;&#25152;&#26377;&#30340;&#24179;&#21488;&#37117;&#23558; Python &#30340;&#28014;&#28857;&#25968;&#26144;&#23556;&#25104; <code>IEEE-754</code>&#8220;&#21452;&#31934;&#24230;&#28014;&#28857;&#25968;&#8221;&#12290;754 &#21452;&#31934;&#24230;&#28014;&#28857;&#25968;&#21253;&#21547; 53 &#20301;&#30340;&#31934;&#24230;&#65292;&#25152;&#20197;&#36755;&#20837;&#26102;&#35745;&#31639;&#26426;&#21162;&#21147;&#23558; 0.1 &#36716;&#25442;&#20026;&#26368;&#25509;&#36817;&#30340; <code>J/2**N</code> &#24418;&#24335;&#30340;&#23567;&#25968;&#65292;&#20854;&#20013;J &#26159;&#19968;&#20010; 53 &#20301;&#30340;&#25972;&#25968;&#12290;&#25913;&#20889; <code>1 / 10 ~= J / (2**N)</code> &#20026; <code>J ~= 2**N / 10</code>: &#22238;&#24819;&#19968;&#19979; J &#26377; 53 &#20301;&#65288;&gt;= 2<strong>52&#20294;&lt; 2</strong>53&#65289;&#65292;&#25152;&#20197; N &#30340;&#26368;&#20339;&#20540;&#26159; 56&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> <span class="dv">2</span><span class="op">**</span><span class="dv">52</span> <span class="op">&lt;=</span>  <span class="dv">2</span><span class="op">**</span><span class="dv">56</span> <span class="op">//</span> <span class="dv">10</span>  <span class="op">&lt;</span> <span class="dv">2</span><span class="op">**</span><span class="dv">53</span>
<span class="va">True</span></code></pre></div>
<p>&#21363; 56 &#26159; N &#20445;&#35777; J &#20855;&#26377; 53 &#20301;&#31934;&#24230;&#30340;&#21807;&#19968;&#21487;&#33021;&#30340;&#20540;&#12290;J &#21487;&#33021;&#30340;&#26368;&#20339;&#20540;&#26159;&#21830;&#30340;&#33293;&#20837;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> q, r <span class="op">=</span> <span class="bu">divmod</span>(<span class="dv">2</span><span class="op">**</span><span class="dv">56</span>, <span class="dv">10</span>)
<span class="op">&gt;&gt;&gt;</span> r
<span class="dv">6</span></code></pre></div>
<p>&#30001;&#20110;&#20313;&#25968;&#22823;&#20110; 10 &#30340;&#19968;&#21322;&#65292;&#26368;&#20339;&#30340;&#36817;&#20284;&#20540;&#26159;&#21521;&#19978;&#33293;&#20837;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> q<span class="dv">+1</span>
<span class="dv">7205759403792794</span></code></pre></div>
<p>&#22240;&#27492;&#22312; 754 &#21452;&#31934;&#24230;&#19979; 1/10 &#30340;&#26368;&#20339;&#36817;&#20284;&#26159;&#65306;<code>7205759403792794 / 2 ** 56</code>, &#20998;&#23376;&#21644;&#20998;&#27597;&#37117;&#38500;&#20197;2&#23558;&#23567;&#25968;&#32553;&#23567;&#21040;&#65306;<code>3602879701896397 / 2 ** 55</code>. &#35831;&#27880;&#24847;&#30001;&#20110;&#25105;&#20204;&#21521;&#19978;&#33293;&#20837;&#65292;&#36825;&#20854;&#23454;&#26377;&#28857;&#22823;&#20110; 1/10&#65307;&#22914;&#26524;&#25105;&#20204;&#27809;&#26377;&#21521;&#19978;&#33293;&#20837;&#65292;&#21830;&#25968;&#23601;&#20250;&#26377;&#28857;&#23567;&#20110; 1/10&#12290;&#20294;&#22312;&#20219;&#20309;&#24773;&#20917;&#19979;&#23427;&#37117;&#19981;&#21487;&#33021;&#26159;&#31934;&#30830;&#30340; 1/10!</p>
<p>&#25152;&#20197;&#35745;&#31639;&#26426;&#20174;&#26469;&#27809;&#26377;&quot;&#30475;&#21040;&quot;1/10&#65306; &#23427;&#30475;&#21040;&#30340;&#26159;&#19978;&#38754;&#32473;&#20986;&#30340;&#31934;&#30830;&#30340;&#23567;&#25968;&#65292;754 &#21452;&#31934;&#24230;&#19979;&#21487;&#20197;&#33719;&#24471;&#30340;&#26368;&#20339;&#30340;&#36817;&#20284;&#20102;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> <span class="fl">0.1</span> <span class="op">*</span> <span class="dv">2</span> <span class="op">**</span> <span class="dv">55</span>
<span class="fl">3602879701896397.0</span></code></pre></div>
<p>&#22914;&#26524;&#25105;&#20204;&#25226;&#36825;&#23567;&#25968;&#20056;&#20197; <code>10**55</code>&#65292;&#25105;&#20204;&#21487;&#20197;&#30475;&#21040;&#20854;55&#20301;&#21313;&#36827;&#21046;&#25968;&#30340;&#20540;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> <span class="dv">3602879701896397</span> <span class="op">*</span> <span class="dv">10</span> <span class="op">**</span> <span class="dv">55</span> <span class="op">//</span> <span class="dv">2</span> <span class="op">**</span> <span class="dv">55</span>
<span class="dv">1000000000000000055511151231257827021181583404541015625</span></code></pre></div>
<p>&#20063;&#23601;&#26159;&#35828;&#23384;&#20648;&#22312;&#35745;&#31639;&#26426;&#20013;&#30340;&#31934;&#30830;&#25968;&#23383;&#31561;&#20110;&#21313;&#36827;&#21046;&#20540; <code>0.1000000000000000055511151231257827021181583404541015625</code>&#12290;&#35768;&#22810;&#35821;&#35328;&#65288;&#21253;&#25324;&#26087;&#29256;&#26412;&#30340;Python&#65289;&#20250;&#25226;&#32467;&#26524;&#33293;&#20837;&#21040;17&#20301;&#26377;&#25928;&#25968;&#23383;&#65292;&#32780;&#19981;&#26159;&#26174;&#31034;&#20840;&#37096;&#30340;&#21313;&#36827;&#21046;&#20540;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> <span class="bu">format</span>(<span class="fl">0.1</span>, <span class="st">&#39;.17f&#39;</span>)
<span class="co">&#39;0.10000000000000001&#39;</span></code></pre></div>
<p><code>fractions</code> &#21644; <code>decimal</code> &#27169;&#22359;&#20351;&#24471;&#36825;&#20123;&#35745;&#31639;&#24456;&#31616;&#21333;&#65306;</p>
<div class="sourceCode"><pre class="sourceCode python"><code class="sourceCode python"><span class="op">&gt;&gt;&gt;</span> <span class="im">from</span> decimal <span class="im">import</span> Decimal
<span class="op">&gt;&gt;&gt;</span> <span class="im">from</span> fractions <span class="im">import</span> Fraction

<span class="op">&gt;&gt;&gt;</span> Fraction.from_float(<span class="fl">0.1</span>)
Fraction(<span class="dv">3602879701896397</span>, <span class="dv">36028797018963968</span>)

<span class="op">&gt;&gt;&gt;</span> (<span class="fl">0.1</span>).as_integer_ratio()
(<span class="dv">3602879701896397</span>, <span class="dv">36028797018963968</span>)

<span class="op">&gt;&gt;&gt;</span> Decimal.from_float(<span class="fl">0.1</span>)
Decimal(<span class="st">&#39;0.1000000000000000055511151231257827021181583404541015625&#39;</span>)

<span class="op">&gt;&gt;&gt;</span> <span class="bu">format</span>(Decimal.from_float(<span class="fl">0.1</span>), <span class="st">&#39;.17&#39;</span>)
<span class="co">&#39;0.10000000000000001&#39;</span></code></pre></div>
</body>
</html>
